bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __SPP_MISC_REG_H__
#define  __SPP_MISC_REG_H__

#include "bl808.h"

/* 0x0 : config */
#define SPP_MISC_CONFIG_OFFSET                                  (0x0)
#define SPP_MISC_RG_DVPAS_ENABLE                                SPP_MISC_RG_DVPAS_ENABLE
#define SPP_MISC_RG_DVPAS_ENABLE_POS                            (0U)
#define SPP_MISC_RG_DVPAS_ENABLE_LEN                            (1U)
#define SPP_MISC_RG_DVPAS_ENABLE_MSK                            (((1U<<SPP_MISC_RG_DVPAS_ENABLE_LEN)-1)<<SPP_MISC_RG_DVPAS_ENABLE_POS)
#define SPP_MISC_RG_DVPAS_ENABLE_UMSK                           (~(((1U<<SPP_MISC_RG_DVPAS_ENABLE_LEN)-1)<<SPP_MISC_RG_DVPAS_ENABLE_POS))
#define SPP_MISC_RG_DVPAS_HS_INV                                SPP_MISC_RG_DVPAS_HS_INV
#define SPP_MISC_RG_DVPAS_HS_INV_POS                            (1U)
#define SPP_MISC_RG_DVPAS_HS_INV_LEN                            (1U)
#define SPP_MISC_RG_DVPAS_HS_INV_MSK                            (((1U<<SPP_MISC_RG_DVPAS_HS_INV_LEN)-1)<<SPP_MISC_RG_DVPAS_HS_INV_POS)
#define SPP_MISC_RG_DVPAS_HS_INV_UMSK                           (~(((1U<<SPP_MISC_RG_DVPAS_HS_INV_LEN)-1)<<SPP_MISC_RG_DVPAS_HS_INV_POS))
#define SPP_MISC_RG_DVPAS_VS_INV                                SPP_MISC_RG_DVPAS_VS_INV
#define SPP_MISC_RG_DVPAS_VS_INV_POS                            (2U)
#define SPP_MISC_RG_DVPAS_VS_INV_LEN                            (1U)
#define SPP_MISC_RG_DVPAS_VS_INV_MSK                            (((1U<<SPP_MISC_RG_DVPAS_VS_INV_LEN)-1)<<SPP_MISC_RG_DVPAS_VS_INV_POS)
#define SPP_MISC_RG_DVPAS_VS_INV_UMSK                           (~(((1U<<SPP_MISC_RG_DVPAS_VS_INV_LEN)-1)<<SPP_MISC_RG_DVPAS_VS_INV_POS))
#define SPP_MISC_RG_DVPAS_DA_ORDER                              SPP_MISC_RG_DVPAS_DA_ORDER
#define SPP_MISC_RG_DVPAS_DA_ORDER_POS                          (3U)
#define SPP_MISC_RG_DVPAS_DA_ORDER_LEN                          (1U)
#define SPP_MISC_RG_DVPAS_DA_ORDER_MSK                          (((1U<<SPP_MISC_RG_DVPAS_DA_ORDER_LEN)-1)<<SPP_MISC_RG_DVPAS_DA_ORDER_POS)
#define SPP_MISC_RG_DVPAS_DA_ORDER_UMSK                         (~(((1U<<SPP_MISC_RG_DVPAS_DA_ORDER_LEN)-1)<<SPP_MISC_RG_DVPAS_DA_ORDER_POS))
#define SPP_MISC_RG_DVPAS_FIFO_TH                               SPP_MISC_RG_DVPAS_FIFO_TH
#define SPP_MISC_RG_DVPAS_FIFO_TH_POS                           (16U)
#define SPP_MISC_RG_DVPAS_FIFO_TH_LEN                           (11U)
#define SPP_MISC_RG_DVPAS_FIFO_TH_MSK                           (((1U<<SPP_MISC_RG_DVPAS_FIFO_TH_LEN)-1)<<SPP_MISC_RG_DVPAS_FIFO_TH_POS)
#define SPP_MISC_RG_DVPAS_FIFO_TH_UMSK                          (~(((1U<<SPP_MISC_RG_DVPAS_FIFO_TH_LEN)-1)<<SPP_MISC_RG_DVPAS_FIFO_TH_POS))
#define SPP_MISC_CR_SPP_DE_AS_HSYNC                             SPP_MISC_CR_SPP_DE_AS_HSYNC
#define SPP_MISC_CR_SPP_DE_AS_HSYNC_POS                         (30U)
#define SPP_MISC_CR_SPP_DE_AS_HSYNC_LEN                         (1U)
#define SPP_MISC_CR_SPP_DE_AS_HSYNC_MSK                         (((1U<<SPP_MISC_CR_SPP_DE_AS_HSYNC_LEN)-1)<<SPP_MISC_CR_SPP_DE_AS_HSYNC_POS)
#define SPP_MISC_CR_SPP_DE_AS_HSYNC_UMSK                        (~(((1U<<SPP_MISC_CR_SPP_DE_AS_HSYNC_LEN)-1)<<SPP_MISC_CR_SPP_DE_AS_HSYNC_POS))
#define SPP_MISC_REG_SPP_PCLK_FORCE_ON                          SPP_MISC_REG_SPP_PCLK_FORCE_ON
#define SPP_MISC_REG_SPP_PCLK_FORCE_ON_POS                      (31U)
#define SPP_MISC_REG_SPP_PCLK_FORCE_ON_LEN                      (1U)
#define SPP_MISC_REG_SPP_PCLK_FORCE_ON_MSK                      (((1U<<SPP_MISC_REG_SPP_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_REG_SPP_PCLK_FORCE_ON_POS)
#define SPP_MISC_REG_SPP_PCLK_FORCE_ON_UMSK                     (~(((1U<<SPP_MISC_REG_SPP_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_REG_SPP_PCLK_FORCE_ON_POS))

/* 0x4 : pix_data_ctrl */
#define SPP_MISC_PIX_DATA_CTRL_OFFSET                           (0x4)
#define SPP_MISC_REG_PIX_DATA_CTRL                              SPP_MISC_REG_PIX_DATA_CTRL
#define SPP_MISC_REG_PIX_DATA_CTRL_POS                          (0U)
#define SPP_MISC_REG_PIX_DATA_CTRL_LEN                          (12U)
#define SPP_MISC_REG_PIX_DATA_CTRL_MSK                          (((1U<<SPP_MISC_REG_PIX_DATA_CTRL_LEN)-1)<<SPP_MISC_REG_PIX_DATA_CTRL_POS)
#define SPP_MISC_REG_PIX_DATA_CTRL_UMSK                         (~(((1U<<SPP_MISC_REG_PIX_DATA_CTRL_LEN)-1)<<SPP_MISC_REG_PIX_DATA_CTRL_POS))
#define SPP_MISC_REG_PIX_DATA_SHT_BIT                           SPP_MISC_REG_PIX_DATA_SHT_BIT
#define SPP_MISC_REG_PIX_DATA_SHT_BIT_POS                       (16U)
#define SPP_MISC_REG_PIX_DATA_SHT_BIT_LEN                       (4U)
#define SPP_MISC_REG_PIX_DATA_SHT_BIT_MSK                       (((1U<<SPP_MISC_REG_PIX_DATA_SHT_BIT_LEN)-1)<<SPP_MISC_REG_PIX_DATA_SHT_BIT_POS)
#define SPP_MISC_REG_PIX_DATA_SHT_BIT_UMSK                      (~(((1U<<SPP_MISC_REG_PIX_DATA_SHT_BIT_LEN)-1)<<SPP_MISC_REG_PIX_DATA_SHT_BIT_POS))
#define SPP_MISC_REG_PIX_DATA_SHT_DIR                           SPP_MISC_REG_PIX_DATA_SHT_DIR
#define SPP_MISC_REG_PIX_DATA_SHT_DIR_POS                       (20U)
#define SPP_MISC_REG_PIX_DATA_SHT_DIR_LEN                       (1U)
#define SPP_MISC_REG_PIX_DATA_SHT_DIR_MSK                       (((1U<<SPP_MISC_REG_PIX_DATA_SHT_DIR_LEN)-1)<<SPP_MISC_REG_PIX_DATA_SHT_DIR_POS)
#define SPP_MISC_REG_PIX_DATA_SHT_DIR_UMSK                      (~(((1U<<SPP_MISC_REG_PIX_DATA_SHT_DIR_LEN)-1)<<SPP_MISC_REG_PIX_DATA_SHT_DIR_POS))
#define SPP_MISC_REG_SPP_DTSRC_SRC                              SPP_MISC_REG_SPP_DTSRC_SRC
#define SPP_MISC_REG_SPP_DTSRC_SRC_POS                          (31U)
#define SPP_MISC_REG_SPP_DTSRC_SRC_LEN                          (1U)
#define SPP_MISC_REG_SPP_DTSRC_SRC_MSK                          (((1U<<SPP_MISC_REG_SPP_DTSRC_SRC_LEN)-1)<<SPP_MISC_REG_SPP_DTSRC_SRC_POS)
#define SPP_MISC_REG_SPP_DTSRC_SRC_UMSK                         (~(((1U<<SPP_MISC_REG_SPP_DTSRC_SRC_LEN)-1)<<SPP_MISC_REG_SPP_DTSRC_SRC_POS))

/* 0x8 : dvp2bus_src_sel_1 */
#define SPP_MISC_DVP2BUS_SRC_SEL_1_OFFSET                       (0x8)
#define SPP_MISC_RG_D2B_DVP_SEL_A                               SPP_MISC_RG_D2B_DVP_SEL_A
#define SPP_MISC_RG_D2B_DVP_SEL_A_POS                           (0U)
#define SPP_MISC_RG_D2B_DVP_SEL_A_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_A_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_A_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_A_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_A_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_A_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_A_POS))
#define SPP_MISC_RG_D2X_ID_SEL_A                                SPP_MISC_RG_D2X_ID_SEL_A
#define SPP_MISC_RG_D2X_ID_SEL_A_POS                            (7U)
#define SPP_MISC_RG_D2X_ID_SEL_A_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_A_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_A_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_A_POS)
#define SPP_MISC_RG_D2X_ID_SEL_A_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_A_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_A_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_B                               SPP_MISC_RG_D2B_DVP_SEL_B
#define SPP_MISC_RG_D2B_DVP_SEL_B_POS                           (8U)
#define SPP_MISC_RG_D2B_DVP_SEL_B_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_B_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_B_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_B_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_B_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_B_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_B_POS))
#define SPP_MISC_RG_D2X_ID_SEL_B                                SPP_MISC_RG_D2X_ID_SEL_B
#define SPP_MISC_RG_D2X_ID_SEL_B_POS                            (15U)
#define SPP_MISC_RG_D2X_ID_SEL_B_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_B_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_B_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_B_POS)
#define SPP_MISC_RG_D2X_ID_SEL_B_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_B_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_B_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_C                               SPP_MISC_RG_D2B_DVP_SEL_C
#define SPP_MISC_RG_D2B_DVP_SEL_C_POS                           (16U)
#define SPP_MISC_RG_D2B_DVP_SEL_C_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_C_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_C_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_C_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_C_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_C_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_C_POS))
#define SPP_MISC_RG_D2X_ID_SEL_C                                SPP_MISC_RG_D2X_ID_SEL_C
#define SPP_MISC_RG_D2X_ID_SEL_C_POS                            (23U)
#define SPP_MISC_RG_D2X_ID_SEL_C_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_C_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_C_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_C_POS)
#define SPP_MISC_RG_D2X_ID_SEL_C_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_C_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_C_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_D                               SPP_MISC_RG_D2B_DVP_SEL_D
#define SPP_MISC_RG_D2B_DVP_SEL_D_POS                           (24U)
#define SPP_MISC_RG_D2B_DVP_SEL_D_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_D_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_D_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_D_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_D_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_D_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_D_POS))
#define SPP_MISC_RG_D2X_ID_SEL_D                                SPP_MISC_RG_D2X_ID_SEL_D
#define SPP_MISC_RG_D2X_ID_SEL_D_POS                            (31U)
#define SPP_MISC_RG_D2X_ID_SEL_D_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_D_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_D_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_D_POS)
#define SPP_MISC_RG_D2X_ID_SEL_D_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_D_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_D_POS))

/* 0xC : dvp_frame_m_to_n */
#define SPP_MISC_DVP_FRAME_M_TO_N_OFFSET                        (0xC)
#define SPP_MISC_CR_FRAME_M_TO_N_EN                             SPP_MISC_CR_FRAME_M_TO_N_EN
#define SPP_MISC_CR_FRAME_M_TO_N_EN_POS                         (0U)
#define SPP_MISC_CR_FRAME_M_TO_N_EN_LEN                         (1U)
#define SPP_MISC_CR_FRAME_M_TO_N_EN_MSK                         (((1U<<SPP_MISC_CR_FRAME_M_TO_N_EN_LEN)-1)<<SPP_MISC_CR_FRAME_M_TO_N_EN_POS)
#define SPP_MISC_CR_FRAME_M_TO_N_EN_UMSK                        (~(((1U<<SPP_MISC_CR_FRAME_M_TO_N_EN_LEN)-1)<<SPP_MISC_CR_FRAME_M_TO_N_EN_POS))
#define SPP_MISC_CR_FRAME_INTERVAL                              SPP_MISC_CR_FRAME_INTERVAL
#define SPP_MISC_CR_FRAME_INTERVAL_POS                          (4U)
#define SPP_MISC_CR_FRAME_INTERVAL_LEN                          (4U)
#define SPP_MISC_CR_FRAME_INTERVAL_MSK                          (((1U<<SPP_MISC_CR_FRAME_INTERVAL_LEN)-1)<<SPP_MISC_CR_FRAME_INTERVAL_POS)
#define SPP_MISC_CR_FRAME_INTERVAL_UMSK                         (~(((1U<<SPP_MISC_CR_FRAME_INTERVAL_LEN)-1)<<SPP_MISC_CR_FRAME_INTERVAL_POS))
#define SPP_MISC_CR_FRAME_CNT_N                                 SPP_MISC_CR_FRAME_CNT_N
#define SPP_MISC_CR_FRAME_CNT_N_POS                             (8U)
#define SPP_MISC_CR_FRAME_CNT_N_LEN                             (4U)
#define SPP_MISC_CR_FRAME_CNT_N_MSK                             (((1U<<SPP_MISC_CR_FRAME_CNT_N_LEN)-1)<<SPP_MISC_CR_FRAME_CNT_N_POS)
#define SPP_MISC_CR_FRAME_CNT_N_UMSK                            (~(((1U<<SPP_MISC_CR_FRAME_CNT_N_LEN)-1)<<SPP_MISC_CR_FRAME_CNT_N_POS))
#define SPP_MISC_CR_FRAME_CNT_M                                 SPP_MISC_CR_FRAME_CNT_M
#define SPP_MISC_CR_FRAME_CNT_M_POS                             (12U)
#define SPP_MISC_CR_FRAME_CNT_M_LEN                             (4U)
#define SPP_MISC_CR_FRAME_CNT_M_MSK                             (((1U<<SPP_MISC_CR_FRAME_CNT_M_LEN)-1)<<SPP_MISC_CR_FRAME_CNT_M_POS)
#define SPP_MISC_CR_FRAME_CNT_M_UMSK                            (~(((1U<<SPP_MISC_CR_FRAME_CNT_M_LEN)-1)<<SPP_MISC_CR_FRAME_CNT_M_POS))

/* 0x10 : spp_id_bayer */
#define SPP_MISC_SPP_ID_BAYER_OFFSET                            (0x10)
#define SPP_MISC_REG_BAYER_IDGEN_RST                            SPP_MISC_REG_BAYER_IDGEN_RST
#define SPP_MISC_REG_BAYER_IDGEN_RST_POS                        (0U)
#define SPP_MISC_REG_BAYER_IDGEN_RST_LEN                        (1U)
#define SPP_MISC_REG_BAYER_IDGEN_RST_MSK                        (((1U<<SPP_MISC_REG_BAYER_IDGEN_RST_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_RST_POS)
#define SPP_MISC_REG_BAYER_IDGEN_RST_UMSK                       (~(((1U<<SPP_MISC_REG_BAYER_IDGEN_RST_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_RST_POS))
#define SPP_MISC_REG_BAYER_IDGEN_EDGE                           SPP_MISC_REG_BAYER_IDGEN_EDGE
#define SPP_MISC_REG_BAYER_IDGEN_EDGE_POS                       (1U)
#define SPP_MISC_REG_BAYER_IDGEN_EDGE_LEN                       (1U)
#define SPP_MISC_REG_BAYER_IDGEN_EDGE_MSK                       (((1U<<SPP_MISC_REG_BAYER_IDGEN_EDGE_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_EDGE_POS)
#define SPP_MISC_REG_BAYER_IDGEN_EDGE_UMSK                      (~(((1U<<SPP_MISC_REG_BAYER_IDGEN_EDGE_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_EDGE_POS))
#define SPP_MISC_REG_BAYER_IDGEN_CNT_INCR                       SPP_MISC_REG_BAYER_IDGEN_CNT_INCR
#define SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_POS                   (16U)
#define SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN                   (16U)
#define SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_MSK                   (((1U<<SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_POS)
#define SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_UMSK                  (~(((1U<<SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN)-1)<<SPP_MISC_REG_BAYER_IDGEN_CNT_INCR_POS))

/* 0x14 : dvp2bus_src_sel_2 */
#define SPP_MISC_DVP2BUS_SRC_SEL_2_OFFSET                       (0x14)
#define SPP_MISC_RG_D2B_DVP_SEL_E                               SPP_MISC_RG_D2B_DVP_SEL_E
#define SPP_MISC_RG_D2B_DVP_SEL_E_POS                           (0U)
#define SPP_MISC_RG_D2B_DVP_SEL_E_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_E_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_E_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_E_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_E_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_E_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_E_POS))
#define SPP_MISC_RG_D2X_ID_SEL_E                                SPP_MISC_RG_D2X_ID_SEL_E
#define SPP_MISC_RG_D2X_ID_SEL_E_POS                            (7U)
#define SPP_MISC_RG_D2X_ID_SEL_E_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_E_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_E_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_E_POS)
#define SPP_MISC_RG_D2X_ID_SEL_E_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_E_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_E_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_F                               SPP_MISC_RG_D2B_DVP_SEL_F
#define SPP_MISC_RG_D2B_DVP_SEL_F_POS                           (8U)
#define SPP_MISC_RG_D2B_DVP_SEL_F_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_F_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_F_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_F_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_F_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_F_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_F_POS))
#define SPP_MISC_RG_D2X_ID_SEL_F                                SPP_MISC_RG_D2X_ID_SEL_F
#define SPP_MISC_RG_D2X_ID_SEL_F_POS                            (15U)
#define SPP_MISC_RG_D2X_ID_SEL_F_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_F_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_F_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_F_POS)
#define SPP_MISC_RG_D2X_ID_SEL_F_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_F_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_F_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_G                               SPP_MISC_RG_D2B_DVP_SEL_G
#define SPP_MISC_RG_D2B_DVP_SEL_G_POS                           (16U)
#define SPP_MISC_RG_D2B_DVP_SEL_G_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_G_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_G_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_G_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_G_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_G_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_G_POS))
#define SPP_MISC_RG_D2X_ID_SEL_G                                SPP_MISC_RG_D2X_ID_SEL_G
#define SPP_MISC_RG_D2X_ID_SEL_G_POS                            (23U)
#define SPP_MISC_RG_D2X_ID_SEL_G_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_G_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_G_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_G_POS)
#define SPP_MISC_RG_D2X_ID_SEL_G_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_G_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_G_POS))
#define SPP_MISC_RG_D2B_DVP_SEL_H                               SPP_MISC_RG_D2B_DVP_SEL_H
#define SPP_MISC_RG_D2B_DVP_SEL_H_POS                           (24U)
#define SPP_MISC_RG_D2B_DVP_SEL_H_LEN                           (6U)
#define SPP_MISC_RG_D2B_DVP_SEL_H_MSK                           (((1U<<SPP_MISC_RG_D2B_DVP_SEL_H_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_H_POS)
#define SPP_MISC_RG_D2B_DVP_SEL_H_UMSK                          (~(((1U<<SPP_MISC_RG_D2B_DVP_SEL_H_LEN)-1)<<SPP_MISC_RG_D2B_DVP_SEL_H_POS))
#define SPP_MISC_RG_D2X_ID_SEL_H                                SPP_MISC_RG_D2X_ID_SEL_H
#define SPP_MISC_RG_D2X_ID_SEL_H_POS                            (31U)
#define SPP_MISC_RG_D2X_ID_SEL_H_LEN                            (1U)
#define SPP_MISC_RG_D2X_ID_SEL_H_MSK                            (((1U<<SPP_MISC_RG_D2X_ID_SEL_H_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_H_POS)
#define SPP_MISC_RG_D2X_ID_SEL_H_UMSK                           (~(((1U<<SPP_MISC_RG_D2X_ID_SEL_H_LEN)-1)<<SPP_MISC_RG_D2X_ID_SEL_H_POS))

