bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x20 : int_clr */
#define SPP_MISC_INT_CLR_OFFSET                                 (0x20)
#define SPP_MISC_RG_RESERVEB_INT_CLR                                 SPP_MISC_RG_RESERVEB_INT_CLR
#define SPP_MISC_RG_RESERVEB_INT_CLR_POS                             (0U)
#define SPP_MISC_RG_RESERVEB_INT_CLR_LEN                             (1U)
#define SPP_MISC_RG_RESERVEB_INT_CLR_MSK                             (((1U<<SPP_MISC_RG_RESERVEB_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB_INT_CLR_POS)
#define SPP_MISC_RG_RESERVEB_INT_CLR_UMSK                            (~(((1U<<SPP_MISC_RG_RESERVEB_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB_INT_CLR_POS))
#define SPP_MISC_RG_RESERVEA_INT_CLR                                  SPP_MISC_RG_RESERVEA_INT_CLR
#define SPP_MISC_RG_RESERVEA_INT_CLR_POS                              (1U)
#define SPP_MISC_RG_RESERVEA_INT_CLR_LEN                              (1U)
#define SPP_MISC_RG_RESERVEA_INT_CLR_MSK                              (((1U<<SPP_MISC_RG_RESERVEA_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEA_INT_CLR_POS)
#define SPP_MISC_RG_RESERVEA_INT_CLR_UMSK                             (~(((1U<<SPP_MISC_RG_RESERVEA_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEA_INT_CLR_POS))
#define SPP_MISC_RG_WR_INT_CLR                                 SPP_MISC_RG_WR_INT_CLR
#define SPP_MISC_RG_WR_INT_CLR_POS                             (2U)
#define SPP_MISC_RG_WR_INT_CLR_LEN                             (1U)
#define SPP_MISC_RG_WR_INT_CLR_MSK                             (((1U<<SPP_MISC_RG_WR_INT_CLR_LEN)-1)<<SPP_MISC_RG_WR_INT_CLR_POS)
#define SPP_MISC_RG_WR_INT_CLR_UMSK                            (~(((1U<<SPP_MISC_RG_WR_INT_CLR_LEN)-1)<<SPP_MISC_RG_WR_INT_CLR_POS))
#define SPP_MISC_RG_RESERVEB2_INT_CLR                                SPP_MISC_RG_RESERVEB2_INT_CLR
#define SPP_MISC_RG_RESERVEB2_INT_CLR_POS                            (3U)
#define SPP_MISC_RG_RESERVEB2_INT_CLR_LEN                            (1U)
#define SPP_MISC_RG_RESERVEB2_INT_CLR_MSK                            (((1U<<SPP_MISC_RG_RESERVEB2_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB2_INT_CLR_POS)
#define SPP_MISC_RG_RESERVEB2_INT_CLR_UMSK                           (~(((1U<<SPP_MISC_RG_RESERVEB2_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB2_INT_CLR_POS))
#define SPP_MISC_RG_OSD_PB_INT_CLR                              SPP_MISC_RG_OSD_PB_INT_CLR
#define SPP_MISC_RG_OSD_PB_INT_CLR_POS                          (4U)
#define SPP_MISC_RG_OSD_PB_INT_CLR_LEN                          (1U)
#define SPP_MISC_RG_OSD_PB_INT_CLR_MSK                          (((1U<<SPP_MISC_RG_OSD_PB_INT_CLR_LEN)-1)<<SPP_MISC_RG_OSD_PB_INT_CLR_POS)
#define SPP_MISC_RG_OSD_PB_INT_CLR_UMSK                         (~(((1U<<SPP_MISC_RG_OSD_PB_INT_CLR_LEN)-1)<<SPP_MISC_RG_OSD_PB_INT_CLR_POS))
#define SPP_MISC_RG_SEOF1_INT_CLR                               SPP_MISC_RG_SEOF1_INT_CLR
#define SPP_MISC_RG_SEOF1_INT_CLR_POS                           (8U)
#define SPP_MISC_RG_SEOF1_INT_CLR_LEN                           (1U)
#define SPP_MISC_RG_SEOF1_INT_CLR_MSK                           (((1U<<SPP_MISC_RG_SEOF1_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_CLR_POS)
#define SPP_MISC_RG_SEOF1_INT_CLR_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF1_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_CLR_POS))
#define SPP_MISC_RG_SEOF2_INT_CLR                               SPP_MISC_RG_SEOF2_INT_CLR
#define SPP_MISC_RG_SEOF2_INT_CLR_POS                           (9U)
#define SPP_MISC_RG_SEOF2_INT_CLR_LEN                           (1U)
#define SPP_MISC_RG_SEOF2_INT_CLR_MSK                           (((1U<<SPP_MISC_RG_SEOF2_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_CLR_POS)
#define SPP_MISC_RG_SEOF2_INT_CLR_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF2_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_CLR_POS))
#define SPP_MISC_RG_SEOF3_INT_CLR                               SPP_MISC_RG_SEOF3_INT_CLR
#define SPP_MISC_RG_SEOF3_INT_CLR_POS                           (10U)
#define SPP_MISC_RG_SEOF3_INT_CLR_LEN                           (1U)
#define SPP_MISC_RG_SEOF3_INT_CLR_MSK                           (((1U<<SPP_MISC_RG_SEOF3_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_CLR_POS)
#define SPP_MISC_RG_SEOF3_INT_CLR_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF3_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_CLR_POS))
#define SPP_MISC_RG_RESERVEA_HIST_INT_CLR                             SPP_MISC_RG_RESERVEA_HIST_INT_CLR
#define SPP_MISC_RG_RESERVEA_HIST_INT_CLR_POS                         (11U)
#define SPP_MISC_RG_RESERVEA_HIST_INT_CLR_LEN                         (1U)
#define SPP_MISC_RG_RESERVEA_HIST_INT_CLR_MSK                         (((1U<<SPP_MISC_RG_RESERVEA_HIST_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEA_HIST_INT_CLR_POS)
#define SPP_MISC_RG_RESERVEA_HIST_INT_CLR_UMSK                        (~(((1U<<SPP_MISC_RG_RESERVEA_HIST_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEA_HIST_INT_CLR_POS))
#define SPP_MISC_RG_RESERVEB3_INT_CLR                                SPP_MISC_RG_RESERVEB3_INT_CLR
#define SPP_MISC_RG_RESERVEB3_INT_CLR_POS                            (12U)
#define SPP_MISC_RG_RESERVEB3_INT_CLR_LEN                            (1U)
#define SPP_MISC_RG_RESERVEB3_INT_CLR_MSK                            (((1U<<SPP_MISC_RG_RESERVEB3_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB3_INT_CLR_POS)
#define SPP_MISC_RG_RESERVEB3_INT_CLR_UMSK                           (~(((1U<<SPP_MISC_RG_RESERVEB3_INT_CLR_LEN)-1)<<SPP_MISC_RG_RESERVEB3_INT_CLR_POS))
#define SPP_MISC_RG_DP_SEOF0_INT_CLR                            SPP_MISC_RG_DP_SEOF0_INT_CLR
#define SPP_MISC_RG_DP_SEOF0_INT_CLR_POS                        (13U)
#define SPP_MISC_RG_DP_SEOF0_INT_CLR_LEN                        (1U)
#define SPP_MISC_RG_DP_SEOF0_INT_CLR_MSK                        (((1U<<SPP_MISC_RG_DP_SEOF0_INT_CLR_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_CLR_POS)
#define SPP_MISC_RG_DP_SEOF0_INT_CLR_UMSK                       (~(((1U<<SPP_MISC_RG_DP_SEOF0_INT_CLR_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_CLR_POS))
#define SPP_MISC_RG_SEOF4_INT_CLR                               SPP_MISC_RG_SEOF4_INT_CLR
#define SPP_MISC_RG_SEOF4_INT_CLR_POS                           (14U)
#define SPP_MISC_RG_SEOF4_INT_CLR_LEN                           (1U)
#define SPP_MISC_RG_SEOF4_INT_CLR_MSK                           (((1U<<SPP_MISC_RG_SEOF4_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_CLR_POS)
#define SPP_MISC_RG_SEOF4_INT_CLR_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF4_INT_CLR_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_CLR_POS))

/* 0x24 : int_ctrl */
#define SPP_MISC_INT_CTRL_OFFSET                                (0x24)
#define SPP_MISC_RG_RESERVEA_INT_MASK                                 SPP_MISC_RG_RESERVEA_INT_MASK
#define SPP_MISC_RG_RESERVEA_INT_MASK_POS                             (0U)
#define SPP_MISC_RG_RESERVEA_INT_MASK_LEN                             (1U)
#define SPP_MISC_RG_RESERVEA_INT_MASK_MSK                             (((1U<<SPP_MISC_RG_RESERVEA_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEA_INT_MASK_POS)
#define SPP_MISC_RG_RESERVEA_INT_MASK_UMSK                            (~(((1U<<SPP_MISC_RG_RESERVEA_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEA_INT_MASK_POS))
#define SPP_MISC_RG_RESERVEB_INT_MASK                                SPP_MISC_RG_RESERVEB_INT_MASK
#define SPP_MISC_RG_RESERVEB_INT_MASK_POS                            (1U)
#define SPP_MISC_RG_RESERVEB_INT_MASK_LEN                            (1U)
#define SPP_MISC_RG_RESERVEB_INT_MASK_MSK                            (((1U<<SPP_MISC_RG_RESERVEB_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB_INT_MASK_POS)
#define SPP_MISC_RG_RESERVEB_INT_MASK_UMSK                           (~(((1U<<SPP_MISC_RG_RESERVEB_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB_INT_MASK_POS))
#define SPP_MISC_RG_WR_INT_MASK                                SPP_MISC_RG_WR_INT_MASK
#define SPP_MISC_RG_WR_INT_MASK_POS                            (2U)
#define SPP_MISC_RG_WR_INT_MASK_LEN                            (1U)
#define SPP_MISC_RG_WR_INT_MASK_MSK                            (((1U<<SPP_MISC_RG_WR_INT_MASK_LEN)-1)<<SPP_MISC_RG_WR_INT_MASK_POS)
#define SPP_MISC_RG_WR_INT_MASK_UMSK                           (~(((1U<<SPP_MISC_RG_WR_INT_MASK_LEN)-1)<<SPP_MISC_RG_WR_INT_MASK_POS))
#define SPP_MISC_RG_RESERVEB2_INT_MASK                               SPP_MISC_RG_RESERVEB2_INT_MASK
#define SPP_MISC_RG_RESERVEB2_INT_MASK_POS                           (3U)
#define SPP_MISC_RG_RESERVEB2_INT_MASK_LEN                           (1U)
#define SPP_MISC_RG_RESERVEB2_INT_MASK_MSK                           (((1U<<SPP_MISC_RG_RESERVEB2_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB2_INT_MASK_POS)
#define SPP_MISC_RG_RESERVEB2_INT_MASK_UMSK                          (~(((1U<<SPP_MISC_RG_RESERVEB2_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB2_INT_MASK_POS))
#define SPP_MISC_RG_OSD_PB_INT_MASK                             SPP_MISC_RG_OSD_PB_INT_MASK
#define SPP_MISC_RG_OSD_PB_INT_MASK_POS                         (4U)
#define SPP_MISC_RG_OSD_PB_INT_MASK_LEN                         (1U)
#define SPP_MISC_RG_OSD_PB_INT_MASK_MSK                         (((1U<<SPP_MISC_RG_OSD_PB_INT_MASK_LEN)-1)<<SPP_MISC_RG_OSD_PB_INT_MASK_POS)
#define SPP_MISC_RG_OSD_PB_INT_MASK_UMSK                        (~(((1U<<SPP_MISC_RG_OSD_PB_INT_MASK_LEN)-1)<<SPP_MISC_RG_OSD_PB_INT_MASK_POS))
#define SPP_MISC_RG_SEOF1_INT_MASK                              SPP_MISC_RG_SEOF1_INT_MASK
#define SPP_MISC_RG_SEOF1_INT_MASK_POS                          (8U)
#define SPP_MISC_RG_SEOF1_INT_MASK_LEN                          (1U)
#define SPP_MISC_RG_SEOF1_INT_MASK_MSK                          (((1U<<SPP_MISC_RG_SEOF1_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_MASK_POS)
#define SPP_MISC_RG_SEOF1_INT_MASK_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF1_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_MASK_POS))
#define SPP_MISC_RG_SEOF1_INT_EDGE                              SPP_MISC_RG_SEOF1_INT_EDGE
#define SPP_MISC_RG_SEOF1_INT_EDGE_POS                          (9U)
#define SPP_MISC_RG_SEOF1_INT_EDGE_LEN                          (1U)
#define SPP_MISC_RG_SEOF1_INT_EDGE_MSK                          (((1U<<SPP_MISC_RG_SEOF1_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_EDGE_POS)
#define SPP_MISC_RG_SEOF1_INT_EDGE_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF1_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_EDGE_POS))
#define SPP_MISC_RG_SEOF1_INT_SRC                               SPP_MISC_RG_SEOF1_INT_SRC
#define SPP_MISC_RG_SEOF1_INT_SRC_POS                           (10U)
#define SPP_MISC_RG_SEOF1_INT_SRC_LEN                           (2U)
#define SPP_MISC_RG_SEOF1_INT_SRC_MSK                           (((1U<<SPP_MISC_RG_SEOF1_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_SRC_POS)
#define SPP_MISC_RG_SEOF1_INT_SRC_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF1_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF1_INT_SRC_POS))
#define SPP_MISC_RG_SEOF2_INT_MASK                              SPP_MISC_RG_SEOF2_INT_MASK
#define SPP_MISC_RG_SEOF2_INT_MASK_POS                          (12U)
#define SPP_MISC_RG_SEOF2_INT_MASK_LEN                          (1U)
#define SPP_MISC_RG_SEOF2_INT_MASK_MSK                          (((1U<<SPP_MISC_RG_SEOF2_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_MASK_POS)
#define SPP_MISC_RG_SEOF2_INT_MASK_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF2_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_MASK_POS))
#define SPP_MISC_RG_SEOF2_INT_EDGE                              SPP_MISC_RG_SEOF2_INT_EDGE
#define SPP_MISC_RG_SEOF2_INT_EDGE_POS                          (13U)
#define SPP_MISC_RG_SEOF2_INT_EDGE_LEN                          (1U)
#define SPP_MISC_RG_SEOF2_INT_EDGE_MSK                          (((1U<<SPP_MISC_RG_SEOF2_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_EDGE_POS)
#define SPP_MISC_RG_SEOF2_INT_EDGE_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF2_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_EDGE_POS))
#define SPP_MISC_RG_SEOF2_INT_SRC                               SPP_MISC_RG_SEOF2_INT_SRC
#define SPP_MISC_RG_SEOF2_INT_SRC_POS                           (14U)
#define SPP_MISC_RG_SEOF2_INT_SRC_LEN                           (2U)
#define SPP_MISC_RG_SEOF2_INT_SRC_MSK                           (((1U<<SPP_MISC_RG_SEOF2_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_SRC_POS)
#define SPP_MISC_RG_SEOF2_INT_SRC_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF2_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF2_INT_SRC_POS))
#define SPP_MISC_RG_SEOF3_INT_MASK                              SPP_MISC_RG_SEOF3_INT_MASK
#define SPP_MISC_RG_SEOF3_INT_MASK_POS                          (16U)
#define SPP_MISC_RG_SEOF3_INT_MASK_LEN                          (1U)
#define SPP_MISC_RG_SEOF3_INT_MASK_MSK                          (((1U<<SPP_MISC_RG_SEOF3_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_MASK_POS)
#define SPP_MISC_RG_SEOF3_INT_MASK_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF3_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_MASK_POS))
#define SPP_MISC_RG_SEOF3_INT_EDGE                              SPP_MISC_RG_SEOF3_INT_EDGE
#define SPP_MISC_RG_SEOF3_INT_EDGE_POS                          (17U)
#define SPP_MISC_RG_SEOF3_INT_EDGE_LEN                          (1U)
#define SPP_MISC_RG_SEOF3_INT_EDGE_MSK                          (((1U<<SPP_MISC_RG_SEOF3_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_EDGE_POS)
#define SPP_MISC_RG_SEOF3_INT_EDGE_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF3_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_EDGE_POS))
#define SPP_MISC_RG_SEOF3_INT_SRC                               SPP_MISC_RG_SEOF3_INT_SRC
#define SPP_MISC_RG_SEOF3_INT_SRC_POS                           (18U)
#define SPP_MISC_RG_SEOF3_INT_SRC_LEN                           (2U)
#define SPP_MISC_RG_SEOF3_INT_SRC_MSK                           (((1U<<SPP_MISC_RG_SEOF3_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_SRC_POS)
#define SPP_MISC_RG_SEOF3_INT_SRC_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF3_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF3_INT_SRC_POS))
#define SPP_MISC_RG_RESERVEA_HIST_INT_MASK                            SPP_MISC_RG_RESERVEA_HIST_INT_MASK
#define SPP_MISC_RG_RESERVEA_HIST_INT_MASK_POS                        (20U)
#define SPP_MISC_RG_RESERVEA_HIST_INT_MASK_LEN                        (1U)
#define SPP_MISC_RG_RESERVEA_HIST_INT_MASK_MSK                        (((1U<<SPP_MISC_RG_RESERVEA_HIST_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEA_HIST_INT_MASK_POS)
#define SPP_MISC_RG_RESERVEA_HIST_INT_MASK_UMSK                       (~(((1U<<SPP_MISC_RG_RESERVEA_HIST_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEA_HIST_INT_MASK_POS))
#define SPP_MISC_RG_RESERVEB3_INT_MASK                               SPP_MISC_RG_RESERVEB3_INT_MASK
#define SPP_MISC_RG_RESERVEB3_INT_MASK_POS                           (21U)
#define SPP_MISC_RG_RESERVEB3_INT_MASK_LEN                           (1U)
#define SPP_MISC_RG_RESERVEB3_INT_MASK_MSK                           (((1U<<SPP_MISC_RG_RESERVEB3_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB3_INT_MASK_POS)
#define SPP_MISC_RG_RESERVEB3_INT_MASK_UMSK                          (~(((1U<<SPP_MISC_RG_RESERVEB3_INT_MASK_LEN)-1)<<SPP_MISC_RG_RESERVEB3_INT_MASK_POS))
#define SPP_MISC_RG_DP_SEOF0_INT_SRC                            SPP_MISC_RG_DP_SEOF0_INT_SRC
#define SPP_MISC_RG_DP_SEOF0_INT_SRC_POS                        (22U)
#define SPP_MISC_RG_DP_SEOF0_INT_SRC_LEN                        (1U)
#define SPP_MISC_RG_DP_SEOF0_INT_SRC_MSK                        (((1U<<SPP_MISC_RG_DP_SEOF0_INT_SRC_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_SRC_POS)
#define SPP_MISC_RG_DP_SEOF0_INT_SRC_UMSK                       (~(((1U<<SPP_MISC_RG_DP_SEOF0_INT_SRC_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_SRC_POS))
#define SPP_MISC_RG_DP_SEOF0_INT_EDGE                           SPP_MISC_RG_DP_SEOF0_INT_EDGE
#define SPP_MISC_RG_DP_SEOF0_INT_EDGE_POS                       (23U)
#define SPP_MISC_RG_DP_SEOF0_INT_EDGE_LEN                       (1U)
#define SPP_MISC_RG_DP_SEOF0_INT_EDGE_MSK                       (((1U<<SPP_MISC_RG_DP_SEOF0_INT_EDGE_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_EDGE_POS)
#define SPP_MISC_RG_DP_SEOF0_INT_EDGE_UMSK                      (~(((1U<<SPP_MISC_RG_DP_SEOF0_INT_EDGE_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_EDGE_POS))
#define SPP_MISC_RG_DP_SEOF0_INT_MASK                           SPP_MISC_RG_DP_SEOF0_INT_MASK
#define SPP_MISC_RG_DP_SEOF0_INT_MASK_POS                       (24U)
#define SPP_MISC_RG_DP_SEOF0_INT_MASK_LEN                       (1U)
#define SPP_MISC_RG_DP_SEOF0_INT_MASK_MSK                       (((1U<<SPP_MISC_RG_DP_SEOF0_INT_MASK_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_MASK_POS)
#define SPP_MISC_RG_DP_SEOF0_INT_MASK_UMSK                      (~(((1U<<SPP_MISC_RG_DP_SEOF0_INT_MASK_LEN)-1)<<SPP_MISC_RG_DP_SEOF0_INT_MASK_POS))
#define SPP_MISC_RG_SEOF4_INT_MASK                              SPP_MISC_RG_SEOF4_INT_MASK
#define SPP_MISC_RG_SEOF4_INT_MASK_POS                          (28U)
#define SPP_MISC_RG_SEOF4_INT_MASK_LEN                          (1U)
#define SPP_MISC_RG_SEOF4_INT_MASK_MSK                          (((1U<<SPP_MISC_RG_SEOF4_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_MASK_POS)
#define SPP_MISC_RG_SEOF4_INT_MASK_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF4_INT_MASK_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_MASK_POS))
#define SPP_MISC_RG_SEOF4_INT_EDGE                              SPP_MISC_RG_SEOF4_INT_EDGE
#define SPP_MISC_RG_SEOF4_INT_EDGE_POS                          (29U)
#define SPP_MISC_RG_SEOF4_INT_EDGE_LEN                          (1U)
#define SPP_MISC_RG_SEOF4_INT_EDGE_MSK                          (((1U<<SPP_MISC_RG_SEOF4_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_EDGE_POS)
#define SPP_MISC_RG_SEOF4_INT_EDGE_UMSK                         (~(((1U<<SPP_MISC_RG_SEOF4_INT_EDGE_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_EDGE_POS))
#define SPP_MISC_RG_SEOF4_INT_SRC                               SPP_MISC_RG_SEOF4_INT_SRC
#define SPP_MISC_RG_SEOF4_INT_SRC_POS                           (30U)
#define SPP_MISC_RG_SEOF4_INT_SRC_LEN                           (2U)
#define SPP_MISC_RG_SEOF4_INT_SRC_MSK                           (((1U<<SPP_MISC_RG_SEOF4_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_SRC_POS)
#define SPP_MISC_RG_SEOF4_INT_SRC_UMSK                          (~(((1U<<SPP_MISC_RG_SEOF4_INT_SRC_LEN)-1)<<SPP_MISC_RG_SEOF4_INT_SRC_POS))

/* 0x28 : spp_id_yuv */
#define SPP_MISC_SPP_ID_YUV_OFFSET                              (0x28)
#define SPP_MISC_REG_YUV_IDGEN_RST                              SPP_MISC_REG_YUV_IDGEN_RST
#define SPP_MISC_REG_YUV_IDGEN_RST_POS                          (0U)
#define SPP_MISC_REG_YUV_IDGEN_RST_LEN                          (1U)
#define SPP_MISC_REG_YUV_IDGEN_RST_MSK                          (((1U<<SPP_MISC_REG_YUV_IDGEN_RST_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_RST_POS)
#define SPP_MISC_REG_YUV_IDGEN_RST_UMSK                         (~(((1U<<SPP_MISC_REG_YUV_IDGEN_RST_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_RST_POS))
#define SPP_MISC_REG_YUV_IDGEN_EDGE                             SPP_MISC_REG_YUV_IDGEN_EDGE
#define SPP_MISC_REG_YUV_IDGEN_EDGE_POS                         (1U)
#define SPP_MISC_REG_YUV_IDGEN_EDGE_LEN                         (1U)
#define SPP_MISC_REG_YUV_IDGEN_EDGE_MSK                         (((1U<<SPP_MISC_REG_YUV_IDGEN_EDGE_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_EDGE_POS)
#define SPP_MISC_REG_YUV_IDGEN_EDGE_UMSK                        (~(((1U<<SPP_MISC_REG_YUV_IDGEN_EDGE_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_EDGE_POS))
#define SPP_MISC_REG_YUV_IDGEN_CNT_INCR                         SPP_MISC_REG_YUV_IDGEN_CNT_INCR
#define SPP_MISC_REG_YUV_IDGEN_CNT_INCR_POS                     (16U)
#define SPP_MISC_REG_YUV_IDGEN_CNT_INCR_LEN                     (16U)
#define SPP_MISC_REG_YUV_IDGEN_CNT_INCR_MSK                     (((1U<<SPP_MISC_REG_YUV_IDGEN_CNT_INCR_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_CNT_INCR_POS)
#define SPP_MISC_REG_YUV_IDGEN_CNT_INCR_UMSK                    (~(((1U<<SPP_MISC_REG_YUV_IDGEN_CNT_INCR_LEN)-1)<<SPP_MISC_REG_YUV_IDGEN_CNT_INCR_POS))

/* 0x2C : dvp_reshape */
#define SPP_MISC_DVP_RESHAPE_OFFSET                             (0x2C)
#define SPP_MISC_REG_RSHP_TGL_COUNT                             SPP_MISC_REG_RSHP_TGL_COUNT
#define SPP_MISC_REG_RSHP_TGL_COUNT_POS                         (0U)
#define SPP_MISC_REG_RSHP_TGL_COUNT_LEN                         (5U)
#define SPP_MISC_REG_RSHP_TGL_COUNT_MSK                         (((1U<<SPP_MISC_REG_RSHP_TGL_COUNT_LEN)-1)<<SPP_MISC_REG_RSHP_TGL_COUNT_POS)
#define SPP_MISC_REG_RSHP_TGL_COUNT_UMSK                        (~(((1U<<SPP_MISC_REG_RSHP_TGL_COUNT_LEN)-1)<<SPP_MISC_REG_RSHP_TGL_COUNT_POS))
#define SPP_MISC_REG_RSHP_HSYNC_INV                             SPP_MISC_REG_RSHP_HSYNC_INV
#define SPP_MISC_REG_RSHP_HSYNC_INV_POS                         (5U)
#define SPP_MISC_REG_RSHP_HSYNC_INV_LEN                         (1U)
#define SPP_MISC_REG_RSHP_HSYNC_INV_MSK                         (((1U<<SPP_MISC_REG_RSHP_HSYNC_INV_LEN)-1)<<SPP_MISC_REG_RSHP_HSYNC_INV_POS)
#define SPP_MISC_REG_RSHP_HSYNC_INV_UMSK                        (~(((1U<<SPP_MISC_REG_RSHP_HSYNC_INV_LEN)-1)<<SPP_MISC_REG_RSHP_HSYNC_INV_POS))
#define SPP_MISC_REG_RSHP_VSYNC_INV                             SPP_MISC_REG_RSHP_VSYNC_INV
#define SPP_MISC_REG_RSHP_VSYNC_INV_POS                         (6U)
#define SPP_MISC_REG_RSHP_VSYNC_INV_LEN                         (1U)
#define SPP_MISC_REG_RSHP_VSYNC_INV_MSK                         (((1U<<SPP_MISC_REG_RSHP_VSYNC_INV_LEN)-1)<<SPP_MISC_REG_RSHP_VSYNC_INV_POS)
#define SPP_MISC_REG_RSHP_VSYNC_INV_UMSK                        (~(((1U<<SPP_MISC_REG_RSHP_VSYNC_INV_LEN)-1)<<SPP_MISC_REG_RSHP_VSYNC_INV_POS))
#define SPP_MISC_REG_RSHP_CLR                                   SPP_MISC_REG_RSHP_CLR
#define SPP_MISC_REG_RSHP_CLR_POS                               (7U)
#define SPP_MISC_REG_RSHP_CLR_LEN                               (1U)
#define SPP_MISC_REG_RSHP_CLR_MSK                               (((1U<<SPP_MISC_REG_RSHP_CLR_LEN)-1)<<SPP_MISC_REG_RSHP_CLR_POS)
#define SPP_MISC_REG_RSHP_CLR_UMSK                              (~(((1U<<SPP_MISC_REG_RSHP_CLR_LEN)-1)<<SPP_MISC_REG_RSHP_CLR_POS))
#define SPP_MISC_REG_RSHP_EN                                    SPP_MISC_REG_RSHP_EN
#define SPP_MISC_REG_RSHP_EN_POS                                (8U)
#define SPP_MISC_REG_RSHP_EN_LEN                                (1U)
#define SPP_MISC_REG_RSHP_EN_MSK                                (((1U<<SPP_MISC_REG_RSHP_EN_LEN)-1)<<SPP_MISC_REG_RSHP_EN_POS)
#define SPP_MISC_REG_RSHP_EN_UMSK                               (~(((1U<<SPP_MISC_REG_RSHP_EN_LEN)-1)<<SPP_MISC_REG_RSHP_EN_POS))

