bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x40 : scalerA_i_size */
#define SPP_MISC_SCALERA_I_SIZE_OFFSET                          (0x40)
#define SPP_MISC_RG_SCALERA_I_W                                 SPP_MISC_RG_SCALERA_I_W
#define SPP_MISC_RG_SCALERA_I_W_POS                             (0U)
#define SPP_MISC_RG_SCALERA_I_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERA_I_W_MSK                             (((1U<<SPP_MISC_RG_SCALERA_I_W_LEN)-1)<<SPP_MISC_RG_SCALERA_I_W_POS)
#define SPP_MISC_RG_SCALERA_I_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERA_I_W_LEN)-1)<<SPP_MISC_RG_SCALERA_I_W_POS))
#define SPP_MISC_RG_SCALERA_I_H                                 SPP_MISC_RG_SCALERA_I_H
#define SPP_MISC_RG_SCALERA_I_H_POS                             (16U)
#define SPP_MISC_RG_SCALERA_I_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERA_I_H_MSK                             (((1U<<SPP_MISC_RG_SCALERA_I_H_LEN)-1)<<SPP_MISC_RG_SCALERA_I_H_POS)
#define SPP_MISC_RG_SCALERA_I_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERA_I_H_LEN)-1)<<SPP_MISC_RG_SCALERA_I_H_POS))
#define SPP_MISC_RG_SCLRA_SW_SH                                 SPP_MISC_RG_SCLRA_SW_SH
#define SPP_MISC_RG_SCLRA_SW_SH_POS                             (27U)
#define SPP_MISC_RG_SCLRA_SW_SH_LEN                             (1U)
#define SPP_MISC_RG_SCLRA_SW_SH_MSK                             (((1U<<SPP_MISC_RG_SCLRA_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRA_SW_SH_POS)
#define SPP_MISC_RG_SCLRA_SW_SH_UMSK                            (~(((1U<<SPP_MISC_RG_SCLRA_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRA_SW_SH_POS))
#define SPP_MISC_RG_SCALERA_BYPASS                              SPP_MISC_RG_SCALERA_BYPASS
#define SPP_MISC_RG_SCALERA_BYPASS_POS                          (28U)
#define SPP_MISC_RG_SCALERA_BYPASS_LEN                          (1U)
#define SPP_MISC_RG_SCALERA_BYPASS_MSK                          (((1U<<SPP_MISC_RG_SCALERA_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERA_BYPASS_POS)
#define SPP_MISC_RG_SCALERA_BYPASS_UMSK                         (~(((1U<<SPP_MISC_RG_SCALERA_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERA_BYPASS_POS))
#define SPP_MISC_RG_SCALERA_SEL                                 SPP_MISC_RG_SCALERA_SEL
#define SPP_MISC_RG_SCALERA_SEL_POS                             (29U)
#define SPP_MISC_RG_SCALERA_SEL_LEN                             (3U)
#define SPP_MISC_RG_SCALERA_SEL_MSK                             (((1U<<SPP_MISC_RG_SCALERA_SEL_LEN)-1)<<SPP_MISC_RG_SCALERA_SEL_POS)
#define SPP_MISC_RG_SCALERA_SEL_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERA_SEL_LEN)-1)<<SPP_MISC_RG_SCALERA_SEL_POS))

/* 0x44 : scalerA_o_size */
#define SPP_MISC_SCALERA_O_SIZE_OFFSET                          (0x44)
#define SPP_MISC_RG_SCALERA_O_W                                 SPP_MISC_RG_SCALERA_O_W
#define SPP_MISC_RG_SCALERA_O_W_POS                             (0U)
#define SPP_MISC_RG_SCALERA_O_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERA_O_W_MSK                             (((1U<<SPP_MISC_RG_SCALERA_O_W_LEN)-1)<<SPP_MISC_RG_SCALERA_O_W_POS)
#define SPP_MISC_RG_SCALERA_O_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERA_O_W_LEN)-1)<<SPP_MISC_RG_SCALERA_O_W_POS))
#define SPP_MISC_RG_SCALERA_O_H                                 SPP_MISC_RG_SCALERA_O_H
#define SPP_MISC_RG_SCALERA_O_H_POS                             (16U)
#define SPP_MISC_RG_SCALERA_O_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERA_O_H_MSK                             (((1U<<SPP_MISC_RG_SCALERA_O_H_LEN)-1)<<SPP_MISC_RG_SCALERA_O_H_POS)
#define SPP_MISC_RG_SCALERA_O_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERA_O_H_LEN)-1)<<SPP_MISC_RG_SCALERA_O_H_POS))

/* 0x48 : scalerB_i_size */
#define SPP_MISC_SCALERB_I_SIZE_OFFSET                          (0x48)
#define SPP_MISC_RG_SCALERB_I_W                                 SPP_MISC_RG_SCALERB_I_W
#define SPP_MISC_RG_SCALERB_I_W_POS                             (0U)
#define SPP_MISC_RG_SCALERB_I_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERB_I_W_MSK                             (((1U<<SPP_MISC_RG_SCALERB_I_W_LEN)-1)<<SPP_MISC_RG_SCALERB_I_W_POS)
#define SPP_MISC_RG_SCALERB_I_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERB_I_W_LEN)-1)<<SPP_MISC_RG_SCALERB_I_W_POS))
#define SPP_MISC_RG_SCALERB_I_H                                 SPP_MISC_RG_SCALERB_I_H
#define SPP_MISC_RG_SCALERB_I_H_POS                             (16U)
#define SPP_MISC_RG_SCALERB_I_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERB_I_H_MSK                             (((1U<<SPP_MISC_RG_SCALERB_I_H_LEN)-1)<<SPP_MISC_RG_SCALERB_I_H_POS)
#define SPP_MISC_RG_SCALERB_I_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERB_I_H_LEN)-1)<<SPP_MISC_RG_SCALERB_I_H_POS))
#define SPP_MISC_RG_SCLRB_SW_SH                                 SPP_MISC_RG_SCLRB_SW_SH
#define SPP_MISC_RG_SCLRB_SW_SH_POS                             (27U)
#define SPP_MISC_RG_SCLRB_SW_SH_LEN                             (1U)
#define SPP_MISC_RG_SCLRB_SW_SH_MSK                             (((1U<<SPP_MISC_RG_SCLRB_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRB_SW_SH_POS)
#define SPP_MISC_RG_SCLRB_SW_SH_UMSK                            (~(((1U<<SPP_MISC_RG_SCLRB_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRB_SW_SH_POS))
#define SPP_MISC_RG_SCALERB_BYPASS                              SPP_MISC_RG_SCALERB_BYPASS
#define SPP_MISC_RG_SCALERB_BYPASS_POS                          (28U)
#define SPP_MISC_RG_SCALERB_BYPASS_LEN                          (1U)
#define SPP_MISC_RG_SCALERB_BYPASS_MSK                          (((1U<<SPP_MISC_RG_SCALERB_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERB_BYPASS_POS)
#define SPP_MISC_RG_SCALERB_BYPASS_UMSK                         (~(((1U<<SPP_MISC_RG_SCALERB_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERB_BYPASS_POS))
#define SPP_MISC_RG_SCALERB_SEL                                 SPP_MISC_RG_SCALERB_SEL
#define SPP_MISC_RG_SCALERB_SEL_POS                             (29U)
#define SPP_MISC_RG_SCALERB_SEL_LEN                             (3U)
#define SPP_MISC_RG_SCALERB_SEL_MSK                             (((1U<<SPP_MISC_RG_SCALERB_SEL_LEN)-1)<<SPP_MISC_RG_SCALERB_SEL_POS)
#define SPP_MISC_RG_SCALERB_SEL_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERB_SEL_LEN)-1)<<SPP_MISC_RG_SCALERB_SEL_POS))

/* 0x4C : scalerB_o_size */
#define SPP_MISC_SCALERB_O_SIZE_OFFSET                          (0x4C)
#define SPP_MISC_RG_SCALERB_O_W                                 SPP_MISC_RG_SCALERB_O_W
#define SPP_MISC_RG_SCALERB_O_W_POS                             (0U)
#define SPP_MISC_RG_SCALERB_O_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERB_O_W_MSK                             (((1U<<SPP_MISC_RG_SCALERB_O_W_LEN)-1)<<SPP_MISC_RG_SCALERB_O_W_POS)
#define SPP_MISC_RG_SCALERB_O_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERB_O_W_LEN)-1)<<SPP_MISC_RG_SCALERB_O_W_POS))
#define SPP_MISC_RG_SCALERB_O_H                                 SPP_MISC_RG_SCALERB_O_H
#define SPP_MISC_RG_SCALERB_O_H_POS                             (16U)
#define SPP_MISC_RG_SCALERB_O_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERB_O_H_MSK                             (((1U<<SPP_MISC_RG_SCALERB_O_H_LEN)-1)<<SPP_MISC_RG_SCALERB_O_H_POS)
#define SPP_MISC_RG_SCALERB_O_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERB_O_H_LEN)-1)<<SPP_MISC_RG_SCALERB_O_H_POS))

/* 0x50 : scalerC_i_size */
#define SPP_MISC_SCALERC_I_SIZE_OFFSET                          (0x50)
#define SPP_MISC_RG_SCALERC_I_W                                 SPP_MISC_RG_SCALERC_I_W
#define SPP_MISC_RG_SCALERC_I_W_POS                             (0U)
#define SPP_MISC_RG_SCALERC_I_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERC_I_W_MSK                             (((1U<<SPP_MISC_RG_SCALERC_I_W_LEN)-1)<<SPP_MISC_RG_SCALERC_I_W_POS)
#define SPP_MISC_RG_SCALERC_I_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERC_I_W_LEN)-1)<<SPP_MISC_RG_SCALERC_I_W_POS))
#define SPP_MISC_RG_SCALERC_I_H                                 SPP_MISC_RG_SCALERC_I_H
#define SPP_MISC_RG_SCALERC_I_H_POS                             (16U)
#define SPP_MISC_RG_SCALERC_I_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERC_I_H_MSK                             (((1U<<SPP_MISC_RG_SCALERC_I_H_LEN)-1)<<SPP_MISC_RG_SCALERC_I_H_POS)
#define SPP_MISC_RG_SCALERC_I_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERC_I_H_LEN)-1)<<SPP_MISC_RG_SCALERC_I_H_POS))
#define SPP_MISC_RG_SCLRC_SW_SH                                 SPP_MISC_RG_SCLRC_SW_SH
#define SPP_MISC_RG_SCLRC_SW_SH_POS                             (27U)
#define SPP_MISC_RG_SCLRC_SW_SH_LEN                             (1U)
#define SPP_MISC_RG_SCLRC_SW_SH_MSK                             (((1U<<SPP_MISC_RG_SCLRC_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRC_SW_SH_POS)
#define SPP_MISC_RG_SCLRC_SW_SH_UMSK                            (~(((1U<<SPP_MISC_RG_SCLRC_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRC_SW_SH_POS))
#define SPP_MISC_RG_SCALERC_BYPASS                              SPP_MISC_RG_SCALERC_BYPASS
#define SPP_MISC_RG_SCALERC_BYPASS_POS                          (28U)
#define SPP_MISC_RG_SCALERC_BYPASS_LEN                          (1U)
#define SPP_MISC_RG_SCALERC_BYPASS_MSK                          (((1U<<SPP_MISC_RG_SCALERC_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERC_BYPASS_POS)
#define SPP_MISC_RG_SCALERC_BYPASS_UMSK                         (~(((1U<<SPP_MISC_RG_SCALERC_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERC_BYPASS_POS))
#define SPP_MISC_RG_SCALERC_SEL                                 SPP_MISC_RG_SCALERC_SEL
#define SPP_MISC_RG_SCALERC_SEL_POS                             (29U)
#define SPP_MISC_RG_SCALERC_SEL_LEN                             (3U)
#define SPP_MISC_RG_SCALERC_SEL_MSK                             (((1U<<SPP_MISC_RG_SCALERC_SEL_LEN)-1)<<SPP_MISC_RG_SCALERC_SEL_POS)
#define SPP_MISC_RG_SCALERC_SEL_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERC_SEL_LEN)-1)<<SPP_MISC_RG_SCALERC_SEL_POS))

/* 0x54 : scalerC_o_size */
#define SPP_MISC_SCALERC_O_SIZE_OFFSET                          (0x54)
#define SPP_MISC_RG_SCALERC_O_W                                 SPP_MISC_RG_SCALERC_O_W
#define SPP_MISC_RG_SCALERC_O_W_POS                             (0U)
#define SPP_MISC_RG_SCALERC_O_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERC_O_W_MSK                             (((1U<<SPP_MISC_RG_SCALERC_O_W_LEN)-1)<<SPP_MISC_RG_SCALERC_O_W_POS)
#define SPP_MISC_RG_SCALERC_O_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERC_O_W_LEN)-1)<<SPP_MISC_RG_SCALERC_O_W_POS))
#define SPP_MISC_RG_SCALERC_O_H                                 SPP_MISC_RG_SCALERC_O_H
#define SPP_MISC_RG_SCALERC_O_H_POS                             (16U)
#define SPP_MISC_RG_SCALERC_O_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERC_O_H_MSK                             (((1U<<SPP_MISC_RG_SCALERC_O_H_LEN)-1)<<SPP_MISC_RG_SCALERC_O_H_POS)
#define SPP_MISC_RG_SCALERC_O_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERC_O_H_LEN)-1)<<SPP_MISC_RG_SCALERC_O_H_POS))

/* 0x58 : scalerD_i_size */
#define SPP_MISC_SCALERD_I_SIZE_OFFSET                          (0x58)
#define SPP_MISC_RG_SCALERD_I_W                                 SPP_MISC_RG_SCALERD_I_W
#define SPP_MISC_RG_SCALERD_I_W_POS                             (0U)
#define SPP_MISC_RG_SCALERD_I_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERD_I_W_MSK                             (((1U<<SPP_MISC_RG_SCALERD_I_W_LEN)-1)<<SPP_MISC_RG_SCALERD_I_W_POS)
#define SPP_MISC_RG_SCALERD_I_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERD_I_W_LEN)-1)<<SPP_MISC_RG_SCALERD_I_W_POS))
#define SPP_MISC_RG_SCALERD_I_H                                 SPP_MISC_RG_SCALERD_I_H
#define SPP_MISC_RG_SCALERD_I_H_POS                             (16U)
#define SPP_MISC_RG_SCALERD_I_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERD_I_H_MSK                             (((1U<<SPP_MISC_RG_SCALERD_I_H_LEN)-1)<<SPP_MISC_RG_SCALERD_I_H_POS)
#define SPP_MISC_RG_SCALERD_I_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERD_I_H_LEN)-1)<<SPP_MISC_RG_SCALERD_I_H_POS))
#define SPP_MISC_RG_SCLRD_SW_SH                                 SPP_MISC_RG_SCLRD_SW_SH
#define SPP_MISC_RG_SCLRD_SW_SH_POS                             (27U)
#define SPP_MISC_RG_SCLRD_SW_SH_LEN                             (1U)
#define SPP_MISC_RG_SCLRD_SW_SH_MSK                             (((1U<<SPP_MISC_RG_SCLRD_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRD_SW_SH_POS)
#define SPP_MISC_RG_SCLRD_SW_SH_UMSK                            (~(((1U<<SPP_MISC_RG_SCLRD_SW_SH_LEN)-1)<<SPP_MISC_RG_SCLRD_SW_SH_POS))
#define SPP_MISC_RG_SCALERD_BYPASS                              SPP_MISC_RG_SCALERD_BYPASS
#define SPP_MISC_RG_SCALERD_BYPASS_POS                          (28U)
#define SPP_MISC_RG_SCALERD_BYPASS_LEN                          (1U)
#define SPP_MISC_RG_SCALERD_BYPASS_MSK                          (((1U<<SPP_MISC_RG_SCALERD_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERD_BYPASS_POS)
#define SPP_MISC_RG_SCALERD_BYPASS_UMSK                         (~(((1U<<SPP_MISC_RG_SCALERD_BYPASS_LEN)-1)<<SPP_MISC_RG_SCALERD_BYPASS_POS))
#define SPP_MISC_RG_SCALERD_SEL                                 SPP_MISC_RG_SCALERD_SEL
#define SPP_MISC_RG_SCALERD_SEL_POS                             (29U)
#define SPP_MISC_RG_SCALERD_SEL_LEN                             (3U)
#define SPP_MISC_RG_SCALERD_SEL_MSK                             (((1U<<SPP_MISC_RG_SCALERD_SEL_LEN)-1)<<SPP_MISC_RG_SCALERD_SEL_POS)
#define SPP_MISC_RG_SCALERD_SEL_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERD_SEL_LEN)-1)<<SPP_MISC_RG_SCALERD_SEL_POS))

/* 0x5C : scalerD_o_size */
#define SPP_MISC_SCALERD_O_SIZE_OFFSET                          (0x5C)
#define SPP_MISC_RG_SCALERD_O_W                                 SPP_MISC_RG_SCALERD_O_W
#define SPP_MISC_RG_SCALERD_O_W_POS                             (0U)
#define SPP_MISC_RG_SCALERD_O_W_LEN                             (11U)
#define SPP_MISC_RG_SCALERD_O_W_MSK                             (((1U<<SPP_MISC_RG_SCALERD_O_W_LEN)-1)<<SPP_MISC_RG_SCALERD_O_W_POS)
#define SPP_MISC_RG_SCALERD_O_W_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERD_O_W_LEN)-1)<<SPP_MISC_RG_SCALERD_O_W_POS))
#define SPP_MISC_RG_SCALERD_O_H                                 SPP_MISC_RG_SCALERD_O_H
#define SPP_MISC_RG_SCALERD_O_H_POS                             (16U)
#define SPP_MISC_RG_SCALERD_O_H_LEN                             (11U)
#define SPP_MISC_RG_SCALERD_O_H_MSK                             (((1U<<SPP_MISC_RG_SCALERD_O_H_LEN)-1)<<SPP_MISC_RG_SCALERD_O_H_POS)
#define SPP_MISC_RG_SCALERD_O_H_UMSK                            (~(((1U<<SPP_MISC_RG_SCALERD_O_H_LEN)-1)<<SPP_MISC_RG_SCALERD_O_H_POS))

/* 0x60 : disp_config */
#define SPP_MISC_DISP_CONFIG_OFFSET                             (0x60)
#define SPP_MISC_RG_DISP_BT656_EN                               SPP_MISC_RG_DISP_BT656_EN
#define SPP_MISC_RG_DISP_BT656_EN_POS                           (4U)
#define SPP_MISC_RG_DISP_BT656_EN_LEN                           (1U)
#define SPP_MISC_RG_DISP_BT656_EN_MSK                           (((1U<<SPP_MISC_RG_DISP_BT656_EN_LEN)-1)<<SPP_MISC_RG_DISP_BT656_EN_POS)
#define SPP_MISC_RG_DISP_BT656_EN_UMSK                          (~(((1U<<SPP_MISC_RG_DISP_BT656_EN_LEN)-1)<<SPP_MISC_RG_DISP_BT656_EN_POS))
#define SPP_MISC_RG_DISP_BT1120_EN                              SPP_MISC_RG_DISP_BT1120_EN
#define SPP_MISC_RG_DISP_BT1120_EN_POS                          (5U)
#define SPP_MISC_RG_DISP_BT1120_EN_LEN                          (1U)
#define SPP_MISC_RG_DISP_BT1120_EN_MSK                          (((1U<<SPP_MISC_RG_DISP_BT1120_EN_LEN)-1)<<SPP_MISC_RG_DISP_BT1120_EN_POS)
#define SPP_MISC_RG_DISP_BT1120_EN_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_BT1120_EN_LEN)-1)<<SPP_MISC_RG_DISP_BT1120_EN_POS))
#define SPP_MISC_RG_DISP_DPI_EN                                 SPP_MISC_RG_DISP_DPI_EN
#define SPP_MISC_RG_DISP_DPI_EN_POS                             (6U)
#define SPP_MISC_RG_DISP_DPI_EN_LEN                             (1U)
#define SPP_MISC_RG_DISP_DPI_EN_MSK                             (((1U<<SPP_MISC_RG_DISP_DPI_EN_LEN)-1)<<SPP_MISC_RG_DISP_DPI_EN_POS)
#define SPP_MISC_RG_DISP_DPI_EN_UMSK                            (~(((1U<<SPP_MISC_RG_DISP_DPI_EN_LEN)-1)<<SPP_MISC_RG_DISP_DPI_EN_POS))
#define SPP_MISC_RG_DISP_HDMI_EN                                SPP_MISC_RG_DISP_HDMI_EN
#define SPP_MISC_RG_DISP_HDMI_EN_POS                            (7U)
#define SPP_MISC_RG_DISP_HDMI_EN_LEN                            (1U)
#define SPP_MISC_RG_DISP_HDMI_EN_MSK                            (((1U<<SPP_MISC_RG_DISP_HDMI_EN_LEN)-1)<<SPP_MISC_RG_DISP_HDMI_EN_POS)
#define SPP_MISC_RG_DISP_HDMI_EN_UMSK                           (~(((1U<<SPP_MISC_RG_DISP_HDMI_EN_LEN)-1)<<SPP_MISC_RG_DISP_HDMI_EN_POS))
#define SPP_MISC_RG_DISP_MUX_SEL                                SPP_MISC_RG_DISP_MUX_SEL
#define SPP_MISC_RG_DISP_MUX_SEL_POS                            (8U)
#define SPP_MISC_RG_DISP_MUX_SEL_LEN                            (2U)
#define SPP_MISC_RG_DISP_MUX_SEL_MSK                            (((1U<<SPP_MISC_RG_DISP_MUX_SEL_LEN)-1)<<SPP_MISC_RG_DISP_MUX_SEL_POS)
#define SPP_MISC_RG_DISP_MUX_SEL_UMSK                           (~(((1U<<SPP_MISC_RG_DISP_MUX_SEL_LEN)-1)<<SPP_MISC_RG_DISP_MUX_SEL_POS))
#define SPP_MISC_RG_OSDDP_SEL                                   SPP_MISC_RG_OSDDP_SEL
#define SPP_MISC_RG_OSDDP_SEL_POS                               (12U)
#define SPP_MISC_RG_OSDDP_SEL_LEN                               (2U)
#define SPP_MISC_RG_OSDDP_SEL_MSK                               (((1U<<SPP_MISC_RG_OSDDP_SEL_LEN)-1)<<SPP_MISC_RG_OSDDP_SEL_POS)
#define SPP_MISC_RG_OSDDP_SEL_UMSK                              (~(((1U<<SPP_MISC_RG_OSDDP_SEL_LEN)-1)<<SPP_MISC_RG_OSDDP_SEL_POS))
#define SPP_MISC_RG_DISP_CLKO_INV                               SPP_MISC_RG_DISP_CLKO_INV
#define SPP_MISC_RG_DISP_CLKO_INV_POS                           (31U)
#define SPP_MISC_RG_DISP_CLKO_INV_LEN                           (1U)
#define SPP_MISC_RG_DISP_CLKO_INV_MSK                           (((1U<<SPP_MISC_RG_DISP_CLKO_INV_LEN)-1)<<SPP_MISC_RG_DISP_CLKO_INV_POS)
#define SPP_MISC_RG_DISP_CLKO_INV_UMSK                          (~(((1U<<SPP_MISC_RG_DISP_CLKO_INV_LEN)-1)<<SPP_MISC_RG_DISP_CLKO_INV_POS))

