bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x64 : disp_dpi_config */
#define SPP_MISC_DISP_DPI_CONFIG_OFFSET                         (0x64)
#define SPP_MISC_RG_DISP_DPI_HS_W                               SPP_MISC_RG_DISP_DPI_HS_W
#define SPP_MISC_RG_DISP_DPI_HS_W_POS                           (0U)
#define SPP_MISC_RG_DISP_DPI_HS_W_LEN                           (8U)
#define SPP_MISC_RG_DISP_DPI_HS_W_MSK                           (((1U<<SPP_MISC_RG_DISP_DPI_HS_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_HS_W_POS)
#define SPP_MISC_RG_DISP_DPI_HS_W_UMSK                          (~(((1U<<SPP_MISC_RG_DISP_DPI_HS_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_HS_W_POS))
#define SPP_MISC_RG_DISP_DPI_HFP_W                              SPP_MISC_RG_DISP_DPI_HFP_W
#define SPP_MISC_RG_DISP_DPI_HFP_W_POS                          (8U)
#define SPP_MISC_RG_DISP_DPI_HFP_W_LEN                          (8U)
#define SPP_MISC_RG_DISP_DPI_HFP_W_MSK                          (((1U<<SPP_MISC_RG_DISP_DPI_HFP_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_HFP_W_POS)
#define SPP_MISC_RG_DISP_DPI_HFP_W_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_DPI_HFP_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_HFP_W_POS))
#define SPP_MISC_RG_DISP_DPI_VS_W                               SPP_MISC_RG_DISP_DPI_VS_W
#define SPP_MISC_RG_DISP_DPI_VS_W_POS                           (16U)
#define SPP_MISC_RG_DISP_DPI_VS_W_LEN                           (8U)
#define SPP_MISC_RG_DISP_DPI_VS_W_MSK                           (((1U<<SPP_MISC_RG_DISP_DPI_VS_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_VS_W_POS)
#define SPP_MISC_RG_DISP_DPI_VS_W_UMSK                          (~(((1U<<SPP_MISC_RG_DISP_DPI_VS_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_VS_W_POS))
#define SPP_MISC_RG_DISP_DPI_VFP_W                              SPP_MISC_RG_DISP_DPI_VFP_W
#define SPP_MISC_RG_DISP_DPI_VFP_W_POS                          (24U)
#define SPP_MISC_RG_DISP_DPI_VFP_W_LEN                          (8U)
#define SPP_MISC_RG_DISP_DPI_VFP_W_MSK                          (((1U<<SPP_MISC_RG_DISP_DPI_VFP_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_VFP_W_POS)
#define SPP_MISC_RG_DISP_DPI_VFP_W_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_DPI_VFP_W_LEN)-1)<<SPP_MISC_RG_DISP_DPI_VFP_W_POS))

/* 0x68 : disp_yuv_rgb_config_0 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_0_OFFSET                   (0x68)
#define SPP_MISC_RG_DISP_Y2R_PRE_0                              SPP_MISC_RG_DISP_Y2R_PRE_0
#define SPP_MISC_RG_DISP_Y2R_PRE_0_POS                          (0U)
#define SPP_MISC_RG_DISP_Y2R_PRE_0_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_PRE_0_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_PRE_0_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_0_POS)
#define SPP_MISC_RG_DISP_Y2R_PRE_0_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_PRE_0_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_0_POS))
#define SPP_MISC_RG_DISP_Y2R_PRE_1                              SPP_MISC_RG_DISP_Y2R_PRE_1
#define SPP_MISC_RG_DISP_Y2R_PRE_1_POS                          (10U)
#define SPP_MISC_RG_DISP_Y2R_PRE_1_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_PRE_1_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_PRE_1_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_1_POS)
#define SPP_MISC_RG_DISP_Y2R_PRE_1_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_PRE_1_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_1_POS))
#define SPP_MISC_RG_DISP_Y2R_PRE_2                              SPP_MISC_RG_DISP_Y2R_PRE_2
#define SPP_MISC_RG_DISP_Y2R_PRE_2_POS                          (20U)
#define SPP_MISC_RG_DISP_Y2R_PRE_2_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_PRE_2_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_PRE_2_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_2_POS)
#define SPP_MISC_RG_DISP_Y2R_PRE_2_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_PRE_2_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_PRE_2_POS))
#define SPP_MISC_RG_DISP_Y2R_EN                                 SPP_MISC_RG_DISP_Y2R_EN
#define SPP_MISC_RG_DISP_Y2R_EN_POS                             (31U)
#define SPP_MISC_RG_DISP_Y2R_EN_LEN                             (1U)
#define SPP_MISC_RG_DISP_Y2R_EN_MSK                             (((1U<<SPP_MISC_RG_DISP_Y2R_EN_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_EN_POS)
#define SPP_MISC_RG_DISP_Y2R_EN_UMSK                            (~(((1U<<SPP_MISC_RG_DISP_Y2R_EN_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_EN_POS))

/* 0x6C : disp_yuv_rgb_config_1 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_1_OFFSET                   (0x6C)
#define SPP_MISC_RG_DISP_Y2R_POS_0                              SPP_MISC_RG_DISP_Y2R_POS_0
#define SPP_MISC_RG_DISP_Y2R_POS_0_POS                          (0U)
#define SPP_MISC_RG_DISP_Y2R_POS_0_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_POS_0_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_POS_0_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_0_POS)
#define SPP_MISC_RG_DISP_Y2R_POS_0_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_POS_0_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_0_POS))
#define SPP_MISC_RG_DISP_Y2R_POS_1                              SPP_MISC_RG_DISP_Y2R_POS_1
#define SPP_MISC_RG_DISP_Y2R_POS_1_POS                          (10U)
#define SPP_MISC_RG_DISP_Y2R_POS_1_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_POS_1_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_POS_1_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_1_POS)
#define SPP_MISC_RG_DISP_Y2R_POS_1_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_POS_1_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_1_POS))
#define SPP_MISC_RG_DISP_Y2R_POS_2                              SPP_MISC_RG_DISP_Y2R_POS_2
#define SPP_MISC_RG_DISP_Y2R_POS_2_POS                          (20U)
#define SPP_MISC_RG_DISP_Y2R_POS_2_LEN                          (9U)
#define SPP_MISC_RG_DISP_Y2R_POS_2_MSK                          (((1U<<SPP_MISC_RG_DISP_Y2R_POS_2_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_2_POS)
#define SPP_MISC_RG_DISP_Y2R_POS_2_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_Y2R_POS_2_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_POS_2_POS))

/* 0x70 : disp_yuv_rgb_config_2 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_2_OFFSET                   (0x70)
#define SPP_MISC_RG_DISP_Y2R_MTX_00                             SPP_MISC_RG_DISP_Y2R_MTX_00
#define SPP_MISC_RG_DISP_Y2R_MTX_00_POS                         (0U)
#define SPP_MISC_RG_DISP_Y2R_MTX_00_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_00_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_00_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_00_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_00_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_00_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_00_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_01                             SPP_MISC_RG_DISP_Y2R_MTX_01
#define SPP_MISC_RG_DISP_Y2R_MTX_01_POS                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_01_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_01_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_01_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_01_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_01_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_01_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_01_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_02_L                           SPP_MISC_RG_DISP_Y2R_MTX_02_L
#define SPP_MISC_RG_DISP_Y2R_MTX_02_L_POS                       (24U)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_L_LEN                       (8U)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_L_MSK                       (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_02_L_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_02_L_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_L_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_02_L_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_02_L_POS))

