bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x74 : disp_yuv_rgb_config_3 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_3_OFFSET                   (0x74)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_U                           SPP_MISC_RG_DISP_Y2R_MTX_02_U
#define SPP_MISC_RG_DISP_Y2R_MTX_02_U_POS                       (0U)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_U_LEN                       (4U)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_U_MSK                       (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_02_U_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_02_U_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_02_U_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_02_U_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_02_U_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_10                             SPP_MISC_RG_DISP_Y2R_MTX_10
#define SPP_MISC_RG_DISP_Y2R_MTX_10_POS                         (4U)
#define SPP_MISC_RG_DISP_Y2R_MTX_10_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_10_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_10_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_10_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_10_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_10_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_10_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_11                             SPP_MISC_RG_DISP_Y2R_MTX_11
#define SPP_MISC_RG_DISP_Y2R_MTX_11_POS                         (16U)
#define SPP_MISC_RG_DISP_Y2R_MTX_11_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_11_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_11_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_11_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_11_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_11_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_11_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_12_L                           SPP_MISC_RG_DISP_Y2R_MTX_12_L
#define SPP_MISC_RG_DISP_Y2R_MTX_12_L_POS                       (28U)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_L_LEN                       (4U)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_L_MSK                       (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_12_L_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_12_L_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_L_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_12_L_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_12_L_POS))

/* 0x78 : disp_yuv_rgb_config_4 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_4_OFFSET                   (0x78)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_U                           SPP_MISC_RG_DISP_Y2R_MTX_12_U
#define SPP_MISC_RG_DISP_Y2R_MTX_12_U_POS                       (0U)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_U_LEN                       (8U)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_U_MSK                       (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_12_U_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_12_U_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_12_U_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_12_U_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_12_U_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_20                             SPP_MISC_RG_DISP_Y2R_MTX_20
#define SPP_MISC_RG_DISP_Y2R_MTX_20_POS                         (8U)
#define SPP_MISC_RG_DISP_Y2R_MTX_20_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_20_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_20_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_20_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_20_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_20_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_20_POS))
#define SPP_MISC_RG_DISP_Y2R_MTX_21                             SPP_MISC_RG_DISP_Y2R_MTX_21
#define SPP_MISC_RG_DISP_Y2R_MTX_21_POS                         (20U)
#define SPP_MISC_RG_DISP_Y2R_MTX_21_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_21_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_21_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_21_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_21_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_21_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_21_POS))

/* 0x7C : disp_yuv_rgb_config_5 */
#define SPP_MISC_DISP_YUV_RGB_CONFIG_5_OFFSET                   (0x7C)
#define SPP_MISC_RG_DISP_Y2R_MTX_22                             SPP_MISC_RG_DISP_Y2R_MTX_22
#define SPP_MISC_RG_DISP_Y2R_MTX_22_POS                         (0U)
#define SPP_MISC_RG_DISP_Y2R_MTX_22_LEN                         (12U)
#define SPP_MISC_RG_DISP_Y2R_MTX_22_MSK                         (((1U<<SPP_MISC_RG_DISP_Y2R_MTX_22_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_22_POS)
#define SPP_MISC_RG_DISP_Y2R_MTX_22_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_Y2R_MTX_22_LEN)-1)<<SPP_MISC_RG_DISP_Y2R_MTX_22_POS))

/* 0x80 : spp_subsys_bus_ctrl */
#define SPP_MISC_SPP_SUBSYS_BUS_CTRL_OFFSET                     (0x80)
#define SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON                       SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON
#define SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_POS                   (0U)
#define SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_LEN                   (16U)
#define SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_MSK                   (((1U<<SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_POS)
#define SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_UMSK                  (~(((1U<<SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_RG_SPP_SUB_PCLK_FORCE_ON_POS))
#define SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON                      SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON
#define SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_POS                  (16U)
#define SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_LEN                  (16U)
#define SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_MSK                  (((1U<<SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_POS)
#define SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_UMSK                 (~(((1U<<SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_LEN)-1)<<SPP_MISC_RG_SPP_PERI_PCLK_FORCE_ON_POS))

/* 0xA0 : osdA_i_ctrl */
#define SPP_MISC_OSDA_I_CTRL_OFFSET                             (0xA0)
#define SPP_MISC_RG_OSD_PB_SEL                                  SPP_MISC_RG_OSD_PB_SEL
#define SPP_MISC_RG_OSD_PB_SEL_POS                              (0U)
#define SPP_MISC_RG_OSD_PB_SEL_LEN                              (1U)
#define SPP_MISC_RG_OSD_PB_SEL_MSK                              (((1U<<SPP_MISC_RG_OSD_PB_SEL_LEN)-1)<<SPP_MISC_RG_OSD_PB_SEL_POS)
#define SPP_MISC_RG_OSD_PB_SEL_UMSK                             (~(((1U<<SPP_MISC_RG_OSD_PB_SEL_LEN)-1)<<SPP_MISC_RG_OSD_PB_SEL_POS))
#define SPP_MISC_RG_OSDA_SEL                                    SPP_MISC_RG_OSDA_SEL
#define SPP_MISC_RG_OSDA_SEL_POS                                (29U)
#define SPP_MISC_RG_OSDA_SEL_LEN                                (3U)
#define SPP_MISC_RG_OSDA_SEL_MSK                                (((1U<<SPP_MISC_RG_OSDA_SEL_LEN)-1)<<SPP_MISC_RG_OSDA_SEL_POS)
#define SPP_MISC_RG_OSDA_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_OSDA_SEL_LEN)-1)<<SPP_MISC_RG_OSDA_SEL_POS))

/* 0xA4 : osdB_i_ctrl */
#define SPP_MISC_OSDB_I_CTRL_OFFSET                             (0xA4)
#define SPP_MISC_RG_OSDB_SEL                                    SPP_MISC_RG_OSDB_SEL
#define SPP_MISC_RG_OSDB_SEL_POS                                (29U)
#define SPP_MISC_RG_OSDB_SEL_LEN                                (3U)
#define SPP_MISC_RG_OSDB_SEL_MSK                                (((1U<<SPP_MISC_RG_OSDB_SEL_LEN)-1)<<SPP_MISC_RG_OSDB_SEL_POS)
#define SPP_MISC_RG_OSDB_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_OSDB_SEL_LEN)-1)<<SPP_MISC_RG_OSDB_SEL_POS))

