bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0xA8 : osdC_i_ctrl */
#define SPP_MISC_OSDC_I_CTRL_OFFSET                             (0xA8)
#define SPP_MISC_RG_OSDC_SEL                                    SPP_MISC_RG_OSDC_SEL
#define SPP_MISC_RG_OSDC_SEL_POS                                (29U)
#define SPP_MISC_RG_OSDC_SEL_LEN                                (3U)
#define SPP_MISC_RG_OSDC_SEL_MSK                                (((1U<<SPP_MISC_RG_OSDC_SEL_LEN)-1)<<SPP_MISC_RG_OSDC_SEL_POS)
#define SPP_MISC_RG_OSDC_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_OSDC_SEL_LEN)-1)<<SPP_MISC_RG_OSDC_SEL_POS))

/* 0xAC : osdD_i_ctrl */
#define SPP_MISC_OSDD_I_CTRL_OFFSET                             (0xAC)
#define SPP_MISC_RG_OSDD_SEL                                    SPP_MISC_RG_OSDD_SEL
#define SPP_MISC_RG_OSDD_SEL_POS                                (29U)
#define SPP_MISC_RG_OSDD_SEL_LEN                                (3U)
#define SPP_MISC_RG_OSDD_SEL_MSK                                (((1U<<SPP_MISC_RG_OSDD_SEL_LEN)-1)<<SPP_MISC_RG_OSDD_SEL_POS)
#define SPP_MISC_RG_OSDD_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_OSDD_SEL_LEN)-1)<<SPP_MISC_RG_OSDD_SEL_POS))

/* 0xC0 : spp_subsys_dbg_sel */
#define SPP_MISC_SPP_SUBSYS_DBG_SEL_OFFSET                      (0xC0)
#define SPP_MISC_REG_SPP_SUB_DBG_EN                             SPP_MISC_REG_SPP_SUB_DBG_EN
#define SPP_MISC_REG_SPP_SUB_DBG_EN_POS                         (0U)
#define SPP_MISC_REG_SPP_SUB_DBG_EN_LEN                         (1U)
#define SPP_MISC_REG_SPP_SUB_DBG_EN_MSK                         (((1U<<SPP_MISC_REG_SPP_SUB_DBG_EN_LEN)-1)<<SPP_MISC_REG_SPP_SUB_DBG_EN_POS)
#define SPP_MISC_REG_SPP_SUB_DBG_EN_UMSK                        (~(((1U<<SPP_MISC_REG_SPP_SUB_DBG_EN_LEN)-1)<<SPP_MISC_REG_SPP_SUB_DBG_EN_POS))
#define SPP_MISC_REG_SPP_SUB_DBG_SEL                            SPP_MISC_REG_SPP_SUB_DBG_SEL
#define SPP_MISC_REG_SPP_SUB_DBG_SEL_POS                        (4U)
#define SPP_MISC_REG_SPP_SUB_DBG_SEL_LEN                        (4U)
#define SPP_MISC_REG_SPP_SUB_DBG_SEL_MSK                        (((1U<<SPP_MISC_REG_SPP_SUB_DBG_SEL_LEN)-1)<<SPP_MISC_REG_SPP_SUB_DBG_SEL_POS)
#define SPP_MISC_REG_SPP_SUB_DBG_SEL_UMSK                       (~(((1U<<SPP_MISC_REG_SPP_SUB_DBG_SEL_LEN)-1)<<SPP_MISC_REG_SPP_SUB_DBG_SEL_POS))

/* 0xFC : SPP_MISC_Dummy */
#define SPP_MISC_DUMMY_OFFSET                                   (0xFC)
#define SPP_MISC_DUMMY_REG                                      SPP_MISC_DUMMY_REG
#define SPP_MISC_DUMMY_REG_POS                                  (0U)
#define SPP_MISC_DUMMY_REG_LEN                                  (32U)
#define SPP_MISC_DUMMY_REG_MSK                                  (((1U<<SPP_MISC_DUMMY_REG_LEN)-1)<<SPP_MISC_DUMMY_REG_POS)
#define SPP_MISC_DUMMY_REG_UMSK                                 (~(((1U<<SPP_MISC_DUMMY_REG_LEN)-1)<<SPP_MISC_DUMMY_REG_POS))

/* 0x100 : adjA_ctrl_0 */
#define SPP_MISC_ADJA_CTRL_0_OFFSET                             (0x100)
#define SPP_MISC_REG_ADJA_ADJ_EB                                SPP_MISC_REG_ADJA_ADJ_EB
#define SPP_MISC_REG_ADJA_ADJ_EB_POS                            (0U)
#define SPP_MISC_REG_ADJA_ADJ_EB_LEN                            (1U)
#define SPP_MISC_REG_ADJA_ADJ_EB_MSK                            (((1U<<SPP_MISC_REG_ADJA_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJA_ADJ_EB_POS)
#define SPP_MISC_REG_ADJA_ADJ_EB_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJA_ADJ_EB_POS))
#define SPP_MISC_REG_ADJA_Y_LUMA                                SPP_MISC_REG_ADJA_Y_LUMA
#define SPP_MISC_REG_ADJA_Y_LUMA_POS                            (1U)
#define SPP_MISC_REG_ADJA_Y_LUMA_LEN                            (9U)
#define SPP_MISC_REG_ADJA_Y_LUMA_MSK                            (((1U<<SPP_MISC_REG_ADJA_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJA_Y_LUMA_POS)
#define SPP_MISC_REG_ADJA_Y_LUMA_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJA_Y_LUMA_POS))
#define SPP_MISC_REG_ADJA_Y_MUL0                                SPP_MISC_REG_ADJA_Y_MUL0
#define SPP_MISC_REG_ADJA_Y_MUL0_POS                            (10U)
#define SPP_MISC_REG_ADJA_Y_MUL0_LEN                            (11U)
#define SPP_MISC_REG_ADJA_Y_MUL0_MSK                            (((1U<<SPP_MISC_REG_ADJA_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MUL0_POS)
#define SPP_MISC_REG_ADJA_Y_MUL0_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MUL0_POS))
#define SPP_MISC_REG_ADJA_Y_MUL1                                SPP_MISC_REG_ADJA_Y_MUL1
#define SPP_MISC_REG_ADJA_Y_MUL1_POS                            (21U)
#define SPP_MISC_REG_ADJA_Y_MUL1_LEN                            (11U)
#define SPP_MISC_REG_ADJA_Y_MUL1_MSK                            (((1U<<SPP_MISC_REG_ADJA_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MUL1_POS)
#define SPP_MISC_REG_ADJA_Y_MUL1_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MUL1_POS))

/* 0x104 : adjA_ctrl_1 */
#define SPP_MISC_ADJA_CTRL_1_OFFSET                             (0x104)
#define SPP_MISC_REG_ADJA_Y_MIN                                 SPP_MISC_REG_ADJA_Y_MIN
#define SPP_MISC_REG_ADJA_Y_MIN_POS                             (0U)
#define SPP_MISC_REG_ADJA_Y_MIN_LEN                             (8U)
#define SPP_MISC_REG_ADJA_Y_MIN_MSK                             (((1U<<SPP_MISC_REG_ADJA_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MIN_POS)
#define SPP_MISC_REG_ADJA_Y_MIN_UMSK                            (~(((1U<<SPP_MISC_REG_ADJA_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MIN_POS))
#define SPP_MISC_REG_ADJA_Y_MAX                                 SPP_MISC_REG_ADJA_Y_MAX
#define SPP_MISC_REG_ADJA_Y_MAX_POS                             (8U)
#define SPP_MISC_REG_ADJA_Y_MAX_LEN                             (8U)
#define SPP_MISC_REG_ADJA_Y_MAX_MSK                             (((1U<<SPP_MISC_REG_ADJA_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MAX_POS)
#define SPP_MISC_REG_ADJA_Y_MAX_UMSK                            (~(((1U<<SPP_MISC_REG_ADJA_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJA_Y_MAX_POS))
#define SPP_MISC_REG_ADJA_UV_MIN                                SPP_MISC_REG_ADJA_UV_MIN
#define SPP_MISC_REG_ADJA_UV_MIN_POS                            (16U)
#define SPP_MISC_REG_ADJA_UV_MIN_LEN                            (8U)
#define SPP_MISC_REG_ADJA_UV_MIN_MSK                            (((1U<<SPP_MISC_REG_ADJA_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MIN_POS)
#define SPP_MISC_REG_ADJA_UV_MIN_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MIN_POS))
#define SPP_MISC_REG_ADJA_UV_MAX                                SPP_MISC_REG_ADJA_UV_MAX
#define SPP_MISC_REG_ADJA_UV_MAX_POS                            (24U)
#define SPP_MISC_REG_ADJA_UV_MAX_LEN                            (8U)
#define SPP_MISC_REG_ADJA_UV_MAX_MSK                            (((1U<<SPP_MISC_REG_ADJA_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MAX_POS)
#define SPP_MISC_REG_ADJA_UV_MAX_UMSK                           (~(((1U<<SPP_MISC_REG_ADJA_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MAX_POS))

/* 0x108 : adjA_ctrl_2 */
#define SPP_MISC_ADJA_CTRL_2_OFFSET                             (0x108)
#define SPP_MISC_RG_ADJA_SEL                                    SPP_MISC_RG_ADJA_SEL
#define SPP_MISC_RG_ADJA_SEL_POS                                (0U)
#define SPP_MISC_RG_ADJA_SEL_LEN                                (4U)
#define SPP_MISC_RG_ADJA_SEL_MSK                                (((1U<<SPP_MISC_RG_ADJA_SEL_LEN)-1)<<SPP_MISC_RG_ADJA_SEL_POS)
#define SPP_MISC_RG_ADJA_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_ADJA_SEL_LEN)-1)<<SPP_MISC_RG_ADJA_SEL_POS))
#define SPP_MISC_REG_ADJA_UV_MUL0                               SPP_MISC_REG_ADJA_UV_MUL0
#define SPP_MISC_REG_ADJA_UV_MUL0_POS                           (10U)
#define SPP_MISC_REG_ADJA_UV_MUL0_LEN                           (11U)
#define SPP_MISC_REG_ADJA_UV_MUL0_MSK                           (((1U<<SPP_MISC_REG_ADJA_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MUL0_POS)
#define SPP_MISC_REG_ADJA_UV_MUL0_UMSK                          (~(((1U<<SPP_MISC_REG_ADJA_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MUL0_POS))
#define SPP_MISC_REG_ADJA_UV_MUL1                               SPP_MISC_REG_ADJA_UV_MUL1
#define SPP_MISC_REG_ADJA_UV_MUL1_POS                           (21U)
#define SPP_MISC_REG_ADJA_UV_MUL1_LEN                           (11U)
#define SPP_MISC_REG_ADJA_UV_MUL1_MSK                           (((1U<<SPP_MISC_REG_ADJA_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MUL1_POS)
#define SPP_MISC_REG_ADJA_UV_MUL1_UMSK                          (~(((1U<<SPP_MISC_REG_ADJA_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJA_UV_MUL1_POS))

