bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x110 : adjB_ctrl_0 */
#define SPP_MISC_ADJB_CTRL_0_OFFSET                             (0x110)
#define SPP_MISC_REG_ADJB_ADJ_EB                                SPP_MISC_REG_ADJB_ADJ_EB
#define SPP_MISC_REG_ADJB_ADJ_EB_POS                            (0U)
#define SPP_MISC_REG_ADJB_ADJ_EB_LEN                            (1U)
#define SPP_MISC_REG_ADJB_ADJ_EB_MSK                            (((1U<<SPP_MISC_REG_ADJB_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJB_ADJ_EB_POS)
#define SPP_MISC_REG_ADJB_ADJ_EB_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJB_ADJ_EB_POS))
#define SPP_MISC_REG_ADJB_Y_LUMA                                SPP_MISC_REG_ADJB_Y_LUMA
#define SPP_MISC_REG_ADJB_Y_LUMA_POS                            (1U)
#define SPP_MISC_REG_ADJB_Y_LUMA_LEN                            (9U)
#define SPP_MISC_REG_ADJB_Y_LUMA_MSK                            (((1U<<SPP_MISC_REG_ADJB_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJB_Y_LUMA_POS)
#define SPP_MISC_REG_ADJB_Y_LUMA_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJB_Y_LUMA_POS))
#define SPP_MISC_REG_ADJB_Y_MUL0                                SPP_MISC_REG_ADJB_Y_MUL0
#define SPP_MISC_REG_ADJB_Y_MUL0_POS                            (10U)
#define SPP_MISC_REG_ADJB_Y_MUL0_LEN                            (11U)
#define SPP_MISC_REG_ADJB_Y_MUL0_MSK                            (((1U<<SPP_MISC_REG_ADJB_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MUL0_POS)
#define SPP_MISC_REG_ADJB_Y_MUL0_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MUL0_POS))
#define SPP_MISC_REG_ADJB_Y_MUL1                                SPP_MISC_REG_ADJB_Y_MUL1
#define SPP_MISC_REG_ADJB_Y_MUL1_POS                            (21U)
#define SPP_MISC_REG_ADJB_Y_MUL1_LEN                            (11U)
#define SPP_MISC_REG_ADJB_Y_MUL1_MSK                            (((1U<<SPP_MISC_REG_ADJB_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MUL1_POS)
#define SPP_MISC_REG_ADJB_Y_MUL1_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MUL1_POS))

/* 0x114 : adjB_ctrl_1 */
#define SPP_MISC_ADJB_CTRL_1_OFFSET                             (0x114)
#define SPP_MISC_REG_ADJB_Y_MIN                                 SPP_MISC_REG_ADJB_Y_MIN
#define SPP_MISC_REG_ADJB_Y_MIN_POS                             (0U)
#define SPP_MISC_REG_ADJB_Y_MIN_LEN                             (8U)
#define SPP_MISC_REG_ADJB_Y_MIN_MSK                             (((1U<<SPP_MISC_REG_ADJB_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MIN_POS)
#define SPP_MISC_REG_ADJB_Y_MIN_UMSK                            (~(((1U<<SPP_MISC_REG_ADJB_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MIN_POS))
#define SPP_MISC_REG_ADJB_Y_MAX                                 SPP_MISC_REG_ADJB_Y_MAX
#define SPP_MISC_REG_ADJB_Y_MAX_POS                             (8U)
#define SPP_MISC_REG_ADJB_Y_MAX_LEN                             (8U)
#define SPP_MISC_REG_ADJB_Y_MAX_MSK                             (((1U<<SPP_MISC_REG_ADJB_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MAX_POS)
#define SPP_MISC_REG_ADJB_Y_MAX_UMSK                            (~(((1U<<SPP_MISC_REG_ADJB_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJB_Y_MAX_POS))
#define SPP_MISC_REG_ADJB_UV_MIN                                SPP_MISC_REG_ADJB_UV_MIN
#define SPP_MISC_REG_ADJB_UV_MIN_POS                            (16U)
#define SPP_MISC_REG_ADJB_UV_MIN_LEN                            (8U)
#define SPP_MISC_REG_ADJB_UV_MIN_MSK                            (((1U<<SPP_MISC_REG_ADJB_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MIN_POS)
#define SPP_MISC_REG_ADJB_UV_MIN_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MIN_POS))
#define SPP_MISC_REG_ADJB_UV_MAX                                SPP_MISC_REG_ADJB_UV_MAX
#define SPP_MISC_REG_ADJB_UV_MAX_POS                            (24U)
#define SPP_MISC_REG_ADJB_UV_MAX_LEN                            (8U)
#define SPP_MISC_REG_ADJB_UV_MAX_MSK                            (((1U<<SPP_MISC_REG_ADJB_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MAX_POS)
#define SPP_MISC_REG_ADJB_UV_MAX_UMSK                           (~(((1U<<SPP_MISC_REG_ADJB_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MAX_POS))

/* 0x118 : adjB_ctrl_2 */
#define SPP_MISC_ADJB_CTRL_2_OFFSET                             (0x118)
#define SPP_MISC_RG_ADJB_SEL                                    SPP_MISC_RG_ADJB_SEL
#define SPP_MISC_RG_ADJB_SEL_POS                                (0U)
#define SPP_MISC_RG_ADJB_SEL_LEN                                (4U)
#define SPP_MISC_RG_ADJB_SEL_MSK                                (((1U<<SPP_MISC_RG_ADJB_SEL_LEN)-1)<<SPP_MISC_RG_ADJB_SEL_POS)
#define SPP_MISC_RG_ADJB_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_ADJB_SEL_LEN)-1)<<SPP_MISC_RG_ADJB_SEL_POS))
#define SPP_MISC_REG_ADJB_UV_MUL0                               SPP_MISC_REG_ADJB_UV_MUL0
#define SPP_MISC_REG_ADJB_UV_MUL0_POS                           (10U)
#define SPP_MISC_REG_ADJB_UV_MUL0_LEN                           (11U)
#define SPP_MISC_REG_ADJB_UV_MUL0_MSK                           (((1U<<SPP_MISC_REG_ADJB_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MUL0_POS)
#define SPP_MISC_REG_ADJB_UV_MUL0_UMSK                          (~(((1U<<SPP_MISC_REG_ADJB_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MUL0_POS))
#define SPP_MISC_REG_ADJB_UV_MUL1                               SPP_MISC_REG_ADJB_UV_MUL1
#define SPP_MISC_REG_ADJB_UV_MUL1_POS                           (21U)
#define SPP_MISC_REG_ADJB_UV_MUL1_LEN                           (11U)
#define SPP_MISC_REG_ADJB_UV_MUL1_MSK                           (((1U<<SPP_MISC_REG_ADJB_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MUL1_POS)
#define SPP_MISC_REG_ADJB_UV_MUL1_UMSK                          (~(((1U<<SPP_MISC_REG_ADJB_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJB_UV_MUL1_POS))

/* 0x120 : adjC_ctrl_0 */
#define SPP_MISC_ADJC_CTRL_0_OFFSET                             (0x120)
#define SPP_MISC_REG_ADJC_ADJ_EB                                SPP_MISC_REG_ADJC_ADJ_EB
#define SPP_MISC_REG_ADJC_ADJ_EB_POS                            (0U)
#define SPP_MISC_REG_ADJC_ADJ_EB_LEN                            (1U)
#define SPP_MISC_REG_ADJC_ADJ_EB_MSK                            (((1U<<SPP_MISC_REG_ADJC_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJC_ADJ_EB_POS)
#define SPP_MISC_REG_ADJC_ADJ_EB_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJC_ADJ_EB_POS))
#define SPP_MISC_REG_ADJC_Y_LUMA                                SPP_MISC_REG_ADJC_Y_LUMA
#define SPP_MISC_REG_ADJC_Y_LUMA_POS                            (1U)
#define SPP_MISC_REG_ADJC_Y_LUMA_LEN                            (9U)
#define SPP_MISC_REG_ADJC_Y_LUMA_MSK                            (((1U<<SPP_MISC_REG_ADJC_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJC_Y_LUMA_POS)
#define SPP_MISC_REG_ADJC_Y_LUMA_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJC_Y_LUMA_POS))
#define SPP_MISC_REG_ADJC_Y_MUL0                                SPP_MISC_REG_ADJC_Y_MUL0
#define SPP_MISC_REG_ADJC_Y_MUL0_POS                            (10U)
#define SPP_MISC_REG_ADJC_Y_MUL0_LEN                            (11U)
#define SPP_MISC_REG_ADJC_Y_MUL0_MSK                            (((1U<<SPP_MISC_REG_ADJC_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MUL0_POS)
#define SPP_MISC_REG_ADJC_Y_MUL0_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MUL0_POS))
#define SPP_MISC_REG_ADJC_Y_MUL1                                SPP_MISC_REG_ADJC_Y_MUL1
#define SPP_MISC_REG_ADJC_Y_MUL1_POS                            (21U)
#define SPP_MISC_REG_ADJC_Y_MUL1_LEN                            (11U)
#define SPP_MISC_REG_ADJC_Y_MUL1_MSK                            (((1U<<SPP_MISC_REG_ADJC_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MUL1_POS)
#define SPP_MISC_REG_ADJC_Y_MUL1_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MUL1_POS))

/* 0x124 : adjC_ctrl_1 */
#define SPP_MISC_ADJC_CTRL_1_OFFSET                             (0x124)
#define SPP_MISC_REG_ADJC_Y_MIN                                 SPP_MISC_REG_ADJC_Y_MIN
#define SPP_MISC_REG_ADJC_Y_MIN_POS                             (0U)
#define SPP_MISC_REG_ADJC_Y_MIN_LEN                             (8U)
#define SPP_MISC_REG_ADJC_Y_MIN_MSK                             (((1U<<SPP_MISC_REG_ADJC_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MIN_POS)
#define SPP_MISC_REG_ADJC_Y_MIN_UMSK                            (~(((1U<<SPP_MISC_REG_ADJC_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MIN_POS))
#define SPP_MISC_REG_ADJC_Y_MAX                                 SPP_MISC_REG_ADJC_Y_MAX
#define SPP_MISC_REG_ADJC_Y_MAX_POS                             (8U)
#define SPP_MISC_REG_ADJC_Y_MAX_LEN                             (8U)
#define SPP_MISC_REG_ADJC_Y_MAX_MSK                             (((1U<<SPP_MISC_REG_ADJC_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MAX_POS)
#define SPP_MISC_REG_ADJC_Y_MAX_UMSK                            (~(((1U<<SPP_MISC_REG_ADJC_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJC_Y_MAX_POS))
#define SPP_MISC_REG_ADJC_UV_MIN                                SPP_MISC_REG_ADJC_UV_MIN
#define SPP_MISC_REG_ADJC_UV_MIN_POS                            (16U)
#define SPP_MISC_REG_ADJC_UV_MIN_LEN                            (8U)
#define SPP_MISC_REG_ADJC_UV_MIN_MSK                            (((1U<<SPP_MISC_REG_ADJC_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MIN_POS)
#define SPP_MISC_REG_ADJC_UV_MIN_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MIN_POS))
#define SPP_MISC_REG_ADJC_UV_MAX                                SPP_MISC_REG_ADJC_UV_MAX
#define SPP_MISC_REG_ADJC_UV_MAX_POS                            (24U)
#define SPP_MISC_REG_ADJC_UV_MAX_LEN                            (8U)
#define SPP_MISC_REG_ADJC_UV_MAX_MSK                            (((1U<<SPP_MISC_REG_ADJC_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MAX_POS)
#define SPP_MISC_REG_ADJC_UV_MAX_UMSK                           (~(((1U<<SPP_MISC_REG_ADJC_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MAX_POS))

/* 0x128 : adjC_ctrl_2 */
#define SPP_MISC_ADJC_CTRL_2_OFFSET                             (0x128)
#define SPP_MISC_RG_ADJC_SEL                                    SPP_MISC_RG_ADJC_SEL
#define SPP_MISC_RG_ADJC_SEL_POS                                (0U)
#define SPP_MISC_RG_ADJC_SEL_LEN                                (4U)
#define SPP_MISC_RG_ADJC_SEL_MSK                                (((1U<<SPP_MISC_RG_ADJC_SEL_LEN)-1)<<SPP_MISC_RG_ADJC_SEL_POS)
#define SPP_MISC_RG_ADJC_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_ADJC_SEL_LEN)-1)<<SPP_MISC_RG_ADJC_SEL_POS))
#define SPP_MISC_REG_ADJC_UV_MUL0                               SPP_MISC_REG_ADJC_UV_MUL0
#define SPP_MISC_REG_ADJC_UV_MUL0_POS                           (10U)
#define SPP_MISC_REG_ADJC_UV_MUL0_LEN                           (11U)
#define SPP_MISC_REG_ADJC_UV_MUL0_MSK                           (((1U<<SPP_MISC_REG_ADJC_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MUL0_POS)
#define SPP_MISC_REG_ADJC_UV_MUL0_UMSK                          (~(((1U<<SPP_MISC_REG_ADJC_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MUL0_POS))
#define SPP_MISC_REG_ADJC_UV_MUL1                               SPP_MISC_REG_ADJC_UV_MUL1
#define SPP_MISC_REG_ADJC_UV_MUL1_POS                           (21U)
#define SPP_MISC_REG_ADJC_UV_MUL1_LEN                           (11U)
#define SPP_MISC_REG_ADJC_UV_MUL1_MSK                           (((1U<<SPP_MISC_REG_ADJC_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MUL1_POS)
#define SPP_MISC_REG_ADJC_UV_MUL1_UMSK                          (~(((1U<<SPP_MISC_REG_ADJC_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJC_UV_MUL1_POS))

/* 0x130 : adjD_ctrl_0 */
#define SPP_MISC_ADJD_CTRL_0_OFFSET                             (0x130)
#define SPP_MISC_REG_ADJD_ADJ_EB                                SPP_MISC_REG_ADJD_ADJ_EB
#define SPP_MISC_REG_ADJD_ADJ_EB_POS                            (0U)
#define SPP_MISC_REG_ADJD_ADJ_EB_LEN                            (1U)
#define SPP_MISC_REG_ADJD_ADJ_EB_MSK                            (((1U<<SPP_MISC_REG_ADJD_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJD_ADJ_EB_POS)
#define SPP_MISC_REG_ADJD_ADJ_EB_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_ADJ_EB_LEN)-1)<<SPP_MISC_REG_ADJD_ADJ_EB_POS))
#define SPP_MISC_REG_ADJD_Y_LUMA                                SPP_MISC_REG_ADJD_Y_LUMA
#define SPP_MISC_REG_ADJD_Y_LUMA_POS                            (1U)
#define SPP_MISC_REG_ADJD_Y_LUMA_LEN                            (9U)
#define SPP_MISC_REG_ADJD_Y_LUMA_MSK                            (((1U<<SPP_MISC_REG_ADJD_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJD_Y_LUMA_POS)
#define SPP_MISC_REG_ADJD_Y_LUMA_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_Y_LUMA_LEN)-1)<<SPP_MISC_REG_ADJD_Y_LUMA_POS))
#define SPP_MISC_REG_ADJD_Y_MUL0                                SPP_MISC_REG_ADJD_Y_MUL0
#define SPP_MISC_REG_ADJD_Y_MUL0_POS                            (10U)
#define SPP_MISC_REG_ADJD_Y_MUL0_LEN                            (11U)
#define SPP_MISC_REG_ADJD_Y_MUL0_MSK                            (((1U<<SPP_MISC_REG_ADJD_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MUL0_POS)
#define SPP_MISC_REG_ADJD_Y_MUL0_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_Y_MUL0_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MUL0_POS))
#define SPP_MISC_REG_ADJD_Y_MUL1                                SPP_MISC_REG_ADJD_Y_MUL1
#define SPP_MISC_REG_ADJD_Y_MUL1_POS                            (21U)
#define SPP_MISC_REG_ADJD_Y_MUL1_LEN                            (11U)
#define SPP_MISC_REG_ADJD_Y_MUL1_MSK                            (((1U<<SPP_MISC_REG_ADJD_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MUL1_POS)
#define SPP_MISC_REG_ADJD_Y_MUL1_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_Y_MUL1_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MUL1_POS))

/* 0x134 : adjD_ctrl_1 */
#define SPP_MISC_ADJD_CTRL_1_OFFSET                             (0x134)
#define SPP_MISC_REG_ADJD_Y_MIN                                 SPP_MISC_REG_ADJD_Y_MIN
#define SPP_MISC_REG_ADJD_Y_MIN_POS                             (0U)
#define SPP_MISC_REG_ADJD_Y_MIN_LEN                             (8U)
#define SPP_MISC_REG_ADJD_Y_MIN_MSK                             (((1U<<SPP_MISC_REG_ADJD_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MIN_POS)
#define SPP_MISC_REG_ADJD_Y_MIN_UMSK                            (~(((1U<<SPP_MISC_REG_ADJD_Y_MIN_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MIN_POS))
#define SPP_MISC_REG_ADJD_Y_MAX                                 SPP_MISC_REG_ADJD_Y_MAX
#define SPP_MISC_REG_ADJD_Y_MAX_POS                             (8U)
#define SPP_MISC_REG_ADJD_Y_MAX_LEN                             (8U)
#define SPP_MISC_REG_ADJD_Y_MAX_MSK                             (((1U<<SPP_MISC_REG_ADJD_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MAX_POS)
#define SPP_MISC_REG_ADJD_Y_MAX_UMSK                            (~(((1U<<SPP_MISC_REG_ADJD_Y_MAX_LEN)-1)<<SPP_MISC_REG_ADJD_Y_MAX_POS))
#define SPP_MISC_REG_ADJD_UV_MIN                                SPP_MISC_REG_ADJD_UV_MIN
#define SPP_MISC_REG_ADJD_UV_MIN_POS                            (16U)
#define SPP_MISC_REG_ADJD_UV_MIN_LEN                            (8U)
#define SPP_MISC_REG_ADJD_UV_MIN_MSK                            (((1U<<SPP_MISC_REG_ADJD_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MIN_POS)
#define SPP_MISC_REG_ADJD_UV_MIN_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_UV_MIN_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MIN_POS))
#define SPP_MISC_REG_ADJD_UV_MAX                                SPP_MISC_REG_ADJD_UV_MAX
#define SPP_MISC_REG_ADJD_UV_MAX_POS                            (24U)
#define SPP_MISC_REG_ADJD_UV_MAX_LEN                            (8U)
#define SPP_MISC_REG_ADJD_UV_MAX_MSK                            (((1U<<SPP_MISC_REG_ADJD_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MAX_POS)
#define SPP_MISC_REG_ADJD_UV_MAX_UMSK                           (~(((1U<<SPP_MISC_REG_ADJD_UV_MAX_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MAX_POS))

/* 0x138 : adjD_ctrl_2 */
#define SPP_MISC_ADJD_CTRL_2_OFFSET                             (0x138)
#define SPP_MISC_RG_ADJD_SEL                                    SPP_MISC_RG_ADJD_SEL
#define SPP_MISC_RG_ADJD_SEL_POS                                (0U)
#define SPP_MISC_RG_ADJD_SEL_LEN                                (4U)
#define SPP_MISC_RG_ADJD_SEL_MSK                                (((1U<<SPP_MISC_RG_ADJD_SEL_LEN)-1)<<SPP_MISC_RG_ADJD_SEL_POS)
#define SPP_MISC_RG_ADJD_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_ADJD_SEL_LEN)-1)<<SPP_MISC_RG_ADJD_SEL_POS))
#define SPP_MISC_REG_ADJD_UV_MUL0                               SPP_MISC_REG_ADJD_UV_MUL0
#define SPP_MISC_REG_ADJD_UV_MUL0_POS                           (10U)
#define SPP_MISC_REG_ADJD_UV_MUL0_LEN                           (11U)
#define SPP_MISC_REG_ADJD_UV_MUL0_MSK                           (((1U<<SPP_MISC_REG_ADJD_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MUL0_POS)
#define SPP_MISC_REG_ADJD_UV_MUL0_UMSK                          (~(((1U<<SPP_MISC_REG_ADJD_UV_MUL0_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MUL0_POS))
#define SPP_MISC_REG_ADJD_UV_MUL1                               SPP_MISC_REG_ADJD_UV_MUL1
#define SPP_MISC_REG_ADJD_UV_MUL1_POS                           (21U)
#define SPP_MISC_REG_ADJD_UV_MUL1_LEN                           (11U)
#define SPP_MISC_REG_ADJD_UV_MUL1_MSK                           (((1U<<SPP_MISC_REG_ADJD_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MUL1_POS)
#define SPP_MISC_REG_ADJD_UV_MUL1_UMSK                          (~(((1U<<SPP_MISC_REG_ADJD_UV_MUL1_LEN)-1)<<SPP_MISC_REG_ADJD_UV_MUL1_POS))

/* 0x160 : y2rA_config_0 */
#define SPP_MISC_Y2RA_CONFIG_0_OFFSET                           (0x160)
#define SPP_MISC_RG_Y2RA_PRE_0                                  SPP_MISC_RG_Y2RA_PRE_0
#define SPP_MISC_RG_Y2RA_PRE_0_POS                              (0U)
#define SPP_MISC_RG_Y2RA_PRE_0_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_PRE_0_MSK                              (((1U<<SPP_MISC_RG_Y2RA_PRE_0_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_0_POS)
#define SPP_MISC_RG_Y2RA_PRE_0_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_PRE_0_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_0_POS))
#define SPP_MISC_RG_Y2RA_POS_0                                  SPP_MISC_RG_Y2RA_POS_0
#define SPP_MISC_RG_Y2RA_POS_0_POS                              (16U)
#define SPP_MISC_RG_Y2RA_POS_0_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_POS_0_MSK                              (((1U<<SPP_MISC_RG_Y2RA_POS_0_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_0_POS)
#define SPP_MISC_RG_Y2RA_POS_0_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_POS_0_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_0_POS))
#define SPP_MISC_RG_Y2RA_EN                                     SPP_MISC_RG_Y2RA_EN
#define SPP_MISC_RG_Y2RA_EN_POS                                 (27U)
#define SPP_MISC_RG_Y2RA_EN_LEN                                 (1U)
#define SPP_MISC_RG_Y2RA_EN_MSK                                 (((1U<<SPP_MISC_RG_Y2RA_EN_LEN)-1)<<SPP_MISC_RG_Y2RA_EN_POS)
#define SPP_MISC_RG_Y2RA_EN_UMSK                                (~(((1U<<SPP_MISC_RG_Y2RA_EN_LEN)-1)<<SPP_MISC_RG_Y2RA_EN_POS))
#define SPP_MISC_RG_Y2RA_SEL                                    SPP_MISC_RG_Y2RA_SEL
#define SPP_MISC_RG_Y2RA_SEL_POS                                (28U)
#define SPP_MISC_RG_Y2RA_SEL_LEN                                (4U)
#define SPP_MISC_RG_Y2RA_SEL_MSK                                (((1U<<SPP_MISC_RG_Y2RA_SEL_LEN)-1)<<SPP_MISC_RG_Y2RA_SEL_POS)
#define SPP_MISC_RG_Y2RA_SEL_UMSK                               (~(((1U<<SPP_MISC_RG_Y2RA_SEL_LEN)-1)<<SPP_MISC_RG_Y2RA_SEL_POS))

/* 0x164 : y2rA_config_1 */
#define SPP_MISC_Y2RA_CONFIG_1_OFFSET                           (0x164)
#define SPP_MISC_RG_Y2RA_PRE_1                                  SPP_MISC_RG_Y2RA_PRE_1
#define SPP_MISC_RG_Y2RA_PRE_1_POS                              (0U)
#define SPP_MISC_RG_Y2RA_PRE_1_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_PRE_1_MSK                              (((1U<<SPP_MISC_RG_Y2RA_PRE_1_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_1_POS)
#define SPP_MISC_RG_Y2RA_PRE_1_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_PRE_1_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_1_POS))
#define SPP_MISC_RG_Y2RA_POS_1                                  SPP_MISC_RG_Y2RA_POS_1
#define SPP_MISC_RG_Y2RA_POS_1_POS                              (16U)
#define SPP_MISC_RG_Y2RA_POS_1_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_POS_1_MSK                              (((1U<<SPP_MISC_RG_Y2RA_POS_1_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_1_POS)
#define SPP_MISC_RG_Y2RA_POS_1_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_POS_1_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_1_POS))

