bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x168 : y2rA_config_2 */
#define SPP_MISC_Y2RA_CONFIG_2_OFFSET                           (0x168)
#define SPP_MISC_RG_Y2RA_PRE_2                                  SPP_MISC_RG_Y2RA_PRE_2
#define SPP_MISC_RG_Y2RA_PRE_2_POS                              (0U)
#define SPP_MISC_RG_Y2RA_PRE_2_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_PRE_2_MSK                              (((1U<<SPP_MISC_RG_Y2RA_PRE_2_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_2_POS)
#define SPP_MISC_RG_Y2RA_PRE_2_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_PRE_2_LEN)-1)<<SPP_MISC_RG_Y2RA_PRE_2_POS))
#define SPP_MISC_RG_Y2RA_POS_2                                  SPP_MISC_RG_Y2RA_POS_2
#define SPP_MISC_RG_Y2RA_POS_2_POS                              (16U)
#define SPP_MISC_RG_Y2RA_POS_2_LEN                              (9U)
#define SPP_MISC_RG_Y2RA_POS_2_MSK                              (((1U<<SPP_MISC_RG_Y2RA_POS_2_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_2_POS)
#define SPP_MISC_RG_Y2RA_POS_2_UMSK                             (~(((1U<<SPP_MISC_RG_Y2RA_POS_2_LEN)-1)<<SPP_MISC_RG_Y2RA_POS_2_POS))

/* 0x16C : y2rA_config_3 */
#define SPP_MISC_Y2RA_CONFIG_3_OFFSET                           (0x16C)
#define SPP_MISC_RG_Y2RA_MTX_00                                 SPP_MISC_RG_Y2RA_MTX_00
#define SPP_MISC_RG_Y2RA_MTX_00_POS                             (0U)
#define SPP_MISC_RG_Y2RA_MTX_00_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_00_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_00_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_00_POS)
#define SPP_MISC_RG_Y2RA_MTX_00_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_00_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_00_POS))
#define SPP_MISC_RG_Y2RA_MTX_01                                 SPP_MISC_RG_Y2RA_MTX_01
#define SPP_MISC_RG_Y2RA_MTX_01_POS                             (16U)
#define SPP_MISC_RG_Y2RA_MTX_01_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_01_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_01_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_01_POS)
#define SPP_MISC_RG_Y2RA_MTX_01_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_01_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_01_POS))

/* 0x170 : y2rA_config_4 */
#define SPP_MISC_Y2RA_CONFIG_4_OFFSET                           (0x170)
#define SPP_MISC_RG_Y2RA_MTX_02                                 SPP_MISC_RG_Y2RA_MTX_02
#define SPP_MISC_RG_Y2RA_MTX_02_POS                             (0U)
#define SPP_MISC_RG_Y2RA_MTX_02_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_02_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_02_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_02_POS)
#define SPP_MISC_RG_Y2RA_MTX_02_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_02_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_02_POS))
#define SPP_MISC_RG_Y2RA_MTX_10                                 SPP_MISC_RG_Y2RA_MTX_10
#define SPP_MISC_RG_Y2RA_MTX_10_POS                             (16U)
#define SPP_MISC_RG_Y2RA_MTX_10_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_10_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_10_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_10_POS)
#define SPP_MISC_RG_Y2RA_MTX_10_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_10_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_10_POS))

/* 0x174 : y2rA_config_5 */
#define SPP_MISC_Y2RA_CONFIG_5_OFFSET                           (0x174)
#define SPP_MISC_RG_Y2RA_MTX_11                                 SPP_MISC_RG_Y2RA_MTX_11
#define SPP_MISC_RG_Y2RA_MTX_11_POS                             (0U)
#define SPP_MISC_RG_Y2RA_MTX_11_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_11_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_11_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_11_POS)
#define SPP_MISC_RG_Y2RA_MTX_11_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_11_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_11_POS))
#define SPP_MISC_RG_Y2RA_MTX_12                                 SPP_MISC_RG_Y2RA_MTX_12
#define SPP_MISC_RG_Y2RA_MTX_12_POS                             (16U)
#define SPP_MISC_RG_Y2RA_MTX_12_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_12_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_12_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_12_POS)
#define SPP_MISC_RG_Y2RA_MTX_12_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_12_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_12_POS))

/* 0x178 : y2rA_config_6 */
#define SPP_MISC_Y2RA_CONFIG_6_OFFSET                           (0x178)
#define SPP_MISC_RG_Y2RA_MTX_20                                 SPP_MISC_RG_Y2RA_MTX_20
#define SPP_MISC_RG_Y2RA_MTX_20_POS                             (0U)
#define SPP_MISC_RG_Y2RA_MTX_20_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_20_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_20_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_20_POS)
#define SPP_MISC_RG_Y2RA_MTX_20_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_20_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_20_POS))
#define SPP_MISC_RG_Y2RA_MTX_21                                 SPP_MISC_RG_Y2RA_MTX_21
#define SPP_MISC_RG_Y2RA_MTX_21_POS                             (16U)
#define SPP_MISC_RG_Y2RA_MTX_21_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_21_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_21_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_21_POS)
#define SPP_MISC_RG_Y2RA_MTX_21_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_21_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_21_POS))

/* 0x17C : y2rA_config_7 */
#define SPP_MISC_Y2RA_CONFIG_7_OFFSET                           (0x17C)
#define SPP_MISC_RG_Y2RA_MTX_22                                 SPP_MISC_RG_Y2RA_MTX_22
#define SPP_MISC_RG_Y2RA_MTX_22_POS                             (0U)
#define SPP_MISC_RG_Y2RA_MTX_22_LEN                             (12U)
#define SPP_MISC_RG_Y2RA_MTX_22_MSK                             (((1U<<SPP_MISC_RG_Y2RA_MTX_22_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_22_POS)
#define SPP_MISC_RG_Y2RA_MTX_22_UMSK                            (~(((1U<<SPP_MISC_RG_Y2RA_MTX_22_LEN)-1)<<SPP_MISC_RG_Y2RA_MTX_22_POS))

/* 0x180 : disp_rgb2yuv_config_0 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_0_OFFSET                   (0x180)
#define SPP_MISC_RG_DISP_R2Y_PRE_0                              SPP_MISC_RG_DISP_R2Y_PRE_0
#define SPP_MISC_RG_DISP_R2Y_PRE_0_POS                          (0U)
#define SPP_MISC_RG_DISP_R2Y_PRE_0_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_PRE_0_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_PRE_0_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_0_POS)
#define SPP_MISC_RG_DISP_R2Y_PRE_0_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_PRE_0_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_0_POS))
#define SPP_MISC_RG_DISP_R2Y_PRE_1                              SPP_MISC_RG_DISP_R2Y_PRE_1
#define SPP_MISC_RG_DISP_R2Y_PRE_1_POS                          (10U)
#define SPP_MISC_RG_DISP_R2Y_PRE_1_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_PRE_1_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_PRE_1_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_1_POS)
#define SPP_MISC_RG_DISP_R2Y_PRE_1_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_PRE_1_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_1_POS))
#define SPP_MISC_RG_DISP_R2Y_PRE_2                              SPP_MISC_RG_DISP_R2Y_PRE_2
#define SPP_MISC_RG_DISP_R2Y_PRE_2_POS                          (20U)
#define SPP_MISC_RG_DISP_R2Y_PRE_2_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_PRE_2_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_PRE_2_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_2_POS)
#define SPP_MISC_RG_DISP_R2Y_PRE_2_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_PRE_2_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_PRE_2_POS))
#define SPP_MISC_RG_DISP_R2Y_EN                                 SPP_MISC_RG_DISP_R2Y_EN
#define SPP_MISC_RG_DISP_R2Y_EN_POS                             (31U)
#define SPP_MISC_RG_DISP_R2Y_EN_LEN                             (1U)
#define SPP_MISC_RG_DISP_R2Y_EN_MSK                             (((1U<<SPP_MISC_RG_DISP_R2Y_EN_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_EN_POS)
#define SPP_MISC_RG_DISP_R2Y_EN_UMSK                            (~(((1U<<SPP_MISC_RG_DISP_R2Y_EN_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_EN_POS))

/* 0x184 : disp_rgb2yuv_config_1 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_1_OFFSET                   (0x184)
#define SPP_MISC_RG_DISP_R2Y_POS_0                              SPP_MISC_RG_DISP_R2Y_POS_0
#define SPP_MISC_RG_DISP_R2Y_POS_0_POS                          (0U)
#define SPP_MISC_RG_DISP_R2Y_POS_0_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_POS_0_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_POS_0_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_0_POS)
#define SPP_MISC_RG_DISP_R2Y_POS_0_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_POS_0_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_0_POS))
#define SPP_MISC_RG_DISP_R2Y_POS_1                              SPP_MISC_RG_DISP_R2Y_POS_1
#define SPP_MISC_RG_DISP_R2Y_POS_1_POS                          (10U)
#define SPP_MISC_RG_DISP_R2Y_POS_1_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_POS_1_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_POS_1_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_1_POS)
#define SPP_MISC_RG_DISP_R2Y_POS_1_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_POS_1_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_1_POS))
#define SPP_MISC_RG_DISP_R2Y_POS_2                              SPP_MISC_RG_DISP_R2Y_POS_2
#define SPP_MISC_RG_DISP_R2Y_POS_2_POS                          (20U)
#define SPP_MISC_RG_DISP_R2Y_POS_2_LEN                          (9U)
#define SPP_MISC_RG_DISP_R2Y_POS_2_MSK                          (((1U<<SPP_MISC_RG_DISP_R2Y_POS_2_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_2_POS)
#define SPP_MISC_RG_DISP_R2Y_POS_2_UMSK                         (~(((1U<<SPP_MISC_RG_DISP_R2Y_POS_2_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_POS_2_POS))

/* 0x188 : disp_rgb2yuv_config_2 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_2_OFFSET                   (0x188)
#define SPP_MISC_RG_DISP_R2Y_MTX_00                             SPP_MISC_RG_DISP_R2Y_MTX_00
#define SPP_MISC_RG_DISP_R2Y_MTX_00_POS                         (0U)
#define SPP_MISC_RG_DISP_R2Y_MTX_00_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_00_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_00_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_00_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_00_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_00_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_00_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_01                             SPP_MISC_RG_DISP_R2Y_MTX_01
#define SPP_MISC_RG_DISP_R2Y_MTX_01_POS                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_01_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_01_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_01_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_01_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_01_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_01_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_01_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_02_L                           SPP_MISC_RG_DISP_R2Y_MTX_02_L
#define SPP_MISC_RG_DISP_R2Y_MTX_02_L_POS                       (24U)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_L_LEN                       (8U)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_L_MSK                       (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_02_L_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_02_L_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_L_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_02_L_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_02_L_POS))

/* 0x18C : disp_rgb2yuv_config_3 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_3_OFFSET                   (0x18C)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_U                           SPP_MISC_RG_DISP_R2Y_MTX_02_U
#define SPP_MISC_RG_DISP_R2Y_MTX_02_U_POS                       (0U)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_U_LEN                       (4U)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_U_MSK                       (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_02_U_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_02_U_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_02_U_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_02_U_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_02_U_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_10                             SPP_MISC_RG_DISP_R2Y_MTX_10
#define SPP_MISC_RG_DISP_R2Y_MTX_10_POS                         (4U)
#define SPP_MISC_RG_DISP_R2Y_MTX_10_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_10_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_10_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_10_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_10_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_10_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_10_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_11                             SPP_MISC_RG_DISP_R2Y_MTX_11
#define SPP_MISC_RG_DISP_R2Y_MTX_11_POS                         (16U)
#define SPP_MISC_RG_DISP_R2Y_MTX_11_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_11_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_11_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_11_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_11_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_11_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_11_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_12_L                           SPP_MISC_RG_DISP_R2Y_MTX_12_L
#define SPP_MISC_RG_DISP_R2Y_MTX_12_L_POS                       (28U)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_L_LEN                       (4U)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_L_MSK                       (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_12_L_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_12_L_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_L_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_12_L_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_12_L_POS))

/* 0x190 : disp_rgb2yuv_config_4 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_4_OFFSET                   (0x190)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_U                           SPP_MISC_RG_DISP_R2Y_MTX_12_U
#define SPP_MISC_RG_DISP_R2Y_MTX_12_U_POS                       (0U)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_U_LEN                       (8U)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_U_MSK                       (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_12_U_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_12_U_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_12_U_UMSK                      (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_12_U_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_12_U_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_20                             SPP_MISC_RG_DISP_R2Y_MTX_20
#define SPP_MISC_RG_DISP_R2Y_MTX_20_POS                         (8U)
#define SPP_MISC_RG_DISP_R2Y_MTX_20_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_20_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_20_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_20_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_20_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_20_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_20_POS))
#define SPP_MISC_RG_DISP_R2Y_MTX_21                             SPP_MISC_RG_DISP_R2Y_MTX_21
#define SPP_MISC_RG_DISP_R2Y_MTX_21_POS                         (20U)
#define SPP_MISC_RG_DISP_R2Y_MTX_21_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_21_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_21_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_21_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_21_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_21_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_21_POS))

