bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x194 : disp_rgb2yuv_config_5 */
#define SPP_MISC_DISP_RGB2YUV_CONFIG_5_OFFSET                   (0x194)
#define SPP_MISC_RG_DISP_R2Y_MTX_22                             SPP_MISC_RG_DISP_R2Y_MTX_22
#define SPP_MISC_RG_DISP_R2Y_MTX_22_POS                         (0U)
#define SPP_MISC_RG_DISP_R2Y_MTX_22_LEN                         (12U)
#define SPP_MISC_RG_DISP_R2Y_MTX_22_MSK                         (((1U<<SPP_MISC_RG_DISP_R2Y_MTX_22_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_22_POS)
#define SPP_MISC_RG_DISP_R2Y_MTX_22_UMSK                        (~(((1U<<SPP_MISC_RG_DISP_R2Y_MTX_22_LEN)-1)<<SPP_MISC_RG_DISP_R2Y_MTX_22_POS))

/* 0x1C0 : cropA_hsync */
#define SPP_MISC_CROPA_HSYNC_OFFSET                             (0x1C0)
#define SPP_MISC_REG_CROPA_HSYNC_START                          SPP_MISC_REG_CROPA_HSYNC_START
#define SPP_MISC_REG_CROPA_HSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPA_HSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPA_HSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPA_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPA_HSYNC_START_POS)
#define SPP_MISC_REG_CROPA_HSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPA_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPA_HSYNC_START_POS))
#define SPP_MISC_REG_CROPA_HSYNC_END                            SPP_MISC_REG_CROPA_HSYNC_END
#define SPP_MISC_REG_CROPA_HSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPA_HSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPA_HSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPA_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPA_HSYNC_END_POS)
#define SPP_MISC_REG_CROPA_HSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPA_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPA_HSYNC_END_POS))

/* 0x1C4 : cropA_vsync */
#define SPP_MISC_CROPA_VSYNC_OFFSET                             (0x1C4)
#define SPP_MISC_REG_CROPA_VSYNC_START                          SPP_MISC_REG_CROPA_VSYNC_START
#define SPP_MISC_REG_CROPA_VSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPA_VSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPA_VSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPA_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPA_VSYNC_START_POS)
#define SPP_MISC_REG_CROPA_VSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPA_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPA_VSYNC_START_POS))
#define SPP_MISC_REG_CROPA_VSYNC_END                            SPP_MISC_REG_CROPA_VSYNC_END
#define SPP_MISC_REG_CROPA_VSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPA_VSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPA_VSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPA_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPA_VSYNC_END_POS)
#define SPP_MISC_REG_CROPA_VSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPA_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPA_VSYNC_END_POS))

/* 0x1C8 : cropB_hsync */
#define SPP_MISC_CROPB_HSYNC_OFFSET                             (0x1C8)
#define SPP_MISC_REG_CROPB_HSYNC_START                          SPP_MISC_REG_CROPB_HSYNC_START
#define SPP_MISC_REG_CROPB_HSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPB_HSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPB_HSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPB_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPB_HSYNC_START_POS)
#define SPP_MISC_REG_CROPB_HSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPB_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPB_HSYNC_START_POS))
#define SPP_MISC_REG_CROPB_HSYNC_END                            SPP_MISC_REG_CROPB_HSYNC_END
#define SPP_MISC_REG_CROPB_HSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPB_HSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPB_HSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPB_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPB_HSYNC_END_POS)
#define SPP_MISC_REG_CROPB_HSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPB_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPB_HSYNC_END_POS))

/* 0x1CC : cropB_vsync */
#define SPP_MISC_CROPB_VSYNC_OFFSET                             (0x1CC)
#define SPP_MISC_REG_CROPB_VSYNC_START                          SPP_MISC_REG_CROPB_VSYNC_START
#define SPP_MISC_REG_CROPB_VSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPB_VSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPB_VSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPB_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPB_VSYNC_START_POS)
#define SPP_MISC_REG_CROPB_VSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPB_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPB_VSYNC_START_POS))
#define SPP_MISC_REG_CROPB_VSYNC_END                            SPP_MISC_REG_CROPB_VSYNC_END
#define SPP_MISC_REG_CROPB_VSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPB_VSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPB_VSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPB_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPB_VSYNC_END_POS)
#define SPP_MISC_REG_CROPB_VSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPB_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPB_VSYNC_END_POS))

/* 0x1D0 : cropC_hsync */
#define SPP_MISC_CROPC_HSYNC_OFFSET                             (0x1D0)
#define SPP_MISC_REG_CROPC_HSYNC_START                          SPP_MISC_REG_CROPC_HSYNC_START
#define SPP_MISC_REG_CROPC_HSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPC_HSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPC_HSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPC_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPC_HSYNC_START_POS)
#define SPP_MISC_REG_CROPC_HSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPC_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPC_HSYNC_START_POS))
#define SPP_MISC_REG_CROPC_HSYNC_END                            SPP_MISC_REG_CROPC_HSYNC_END
#define SPP_MISC_REG_CROPC_HSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPC_HSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPC_HSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPC_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPC_HSYNC_END_POS)
#define SPP_MISC_REG_CROPC_HSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPC_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPC_HSYNC_END_POS))

/* 0x1D4 : cropC_vsync */
#define SPP_MISC_CROPC_VSYNC_OFFSET                             (0x1D4)
#define SPP_MISC_REG_CROPC_VSYNC_START                          SPP_MISC_REG_CROPC_VSYNC_START
#define SPP_MISC_REG_CROPC_VSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPC_VSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPC_VSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPC_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPC_VSYNC_START_POS)
#define SPP_MISC_REG_CROPC_VSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPC_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPC_VSYNC_START_POS))
#define SPP_MISC_REG_CROPC_VSYNC_END                            SPP_MISC_REG_CROPC_VSYNC_END
#define SPP_MISC_REG_CROPC_VSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPC_VSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPC_VSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPC_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPC_VSYNC_END_POS)
#define SPP_MISC_REG_CROPC_VSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPC_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPC_VSYNC_END_POS))

