bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x1D8 : cropD_hsync */
#define SPP_MISC_CROPD_HSYNC_OFFSET                             (0x1D8)
#define SPP_MISC_REG_CROPD_HSYNC_START                          SPP_MISC_REG_CROPD_HSYNC_START
#define SPP_MISC_REG_CROPD_HSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPD_HSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPD_HSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPD_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPD_HSYNC_START_POS)
#define SPP_MISC_REG_CROPD_HSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPD_HSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPD_HSYNC_START_POS))
#define SPP_MISC_REG_CROPD_HSYNC_END                            SPP_MISC_REG_CROPD_HSYNC_END
#define SPP_MISC_REG_CROPD_HSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPD_HSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPD_HSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPD_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPD_HSYNC_END_POS)
#define SPP_MISC_REG_CROPD_HSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPD_HSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPD_HSYNC_END_POS))

/* 0x1DC : cropD_vsync */
#define SPP_MISC_CROPD_VSYNC_OFFSET                             (0x1DC)
#define SPP_MISC_REG_CROPD_VSYNC_START                          SPP_MISC_REG_CROPD_VSYNC_START
#define SPP_MISC_REG_CROPD_VSYNC_START_POS                      (0U)
#define SPP_MISC_REG_CROPD_VSYNC_START_LEN                      (16U)
#define SPP_MISC_REG_CROPD_VSYNC_START_MSK                      (((1U<<SPP_MISC_REG_CROPD_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPD_VSYNC_START_POS)
#define SPP_MISC_REG_CROPD_VSYNC_START_UMSK                     (~(((1U<<SPP_MISC_REG_CROPD_VSYNC_START_LEN)-1)<<SPP_MISC_REG_CROPD_VSYNC_START_POS))
#define SPP_MISC_REG_CROPD_VSYNC_END                            SPP_MISC_REG_CROPD_VSYNC_END
#define SPP_MISC_REG_CROPD_VSYNC_END_POS                        (16U)
#define SPP_MISC_REG_CROPD_VSYNC_END_LEN                        (16U)
#define SPP_MISC_REG_CROPD_VSYNC_END_MSK                        (((1U<<SPP_MISC_REG_CROPD_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPD_VSYNC_END_POS)
#define SPP_MISC_REG_CROPD_VSYNC_END_UMSK                       (~(((1U<<SPP_MISC_REG_CROPD_VSYNC_END_LEN)-1)<<SPP_MISC_REG_CROPD_VSYNC_END_POS))

/* 0x1E0 : crop_enable */
#define SPP_MISC_CROP_ENABLE_OFFSET                             (0x1E0)
#define SPP_MISC_REG_CROPA_ENABLE                               SPP_MISC_REG_CROPA_ENABLE
#define SPP_MISC_REG_CROPA_ENABLE_POS                           (0U)
#define SPP_MISC_REG_CROPA_ENABLE_LEN                           (1U)
#define SPP_MISC_REG_CROPA_ENABLE_MSK                           (((1U<<SPP_MISC_REG_CROPA_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPA_ENABLE_POS)
#define SPP_MISC_REG_CROPA_ENABLE_UMSK                          (~(((1U<<SPP_MISC_REG_CROPA_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPA_ENABLE_POS))
#define SPP_MISC_REG_CROPB_ENABLE                               SPP_MISC_REG_CROPB_ENABLE
#define SPP_MISC_REG_CROPB_ENABLE_POS                           (1U)
#define SPP_MISC_REG_CROPB_ENABLE_LEN                           (1U)
#define SPP_MISC_REG_CROPB_ENABLE_MSK                           (((1U<<SPP_MISC_REG_CROPB_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPB_ENABLE_POS)
#define SPP_MISC_REG_CROPB_ENABLE_UMSK                          (~(((1U<<SPP_MISC_REG_CROPB_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPB_ENABLE_POS))
#define SPP_MISC_REG_CROPC_ENABLE                               SPP_MISC_REG_CROPC_ENABLE
#define SPP_MISC_REG_CROPC_ENABLE_POS                           (2U)
#define SPP_MISC_REG_CROPC_ENABLE_LEN                           (1U)
#define SPP_MISC_REG_CROPC_ENABLE_MSK                           (((1U<<SPP_MISC_REG_CROPC_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPC_ENABLE_POS)
#define SPP_MISC_REG_CROPC_ENABLE_UMSK                          (~(((1U<<SPP_MISC_REG_CROPC_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPC_ENABLE_POS))
#define SPP_MISC_REG_CROPD_ENABLE                               SPP_MISC_REG_CROPD_ENABLE
#define SPP_MISC_REG_CROPD_ENABLE_POS                           (3U)
#define SPP_MISC_REG_CROPD_ENABLE_LEN                           (1U)
#define SPP_MISC_REG_CROPD_ENABLE_MSK                           (((1U<<SPP_MISC_REG_CROPD_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPD_ENABLE_POS)
#define SPP_MISC_REG_CROPD_ENABLE_UMSK                          (~(((1U<<SPP_MISC_REG_CROPD_ENABLE_LEN)-1)<<SPP_MISC_REG_CROPD_ENABLE_POS))

/* 0x1FC : disp_gma_cfg */
#define SPP_MISC_DISP_GMA_CFG_OFFSET                            (0x1FC)
#define SPP_MISC_REG_DP_GMA_CH0_EN                              SPP_MISC_REG_DP_GMA_CH0_EN
#define SPP_MISC_REG_DP_GMA_CH0_EN_POS                          (0U)
#define SPP_MISC_REG_DP_GMA_CH0_EN_LEN                          (1U)
#define SPP_MISC_REG_DP_GMA_CH0_EN_MSK                          (((1U<<SPP_MISC_REG_DP_GMA_CH0_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH0_EN_POS)
#define SPP_MISC_REG_DP_GMA_CH0_EN_UMSK                         (~(((1U<<SPP_MISC_REG_DP_GMA_CH0_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH0_EN_POS))
#define SPP_MISC_REG_DP_GMA_CH1_EN                              SPP_MISC_REG_DP_GMA_CH1_EN
#define SPP_MISC_REG_DP_GMA_CH1_EN_POS                          (1U)
#define SPP_MISC_REG_DP_GMA_CH1_EN_LEN                          (1U)
#define SPP_MISC_REG_DP_GMA_CH1_EN_MSK                          (((1U<<SPP_MISC_REG_DP_GMA_CH1_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH1_EN_POS)
#define SPP_MISC_REG_DP_GMA_CH1_EN_UMSK                         (~(((1U<<SPP_MISC_REG_DP_GMA_CH1_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH1_EN_POS))
#define SPP_MISC_REG_DP_GMA_CH2_EN                              SPP_MISC_REG_DP_GMA_CH2_EN
#define SPP_MISC_REG_DP_GMA_CH2_EN_POS                          (2U)
#define SPP_MISC_REG_DP_GMA_CH2_EN_LEN                          (1U)
#define SPP_MISC_REG_DP_GMA_CH2_EN_MSK                          (((1U<<SPP_MISC_REG_DP_GMA_CH2_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH2_EN_POS)
#define SPP_MISC_REG_DP_GMA_CH2_EN_UMSK                         (~(((1U<<SPP_MISC_REG_DP_GMA_CH2_EN_LEN)-1)<<SPP_MISC_REG_DP_GMA_CH2_EN_POS))

/* 0x200 : disp_gma_curve_00 */
#define SPP_MISC_DISP_GMA_CURVE_00_OFFSET                       (0x200)
#define SPP_MISC_REG_DP_GMA_CURVE_00                            SPP_MISC_REG_DP_GMA_CURVE_00
#define SPP_MISC_REG_DP_GMA_CURVE_00_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_00_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_00_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_00_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_00_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_00_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_00_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_00_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_01                            SPP_MISC_REG_DP_GMA_CURVE_01
#define SPP_MISC_REG_DP_GMA_CURVE_01_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_01_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_01_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_01_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_01_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_01_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_01_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_01_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_02                            SPP_MISC_REG_DP_GMA_CURVE_02
#define SPP_MISC_REG_DP_GMA_CURVE_02_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_02_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_02_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_02_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_02_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_02_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_02_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_02_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_03                            SPP_MISC_REG_DP_GMA_CURVE_03
#define SPP_MISC_REG_DP_GMA_CURVE_03_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_03_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_03_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_03_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_03_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_03_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_03_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_03_POS))

/* 0x204 : disp_gma_curve_04 */
#define SPP_MISC_DISP_GMA_CURVE_04_OFFSET                       (0x204)
#define SPP_MISC_REG_DP_GMA_CURVE_04                            SPP_MISC_REG_DP_GMA_CURVE_04
#define SPP_MISC_REG_DP_GMA_CURVE_04_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_04_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_04_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_04_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_04_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_04_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_04_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_04_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_05                            SPP_MISC_REG_DP_GMA_CURVE_05
#define SPP_MISC_REG_DP_GMA_CURVE_05_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_05_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_05_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_05_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_05_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_05_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_05_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_05_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_06                            SPP_MISC_REG_DP_GMA_CURVE_06
#define SPP_MISC_REG_DP_GMA_CURVE_06_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_06_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_06_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_06_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_06_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_06_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_06_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_06_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_07                            SPP_MISC_REG_DP_GMA_CURVE_07
#define SPP_MISC_REG_DP_GMA_CURVE_07_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_07_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_07_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_07_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_07_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_07_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_07_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_07_POS))

