bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x208 : disp_gma_curve_08 */
#define SPP_MISC_DISP_GMA_CURVE_08_OFFSET                       (0x208)
#define SPP_MISC_REG_DP_GMA_CURVE_08                            SPP_MISC_REG_DP_GMA_CURVE_08
#define SPP_MISC_REG_DP_GMA_CURVE_08_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_08_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_08_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_08_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_08_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_08_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_08_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_08_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_09                            SPP_MISC_REG_DP_GMA_CURVE_09
#define SPP_MISC_REG_DP_GMA_CURVE_09_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_09_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_09_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_09_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_09_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_09_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_09_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_09_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_0A                            SPP_MISC_REG_DP_GMA_CURVE_0A
#define SPP_MISC_REG_DP_GMA_CURVE_0A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_0A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_0B                            SPP_MISC_REG_DP_GMA_CURVE_0B
#define SPP_MISC_REG_DP_GMA_CURVE_0B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_0B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0B_POS))

/* 0x20C : disp_gma_curve_0c */
#define SPP_MISC_DISP_GMA_CURVE_0C_OFFSET                       (0x20C)
#define SPP_MISC_REG_DP_GMA_CURVE_0C                            SPP_MISC_REG_DP_GMA_CURVE_0C
#define SPP_MISC_REG_DP_GMA_CURVE_0C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_0C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_0D                            SPP_MISC_REG_DP_GMA_CURVE_0D
#define SPP_MISC_REG_DP_GMA_CURVE_0D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_0E                            SPP_MISC_REG_DP_GMA_CURVE_0E
#define SPP_MISC_REG_DP_GMA_CURVE_0E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_0E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_0F                            SPP_MISC_REG_DP_GMA_CURVE_0F
#define SPP_MISC_REG_DP_GMA_CURVE_0F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_0F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_0F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_0F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_0F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_0F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_0F_POS))

/* 0x210 : disp_gma_curve_10 */
#define SPP_MISC_DISP_GMA_CURVE_10_OFFSET                       (0x210)
#define SPP_MISC_REG_DP_GMA_CURVE_10                            SPP_MISC_REG_DP_GMA_CURVE_10
#define SPP_MISC_REG_DP_GMA_CURVE_10_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_10_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_10_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_10_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_10_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_10_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_10_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_10_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_11                            SPP_MISC_REG_DP_GMA_CURVE_11
#define SPP_MISC_REG_DP_GMA_CURVE_11_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_11_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_11_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_11_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_11_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_11_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_11_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_11_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_12                            SPP_MISC_REG_DP_GMA_CURVE_12
#define SPP_MISC_REG_DP_GMA_CURVE_12_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_12_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_12_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_12_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_12_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_12_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_12_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_12_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_13                            SPP_MISC_REG_DP_GMA_CURVE_13
#define SPP_MISC_REG_DP_GMA_CURVE_13_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_13_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_13_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_13_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_13_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_13_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_13_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_13_POS))

/* 0x214 : disp_gma_curve_14 */
#define SPP_MISC_DISP_GMA_CURVE_14_OFFSET                       (0x214)
#define SPP_MISC_REG_DP_GMA_CURVE_14                            SPP_MISC_REG_DP_GMA_CURVE_14
#define SPP_MISC_REG_DP_GMA_CURVE_14_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_14_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_14_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_14_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_14_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_14_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_14_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_14_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_15                            SPP_MISC_REG_DP_GMA_CURVE_15
#define SPP_MISC_REG_DP_GMA_CURVE_15_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_15_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_15_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_15_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_15_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_15_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_15_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_15_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_16                            SPP_MISC_REG_DP_GMA_CURVE_16
#define SPP_MISC_REG_DP_GMA_CURVE_16_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_16_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_16_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_16_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_16_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_16_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_16_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_16_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_17                            SPP_MISC_REG_DP_GMA_CURVE_17
#define SPP_MISC_REG_DP_GMA_CURVE_17_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_17_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_17_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_17_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_17_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_17_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_17_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_17_POS))

/* 0x218 : disp_gma_curve_18 */
#define SPP_MISC_DISP_GMA_CURVE_18_OFFSET                       (0x218)
#define SPP_MISC_REG_DP_GMA_CURVE_18                            SPP_MISC_REG_DP_GMA_CURVE_18
#define SPP_MISC_REG_DP_GMA_CURVE_18_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_18_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_18_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_18_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_18_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_18_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_18_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_18_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_19                            SPP_MISC_REG_DP_GMA_CURVE_19
#define SPP_MISC_REG_DP_GMA_CURVE_19_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_19_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_19_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_19_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_19_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_19_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_19_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_19_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_1A                            SPP_MISC_REG_DP_GMA_CURVE_1A
#define SPP_MISC_REG_DP_GMA_CURVE_1A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_1A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_1B                            SPP_MISC_REG_DP_GMA_CURVE_1B
#define SPP_MISC_REG_DP_GMA_CURVE_1B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_1B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1B_POS))

/* 0x21C : disp_gma_curve_1c */
#define SPP_MISC_DISP_GMA_CURVE_1C_OFFSET                       (0x21C)
#define SPP_MISC_REG_DP_GMA_CURVE_1C                            SPP_MISC_REG_DP_GMA_CURVE_1C
#define SPP_MISC_REG_DP_GMA_CURVE_1C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_1C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_1D                            SPP_MISC_REG_DP_GMA_CURVE_1D
#define SPP_MISC_REG_DP_GMA_CURVE_1D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_1E                            SPP_MISC_REG_DP_GMA_CURVE_1E
#define SPP_MISC_REG_DP_GMA_CURVE_1E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_1E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_1F                            SPP_MISC_REG_DP_GMA_CURVE_1F
#define SPP_MISC_REG_DP_GMA_CURVE_1F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_1F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_1F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_1F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_1F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_1F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_1F_POS))

