bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x220 : disp_gma_curve_20 */
#define SPP_MISC_DISP_GMA_CURVE_20_OFFSET                       (0x220)
#define SPP_MISC_REG_DP_GMA_CURVE_20                            SPP_MISC_REG_DP_GMA_CURVE_20
#define SPP_MISC_REG_DP_GMA_CURVE_20_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_20_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_20_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_20_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_20_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_20_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_20_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_20_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_21                            SPP_MISC_REG_DP_GMA_CURVE_21
#define SPP_MISC_REG_DP_GMA_CURVE_21_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_21_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_21_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_21_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_21_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_21_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_21_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_21_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_22                            SPP_MISC_REG_DP_GMA_CURVE_22
#define SPP_MISC_REG_DP_GMA_CURVE_22_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_22_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_22_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_22_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_22_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_22_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_22_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_22_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_23                            SPP_MISC_REG_DP_GMA_CURVE_23
#define SPP_MISC_REG_DP_GMA_CURVE_23_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_23_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_23_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_23_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_23_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_23_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_23_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_23_POS))

/* 0x224 : disp_gma_curve_24 */
#define SPP_MISC_DISP_GMA_CURVE_24_OFFSET                       (0x224)
#define SPP_MISC_REG_DP_GMA_CURVE_24                            SPP_MISC_REG_DP_GMA_CURVE_24
#define SPP_MISC_REG_DP_GMA_CURVE_24_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_24_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_24_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_24_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_24_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_24_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_24_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_24_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_25                            SPP_MISC_REG_DP_GMA_CURVE_25
#define SPP_MISC_REG_DP_GMA_CURVE_25_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_25_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_25_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_25_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_25_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_25_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_25_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_25_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_26                            SPP_MISC_REG_DP_GMA_CURVE_26
#define SPP_MISC_REG_DP_GMA_CURVE_26_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_26_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_26_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_26_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_26_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_26_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_26_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_26_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_27                            SPP_MISC_REG_DP_GMA_CURVE_27
#define SPP_MISC_REG_DP_GMA_CURVE_27_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_27_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_27_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_27_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_27_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_27_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_27_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_27_POS))

/* 0x228 : disp_gma_curve_28 */
#define SPP_MISC_DISP_GMA_CURVE_28_OFFSET                       (0x228)
#define SPP_MISC_REG_DP_GMA_CURVE_28                            SPP_MISC_REG_DP_GMA_CURVE_28
#define SPP_MISC_REG_DP_GMA_CURVE_28_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_28_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_28_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_28_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_28_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_28_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_28_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_28_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_29                            SPP_MISC_REG_DP_GMA_CURVE_29
#define SPP_MISC_REG_DP_GMA_CURVE_29_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_29_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_29_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_29_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_29_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_29_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_29_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_29_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_2A                            SPP_MISC_REG_DP_GMA_CURVE_2A
#define SPP_MISC_REG_DP_GMA_CURVE_2A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_2A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_2B                            SPP_MISC_REG_DP_GMA_CURVE_2B
#define SPP_MISC_REG_DP_GMA_CURVE_2B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_2B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2B_POS))

/* 0x22C : disp_gma_curve_2c */
#define SPP_MISC_DISP_GMA_CURVE_2C_OFFSET                       (0x22C)
#define SPP_MISC_REG_DP_GMA_CURVE_2C                            SPP_MISC_REG_DP_GMA_CURVE_2C
#define SPP_MISC_REG_DP_GMA_CURVE_2C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_2C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_2D                            SPP_MISC_REG_DP_GMA_CURVE_2D
#define SPP_MISC_REG_DP_GMA_CURVE_2D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_2E                            SPP_MISC_REG_DP_GMA_CURVE_2E
#define SPP_MISC_REG_DP_GMA_CURVE_2E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_2E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_2F                            SPP_MISC_REG_DP_GMA_CURVE_2F
#define SPP_MISC_REG_DP_GMA_CURVE_2F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_2F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_2F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_2F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_2F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_2F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_2F_POS))

/* 0x230 : disp_gma_curve_30 */
#define SPP_MISC_DISP_GMA_CURVE_30_OFFSET                       (0x230)
#define SPP_MISC_REG_DP_GMA_CURVE_30                            SPP_MISC_REG_DP_GMA_CURVE_30
#define SPP_MISC_REG_DP_GMA_CURVE_30_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_30_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_30_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_30_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_30_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_30_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_30_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_30_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_31                            SPP_MISC_REG_DP_GMA_CURVE_31
#define SPP_MISC_REG_DP_GMA_CURVE_31_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_31_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_31_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_31_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_31_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_31_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_31_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_31_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_32                            SPP_MISC_REG_DP_GMA_CURVE_32
#define SPP_MISC_REG_DP_GMA_CURVE_32_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_32_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_32_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_32_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_32_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_32_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_32_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_32_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_33                            SPP_MISC_REG_DP_GMA_CURVE_33
#define SPP_MISC_REG_DP_GMA_CURVE_33_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_33_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_33_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_33_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_33_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_33_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_33_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_33_POS))

/* 0x234 : disp_gma_curve_34 */
#define SPP_MISC_DISP_GMA_CURVE_34_OFFSET                       (0x234)
#define SPP_MISC_REG_DP_GMA_CURVE_34                            SPP_MISC_REG_DP_GMA_CURVE_34
#define SPP_MISC_REG_DP_GMA_CURVE_34_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_34_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_34_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_34_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_34_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_34_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_34_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_34_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_35                            SPP_MISC_REG_DP_GMA_CURVE_35
#define SPP_MISC_REG_DP_GMA_CURVE_35_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_35_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_35_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_35_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_35_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_35_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_35_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_35_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_36                            SPP_MISC_REG_DP_GMA_CURVE_36
#define SPP_MISC_REG_DP_GMA_CURVE_36_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_36_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_36_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_36_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_36_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_36_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_36_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_36_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_37                            SPP_MISC_REG_DP_GMA_CURVE_37
#define SPP_MISC_REG_DP_GMA_CURVE_37_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_37_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_37_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_37_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_37_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_37_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_37_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_37_POS))

/* 0x238 : disp_gma_curve_38 */
#define SPP_MISC_DISP_GMA_CURVE_38_OFFSET                       (0x238)
#define SPP_MISC_REG_DP_GMA_CURVE_38                            SPP_MISC_REG_DP_GMA_CURVE_38
#define SPP_MISC_REG_DP_GMA_CURVE_38_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_38_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_38_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_38_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_38_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_38_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_38_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_38_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_39                            SPP_MISC_REG_DP_GMA_CURVE_39
#define SPP_MISC_REG_DP_GMA_CURVE_39_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_39_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_39_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_39_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_39_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_39_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_39_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_39_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_3A                            SPP_MISC_REG_DP_GMA_CURVE_3A
#define SPP_MISC_REG_DP_GMA_CURVE_3A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_3A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_3B                            SPP_MISC_REG_DP_GMA_CURVE_3B
#define SPP_MISC_REG_DP_GMA_CURVE_3B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_3B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3B_POS))

