bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x23C : disp_gma_curve_3c */
#define SPP_MISC_DISP_GMA_CURVE_3C_OFFSET                       (0x23C)
#define SPP_MISC_REG_DP_GMA_CURVE_3C                            SPP_MISC_REG_DP_GMA_CURVE_3C
#define SPP_MISC_REG_DP_GMA_CURVE_3C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_3C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_3D                            SPP_MISC_REG_DP_GMA_CURVE_3D
#define SPP_MISC_REG_DP_GMA_CURVE_3D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_3E                            SPP_MISC_REG_DP_GMA_CURVE_3E
#define SPP_MISC_REG_DP_GMA_CURVE_3E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_3E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_3F                            SPP_MISC_REG_DP_GMA_CURVE_3F
#define SPP_MISC_REG_DP_GMA_CURVE_3F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_3F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_3F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_3F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_3F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_3F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_3F_POS))

/* 0x240 : disp_gma_curve_40 */
#define SPP_MISC_DISP_GMA_CURVE_40_OFFSET                       (0x240)
#define SPP_MISC_REG_DP_GMA_CURVE_40                            SPP_MISC_REG_DP_GMA_CURVE_40
#define SPP_MISC_REG_DP_GMA_CURVE_40_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_40_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_40_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_40_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_40_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_40_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_40_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_40_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_41                            SPP_MISC_REG_DP_GMA_CURVE_41
#define SPP_MISC_REG_DP_GMA_CURVE_41_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_41_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_41_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_41_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_41_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_41_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_41_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_41_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_42                            SPP_MISC_REG_DP_GMA_CURVE_42
#define SPP_MISC_REG_DP_GMA_CURVE_42_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_42_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_42_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_42_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_42_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_42_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_42_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_42_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_43                            SPP_MISC_REG_DP_GMA_CURVE_43
#define SPP_MISC_REG_DP_GMA_CURVE_43_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_43_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_43_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_43_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_43_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_43_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_43_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_43_POS))

/* 0x244 : disp_gma_curve_44 */
#define SPP_MISC_DISP_GMA_CURVE_44_OFFSET                       (0x244)
#define SPP_MISC_REG_DP_GMA_CURVE_44                            SPP_MISC_REG_DP_GMA_CURVE_44
#define SPP_MISC_REG_DP_GMA_CURVE_44_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_44_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_44_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_44_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_44_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_44_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_44_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_44_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_45                            SPP_MISC_REG_DP_GMA_CURVE_45
#define SPP_MISC_REG_DP_GMA_CURVE_45_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_45_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_45_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_45_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_45_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_45_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_45_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_45_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_46                            SPP_MISC_REG_DP_GMA_CURVE_46
#define SPP_MISC_REG_DP_GMA_CURVE_46_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_46_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_46_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_46_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_46_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_46_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_46_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_46_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_47                            SPP_MISC_REG_DP_GMA_CURVE_47
#define SPP_MISC_REG_DP_GMA_CURVE_47_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_47_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_47_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_47_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_47_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_47_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_47_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_47_POS))

/* 0x248 : disp_gma_curve_48 */
#define SPP_MISC_DISP_GMA_CURVE_48_OFFSET                       (0x248)
#define SPP_MISC_REG_DP_GMA_CURVE_48                            SPP_MISC_REG_DP_GMA_CURVE_48
#define SPP_MISC_REG_DP_GMA_CURVE_48_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_48_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_48_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_48_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_48_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_48_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_48_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_48_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_49                            SPP_MISC_REG_DP_GMA_CURVE_49
#define SPP_MISC_REG_DP_GMA_CURVE_49_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_49_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_49_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_49_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_49_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_49_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_49_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_49_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_4A                            SPP_MISC_REG_DP_GMA_CURVE_4A
#define SPP_MISC_REG_DP_GMA_CURVE_4A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_4A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_4B                            SPP_MISC_REG_DP_GMA_CURVE_4B
#define SPP_MISC_REG_DP_GMA_CURVE_4B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_4B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4B_POS))

