bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x24C : disp_gma_curve_4c */
#define SPP_MISC_DISP_GMA_CURVE_4C_OFFSET                       (0x24C)
#define SPP_MISC_REG_DP_GMA_CURVE_4C                            SPP_MISC_REG_DP_GMA_CURVE_4C
#define SPP_MISC_REG_DP_GMA_CURVE_4C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_4C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_4D                            SPP_MISC_REG_DP_GMA_CURVE_4D
#define SPP_MISC_REG_DP_GMA_CURVE_4D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_4E                            SPP_MISC_REG_DP_GMA_CURVE_4E
#define SPP_MISC_REG_DP_GMA_CURVE_4E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_4E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_4F                            SPP_MISC_REG_DP_GMA_CURVE_4F
#define SPP_MISC_REG_DP_GMA_CURVE_4F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_4F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_4F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_4F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_4F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_4F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_4F_POS))

/* 0x250 : disp_gma_curve_50 */
#define SPP_MISC_DISP_GMA_CURVE_50_OFFSET                       (0x250)
#define SPP_MISC_REG_DP_GMA_CURVE_50                            SPP_MISC_REG_DP_GMA_CURVE_50
#define SPP_MISC_REG_DP_GMA_CURVE_50_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_50_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_50_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_50_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_50_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_50_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_50_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_50_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_51                            SPP_MISC_REG_DP_GMA_CURVE_51
#define SPP_MISC_REG_DP_GMA_CURVE_51_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_51_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_51_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_51_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_51_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_51_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_51_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_51_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_52                            SPP_MISC_REG_DP_GMA_CURVE_52
#define SPP_MISC_REG_DP_GMA_CURVE_52_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_52_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_52_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_52_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_52_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_52_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_52_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_52_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_53                            SPP_MISC_REG_DP_GMA_CURVE_53
#define SPP_MISC_REG_DP_GMA_CURVE_53_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_53_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_53_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_53_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_53_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_53_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_53_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_53_POS))

/* 0x254 : disp_gma_curve_54 */
#define SPP_MISC_DISP_GMA_CURVE_54_OFFSET                       (0x254)
#define SPP_MISC_REG_DP_GMA_CURVE_54                            SPP_MISC_REG_DP_GMA_CURVE_54
#define SPP_MISC_REG_DP_GMA_CURVE_54_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_54_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_54_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_54_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_54_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_54_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_54_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_54_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_55                            SPP_MISC_REG_DP_GMA_CURVE_55
#define SPP_MISC_REG_DP_GMA_CURVE_55_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_55_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_55_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_55_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_55_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_55_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_55_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_55_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_56                            SPP_MISC_REG_DP_GMA_CURVE_56
#define SPP_MISC_REG_DP_GMA_CURVE_56_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_56_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_56_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_56_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_56_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_56_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_56_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_56_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_57                            SPP_MISC_REG_DP_GMA_CURVE_57
#define SPP_MISC_REG_DP_GMA_CURVE_57_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_57_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_57_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_57_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_57_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_57_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_57_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_57_POS))

/* 0x258 : disp_gma_curve_58 */
#define SPP_MISC_DISP_GMA_CURVE_58_OFFSET                       (0x258)
#define SPP_MISC_REG_DP_GMA_CURVE_58                            SPP_MISC_REG_DP_GMA_CURVE_58
#define SPP_MISC_REG_DP_GMA_CURVE_58_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_58_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_58_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_58_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_58_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_58_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_58_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_58_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_59                            SPP_MISC_REG_DP_GMA_CURVE_59
#define SPP_MISC_REG_DP_GMA_CURVE_59_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_59_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_59_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_59_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_59_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_59_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_59_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_59_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_5A                            SPP_MISC_REG_DP_GMA_CURVE_5A
#define SPP_MISC_REG_DP_GMA_CURVE_5A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_5A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_5B                            SPP_MISC_REG_DP_GMA_CURVE_5B
#define SPP_MISC_REG_DP_GMA_CURVE_5B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_5B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5B_POS))

/* 0x25C : disp_gma_curve_5c */
#define SPP_MISC_DISP_GMA_CURVE_5C_OFFSET                       (0x25C)
#define SPP_MISC_REG_DP_GMA_CURVE_5C                            SPP_MISC_REG_DP_GMA_CURVE_5C
#define SPP_MISC_REG_DP_GMA_CURVE_5C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_5C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_5D                            SPP_MISC_REG_DP_GMA_CURVE_5D
#define SPP_MISC_REG_DP_GMA_CURVE_5D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_5E                            SPP_MISC_REG_DP_GMA_CURVE_5E
#define SPP_MISC_REG_DP_GMA_CURVE_5E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_5E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_5F                            SPP_MISC_REG_DP_GMA_CURVE_5F
#define SPP_MISC_REG_DP_GMA_CURVE_5F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_5F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_5F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_5F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_5F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_5F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_5F_POS))

/* 0x260 : disp_gma_curve_60 */
#define SPP_MISC_DISP_GMA_CURVE_60_OFFSET                       (0x260)
#define SPP_MISC_REG_DP_GMA_CURVE_60                            SPP_MISC_REG_DP_GMA_CURVE_60
#define SPP_MISC_REG_DP_GMA_CURVE_60_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_60_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_60_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_60_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_60_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_60_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_60_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_60_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_61                            SPP_MISC_REG_DP_GMA_CURVE_61
#define SPP_MISC_REG_DP_GMA_CURVE_61_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_61_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_61_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_61_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_61_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_61_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_61_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_61_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_62                            SPP_MISC_REG_DP_GMA_CURVE_62
#define SPP_MISC_REG_DP_GMA_CURVE_62_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_62_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_62_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_62_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_62_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_62_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_62_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_62_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_63                            SPP_MISC_REG_DP_GMA_CURVE_63
#define SPP_MISC_REG_DP_GMA_CURVE_63_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_63_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_63_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_63_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_63_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_63_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_63_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_63_POS))

/* 0x264 : disp_gma_curve_64 */
#define SPP_MISC_DISP_GMA_CURVE_64_OFFSET                       (0x264)
#define SPP_MISC_REG_DP_GMA_CURVE_64                            SPP_MISC_REG_DP_GMA_CURVE_64
#define SPP_MISC_REG_DP_GMA_CURVE_64_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_64_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_64_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_64_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_64_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_64_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_64_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_64_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_65                            SPP_MISC_REG_DP_GMA_CURVE_65
#define SPP_MISC_REG_DP_GMA_CURVE_65_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_65_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_65_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_65_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_65_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_65_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_65_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_65_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_66                            SPP_MISC_REG_DP_GMA_CURVE_66
#define SPP_MISC_REG_DP_GMA_CURVE_66_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_66_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_66_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_66_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_66_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_66_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_66_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_66_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_67                            SPP_MISC_REG_DP_GMA_CURVE_67
#define SPP_MISC_REG_DP_GMA_CURVE_67_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_67_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_67_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_67_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_67_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_67_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_67_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_67_POS))

/* 0x268 : disp_gma_curve_68 */
#define SPP_MISC_DISP_GMA_CURVE_68_OFFSET                       (0x268)
#define SPP_MISC_REG_DP_GMA_CURVE_68                            SPP_MISC_REG_DP_GMA_CURVE_68
#define SPP_MISC_REG_DP_GMA_CURVE_68_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_68_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_68_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_68_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_68_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_68_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_68_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_68_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_69                            SPP_MISC_REG_DP_GMA_CURVE_69
#define SPP_MISC_REG_DP_GMA_CURVE_69_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_69_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_69_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_69_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_69_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_69_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_69_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_69_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_6A                            SPP_MISC_REG_DP_GMA_CURVE_6A
#define SPP_MISC_REG_DP_GMA_CURVE_6A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_6A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_6B                            SPP_MISC_REG_DP_GMA_CURVE_6B
#define SPP_MISC_REG_DP_GMA_CURVE_6B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_6B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6B_POS))

/* 0x26C : disp_gma_curve_6c */
#define SPP_MISC_DISP_GMA_CURVE_6C_OFFSET                       (0x26C)
#define SPP_MISC_REG_DP_GMA_CURVE_6C                            SPP_MISC_REG_DP_GMA_CURVE_6C
#define SPP_MISC_REG_DP_GMA_CURVE_6C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_6C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_6D                            SPP_MISC_REG_DP_GMA_CURVE_6D
#define SPP_MISC_REG_DP_GMA_CURVE_6D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_6E                            SPP_MISC_REG_DP_GMA_CURVE_6E
#define SPP_MISC_REG_DP_GMA_CURVE_6E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_6E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_6F                            SPP_MISC_REG_DP_GMA_CURVE_6F
#define SPP_MISC_REG_DP_GMA_CURVE_6F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_6F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_6F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_6F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_6F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_6F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_6F_POS))

/* 0x270 : disp_gma_curve_70 */
#define SPP_MISC_DISP_GMA_CURVE_70_OFFSET                       (0x270)
#define SPP_MISC_REG_DP_GMA_CURVE_70                            SPP_MISC_REG_DP_GMA_CURVE_70
#define SPP_MISC_REG_DP_GMA_CURVE_70_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_70_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_70_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_70_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_70_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_70_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_70_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_70_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_71                            SPP_MISC_REG_DP_GMA_CURVE_71
#define SPP_MISC_REG_DP_GMA_CURVE_71_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_71_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_71_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_71_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_71_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_71_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_71_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_71_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_72                            SPP_MISC_REG_DP_GMA_CURVE_72
#define SPP_MISC_REG_DP_GMA_CURVE_72_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_72_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_72_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_72_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_72_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_72_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_72_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_72_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_73                            SPP_MISC_REG_DP_GMA_CURVE_73
#define SPP_MISC_REG_DP_GMA_CURVE_73_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_73_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_73_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_73_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_73_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_73_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_73_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_73_POS))

