bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x298 : disp_gma_curve_98 */
#define SPP_MISC_DISP_GMA_CURVE_98_OFFSET                       (0x298)
#define SPP_MISC_REG_DP_GMA_CURVE_98                            SPP_MISC_REG_DP_GMA_CURVE_98
#define SPP_MISC_REG_DP_GMA_CURVE_98_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_98_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_98_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_98_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_98_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_98_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_98_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_98_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_99                            SPP_MISC_REG_DP_GMA_CURVE_99
#define SPP_MISC_REG_DP_GMA_CURVE_99_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_99_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_99_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_99_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_99_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_99_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_99_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_99_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_9A                            SPP_MISC_REG_DP_GMA_CURVE_9A
#define SPP_MISC_REG_DP_GMA_CURVE_9A_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_9A_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9A_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9A_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9A_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9A_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9A_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_9B                            SPP_MISC_REG_DP_GMA_CURVE_9B
#define SPP_MISC_REG_DP_GMA_CURVE_9B_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_9B_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9B_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9B_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9B_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9B_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9B_POS))

/* 0x29C : disp_gma_curve_9c */
#define SPP_MISC_DISP_GMA_CURVE_9C_OFFSET                       (0x29C)
#define SPP_MISC_REG_DP_GMA_CURVE_9C                            SPP_MISC_REG_DP_GMA_CURVE_9C
#define SPP_MISC_REG_DP_GMA_CURVE_9C_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_9C_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9C_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9C_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9C_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9C_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9C_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_9D                            SPP_MISC_REG_DP_GMA_CURVE_9D
#define SPP_MISC_REG_DP_GMA_CURVE_9D_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9D_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9D_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9D_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9D_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9D_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9D_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_9E                            SPP_MISC_REG_DP_GMA_CURVE_9E
#define SPP_MISC_REG_DP_GMA_CURVE_9E_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_9E_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9E_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9E_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9E_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9E_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9E_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_9F                            SPP_MISC_REG_DP_GMA_CURVE_9F
#define SPP_MISC_REG_DP_GMA_CURVE_9F_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_9F_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_9F_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_9F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9F_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_9F_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_9F_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_9F_POS))

/* 0x2A0 : disp_gma_curve_a0 */
#define SPP_MISC_DISP_GMA_CURVE_A0_OFFSET                       (0x2A0)
#define SPP_MISC_REG_DP_GMA_CURVE_A0                            SPP_MISC_REG_DP_GMA_CURVE_A0
#define SPP_MISC_REG_DP_GMA_CURVE_A0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_A0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A1                            SPP_MISC_REG_DP_GMA_CURVE_A1
#define SPP_MISC_REG_DP_GMA_CURVE_A1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A2                            SPP_MISC_REG_DP_GMA_CURVE_A2
#define SPP_MISC_REG_DP_GMA_CURVE_A2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_A2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A3                            SPP_MISC_REG_DP_GMA_CURVE_A3
#define SPP_MISC_REG_DP_GMA_CURVE_A3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_A3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A3_POS))

/* 0x2A4 : disp_gma_curve_a4 */
#define SPP_MISC_DISP_GMA_CURVE_A4_OFFSET                       (0x2A4)
#define SPP_MISC_REG_DP_GMA_CURVE_A4                            SPP_MISC_REG_DP_GMA_CURVE_A4
#define SPP_MISC_REG_DP_GMA_CURVE_A4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_A4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A5                            SPP_MISC_REG_DP_GMA_CURVE_A5
#define SPP_MISC_REG_DP_GMA_CURVE_A5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A6                            SPP_MISC_REG_DP_GMA_CURVE_A6
#define SPP_MISC_REG_DP_GMA_CURVE_A6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_A6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A7                            SPP_MISC_REG_DP_GMA_CURVE_A7
#define SPP_MISC_REG_DP_GMA_CURVE_A7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_A7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A7_POS))

/* 0x2A8 : disp_gma_curve_a8 */
#define SPP_MISC_DISP_GMA_CURVE_A8_OFFSET                       (0x2A8)
#define SPP_MISC_REG_DP_GMA_CURVE_A8                            SPP_MISC_REG_DP_GMA_CURVE_A8
#define SPP_MISC_REG_DP_GMA_CURVE_A8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_A8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_A9                            SPP_MISC_REG_DP_GMA_CURVE_A9
#define SPP_MISC_REG_DP_GMA_CURVE_A9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_A9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_A9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_A9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_A9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_A9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_AA                            SPP_MISC_REG_DP_GMA_CURVE_AA
#define SPP_MISC_REG_DP_GMA_CURVE_AA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_AA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_AA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_AA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_AA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_AB                            SPP_MISC_REG_DP_GMA_CURVE_AB
#define SPP_MISC_REG_DP_GMA_CURVE_AB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_AB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_AB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_AB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_AB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AB_POS))

/* 0x2AC : disp_gma_curve_ac */
#define SPP_MISC_DISP_GMA_CURVE_AC_OFFSET                       (0x2AC)
#define SPP_MISC_REG_DP_GMA_CURVE_AC                            SPP_MISC_REG_DP_GMA_CURVE_AC
#define SPP_MISC_REG_DP_GMA_CURVE_AC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_AC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_AC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_AC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_AC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_AD                            SPP_MISC_REG_DP_GMA_CURVE_AD
#define SPP_MISC_REG_DP_GMA_CURVE_AD_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AD_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AD_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_AD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AD_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_AD_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_AD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AD_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_RESERVEA                            SPP_MISC_REG_DP_GMA_CURVE_RESERVEA
#define SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_RESERVEA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_AF                            SPP_MISC_REG_DP_GMA_CURVE_AF
#define SPP_MISC_REG_DP_GMA_CURVE_AF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_AF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_AF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_AF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_AF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_AF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_AF_POS))

