bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x2B0 : disp_gma_curve_b0 */
#define SPP_MISC_DISP_GMA_CURVE_B0_OFFSET                       (0x2B0)
#define SPP_MISC_REG_DP_GMA_CURVE_B0                            SPP_MISC_REG_DP_GMA_CURVE_B0
#define SPP_MISC_REG_DP_GMA_CURVE_B0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_B0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B1                            SPP_MISC_REG_DP_GMA_CURVE_B1
#define SPP_MISC_REG_DP_GMA_CURVE_B1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B2                            SPP_MISC_REG_DP_GMA_CURVE_B2
#define SPP_MISC_REG_DP_GMA_CURVE_B2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_B2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B3                            SPP_MISC_REG_DP_GMA_CURVE_B3
#define SPP_MISC_REG_DP_GMA_CURVE_B3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_B3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B3_POS))

/* 0x2B4 : disp_gma_curve_b4 */
#define SPP_MISC_DISP_GMA_CURVE_B4_OFFSET                       (0x2B4)
#define SPP_MISC_REG_DP_GMA_CURVE_B4                            SPP_MISC_REG_DP_GMA_CURVE_B4
#define SPP_MISC_REG_DP_GMA_CURVE_B4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_B4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B5                            SPP_MISC_REG_DP_GMA_CURVE_B5
#define SPP_MISC_REG_DP_GMA_CURVE_B5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B6                            SPP_MISC_REG_DP_GMA_CURVE_B6
#define SPP_MISC_REG_DP_GMA_CURVE_B6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_B6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B7                            SPP_MISC_REG_DP_GMA_CURVE_B7
#define SPP_MISC_REG_DP_GMA_CURVE_B7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_B7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B7_POS))

/* 0x2B8 : disp_gma_curve_b8 */
#define SPP_MISC_DISP_GMA_CURVE_B8_OFFSET                       (0x2B8)
#define SPP_MISC_REG_DP_GMA_CURVE_B8                            SPP_MISC_REG_DP_GMA_CURVE_B8
#define SPP_MISC_REG_DP_GMA_CURVE_B8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_B8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_B9                            SPP_MISC_REG_DP_GMA_CURVE_B9
#define SPP_MISC_REG_DP_GMA_CURVE_B9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_B9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_B9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_B9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_B9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_B9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_BA                            SPP_MISC_REG_DP_GMA_CURVE_BA
#define SPP_MISC_REG_DP_GMA_CURVE_BA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_BA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_BB                            SPP_MISC_REG_DP_GMA_CURVE_BB
#define SPP_MISC_REG_DP_GMA_CURVE_BB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_BB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BB_POS))

/* 0x2BC : disp_gma_curve_bc */
#define SPP_MISC_DISP_GMA_CURVE_BC_OFFSET                       (0x2BC)
#define SPP_MISC_REG_DP_GMA_CURVE_BC                            SPP_MISC_REG_DP_GMA_CURVE_BC
#define SPP_MISC_REG_DP_GMA_CURVE_BC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_BC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_BD                            SPP_MISC_REG_DP_GMA_CURVE_BD
#define SPP_MISC_REG_DP_GMA_CURVE_BD_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BD_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BD_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BD_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BD_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BD_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_BE                            SPP_MISC_REG_DP_GMA_CURVE_BE
#define SPP_MISC_REG_DP_GMA_CURVE_BE_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_BE_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BE_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BE_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BE_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BE_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_BF                            SPP_MISC_REG_DP_GMA_CURVE_BF
#define SPP_MISC_REG_DP_GMA_CURVE_BF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_BF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_BF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_BF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_BF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_BF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_BF_POS))

/* 0x2C0 : disp_gma_curve_c0 */
#define SPP_MISC_DISP_GMA_CURVE_C0_OFFSET                       (0x2C0)
#define SPP_MISC_REG_DP_GMA_CURVE_C0                            SPP_MISC_REG_DP_GMA_CURVE_C0
#define SPP_MISC_REG_DP_GMA_CURVE_C0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_C0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C1                            SPP_MISC_REG_DP_GMA_CURVE_C1
#define SPP_MISC_REG_DP_GMA_CURVE_C1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C2                            SPP_MISC_REG_DP_GMA_CURVE_C2
#define SPP_MISC_REG_DP_GMA_CURVE_C2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_C2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C3                            SPP_MISC_REG_DP_GMA_CURVE_C3
#define SPP_MISC_REG_DP_GMA_CURVE_C3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_C3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C3_POS))

/* 0x2C4 : disp_gma_curve_c4 */
#define SPP_MISC_DISP_GMA_CURVE_C4_OFFSET                       (0x2C4)
#define SPP_MISC_REG_DP_GMA_CURVE_C4                            SPP_MISC_REG_DP_GMA_CURVE_C4
#define SPP_MISC_REG_DP_GMA_CURVE_C4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_C4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C5                            SPP_MISC_REG_DP_GMA_CURVE_C5
#define SPP_MISC_REG_DP_GMA_CURVE_C5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C6                            SPP_MISC_REG_DP_GMA_CURVE_C6
#define SPP_MISC_REG_DP_GMA_CURVE_C6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_C6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C7                            SPP_MISC_REG_DP_GMA_CURVE_C7
#define SPP_MISC_REG_DP_GMA_CURVE_C7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_C7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C7_POS))

/* 0x2C8 : disp_gma_curve_c8 */
#define SPP_MISC_DISP_GMA_CURVE_C8_OFFSET                       (0x2C8)
#define SPP_MISC_REG_DP_GMA_CURVE_C8                            SPP_MISC_REG_DP_GMA_CURVE_C8
#define SPP_MISC_REG_DP_GMA_CURVE_C8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_C8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_C9                            SPP_MISC_REG_DP_GMA_CURVE_C9
#define SPP_MISC_REG_DP_GMA_CURVE_C9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_C9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_C9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_C9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_C9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_C9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_CA                            SPP_MISC_REG_DP_GMA_CURVE_CA
#define SPP_MISC_REG_DP_GMA_CURVE_CA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_CA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_CB                            SPP_MISC_REG_DP_GMA_CURVE_CB
#define SPP_MISC_REG_DP_GMA_CURVE_CB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_CB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CB_POS))

