bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x2CC : disp_gma_curve_cc */
#define SPP_MISC_DISP_GMA_CURVE_CC_OFFSET                       (0x2CC)
#define SPP_MISC_REG_DP_GMA_CURVE_CC                            SPP_MISC_REG_DP_GMA_CURVE_CC
#define SPP_MISC_REG_DP_GMA_CURVE_CC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_CC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_CD                            SPP_MISC_REG_DP_GMA_CURVE_CD
#define SPP_MISC_REG_DP_GMA_CURVE_CD_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CD_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CD_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CD_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CD_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CD_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_CE                            SPP_MISC_REG_DP_GMA_CURVE_CE
#define SPP_MISC_REG_DP_GMA_CURVE_CE_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_CE_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CE_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CE_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CE_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CE_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_CF                            SPP_MISC_REG_DP_GMA_CURVE_CF
#define SPP_MISC_REG_DP_GMA_CURVE_CF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_CF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_CF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_CF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_CF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_CF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_CF_POS))

/* 0x2D0 : disp_gma_curve_d0 */
#define SPP_MISC_DISP_GMA_CURVE_D0_OFFSET                       (0x2D0)
#define SPP_MISC_REG_DP_GMA_CURVE_D0                            SPP_MISC_REG_DP_GMA_CURVE_D0
#define SPP_MISC_REG_DP_GMA_CURVE_D0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_D0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D1                            SPP_MISC_REG_DP_GMA_CURVE_D1
#define SPP_MISC_REG_DP_GMA_CURVE_D1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D2                            SPP_MISC_REG_DP_GMA_CURVE_D2
#define SPP_MISC_REG_DP_GMA_CURVE_D2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_D2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D3                            SPP_MISC_REG_DP_GMA_CURVE_D3
#define SPP_MISC_REG_DP_GMA_CURVE_D3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_D3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D3_POS))

/* 0x2D4 : disp_gma_curve_d4 */
#define SPP_MISC_DISP_GMA_CURVE_D4_OFFSET                       (0x2D4)
#define SPP_MISC_REG_DP_GMA_CURVE_D4                            SPP_MISC_REG_DP_GMA_CURVE_D4
#define SPP_MISC_REG_DP_GMA_CURVE_D4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_D4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D5                            SPP_MISC_REG_DP_GMA_CURVE_D5
#define SPP_MISC_REG_DP_GMA_CURVE_D5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D6                            SPP_MISC_REG_DP_GMA_CURVE_D6
#define SPP_MISC_REG_DP_GMA_CURVE_D6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_D6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D7                            SPP_MISC_REG_DP_GMA_CURVE_D7
#define SPP_MISC_REG_DP_GMA_CURVE_D7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_D7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D7_POS))

/* 0x2D8 : disp_gma_curve_d8 */
#define SPP_MISC_DISP_GMA_CURVE_D8_OFFSET                       (0x2D8)
#define SPP_MISC_REG_DP_GMA_CURVE_D8                            SPP_MISC_REG_DP_GMA_CURVE_D8
#define SPP_MISC_REG_DP_GMA_CURVE_D8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_D8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_D9                            SPP_MISC_REG_DP_GMA_CURVE_D9
#define SPP_MISC_REG_DP_GMA_CURVE_D9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_D9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_D9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_D9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_D9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_D9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_DA                            SPP_MISC_REG_DP_GMA_CURVE_DA
#define SPP_MISC_REG_DP_GMA_CURVE_DA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_DA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_DB                            SPP_MISC_REG_DP_GMA_CURVE_DB
#define SPP_MISC_REG_DP_GMA_CURVE_DB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_DB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DB_POS))

