bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
/* 0x2DC : disp_gma_curve_dc */
#define SPP_MISC_DISP_GMA_CURVE_DC_OFFSET                       (0x2DC)
#define SPP_MISC_REG_DP_GMA_CURVE_DC                            SPP_MISC_REG_DP_GMA_CURVE_DC
#define SPP_MISC_REG_DP_GMA_CURVE_DC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_DC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_DD                            SPP_MISC_REG_DP_GMA_CURVE_DD
#define SPP_MISC_REG_DP_GMA_CURVE_DD_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DD_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DD_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DD_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DD_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DD_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_DE                            SPP_MISC_REG_DP_GMA_CURVE_DE
#define SPP_MISC_REG_DP_GMA_CURVE_DE_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_DE_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DE_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DE_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DE_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DE_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_DF                            SPP_MISC_REG_DP_GMA_CURVE_DF
#define SPP_MISC_REG_DP_GMA_CURVE_DF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_DF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_DF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_DF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_DF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_DF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_DF_POS))

/* 0x2E0 : disp_gma_curve_e0 */
#define SPP_MISC_DISP_GMA_CURVE_E0_OFFSET                       (0x2E0)
#define SPP_MISC_REG_DP_GMA_CURVE_E0                            SPP_MISC_REG_DP_GMA_CURVE_E0
#define SPP_MISC_REG_DP_GMA_CURVE_E0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_E0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E1                            SPP_MISC_REG_DP_GMA_CURVE_E1
#define SPP_MISC_REG_DP_GMA_CURVE_E1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E2                            SPP_MISC_REG_DP_GMA_CURVE_E2
#define SPP_MISC_REG_DP_GMA_CURVE_E2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_E2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E3                            SPP_MISC_REG_DP_GMA_CURVE_E3
#define SPP_MISC_REG_DP_GMA_CURVE_E3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_E3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E3_POS))

/* 0x2E4 : disp_gma_curve_e4 */
#define SPP_MISC_DISP_GMA_CURVE_E4_OFFSET                       (0x2E4)
#define SPP_MISC_REG_DP_GMA_CURVE_E4                            SPP_MISC_REG_DP_GMA_CURVE_E4
#define SPP_MISC_REG_DP_GMA_CURVE_E4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_E4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E5                            SPP_MISC_REG_DP_GMA_CURVE_E5
#define SPP_MISC_REG_DP_GMA_CURVE_E5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E6                            SPP_MISC_REG_DP_GMA_CURVE_E6
#define SPP_MISC_REG_DP_GMA_CURVE_E6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_E6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E7                            SPP_MISC_REG_DP_GMA_CURVE_E7
#define SPP_MISC_REG_DP_GMA_CURVE_E7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_E7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E7_POS))

/* 0x2E8 : disp_gma_curve_e8 */
#define SPP_MISC_DISP_GMA_CURVE_E8_OFFSET                       (0x2E8)
#define SPP_MISC_REG_DP_GMA_CURVE_E8                            SPP_MISC_REG_DP_GMA_CURVE_E8
#define SPP_MISC_REG_DP_GMA_CURVE_E8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_E8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_E9                            SPP_MISC_REG_DP_GMA_CURVE_E9
#define SPP_MISC_REG_DP_GMA_CURVE_E9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_E9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_E9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_E9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_E9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_E9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_EA                            SPP_MISC_REG_DP_GMA_CURVE_EA
#define SPP_MISC_REG_DP_GMA_CURVE_EA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_EA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_EA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_EA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_EA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_EA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_EB                            SPP_MISC_REG_DP_GMA_CURVE_EB
#define SPP_MISC_REG_DP_GMA_CURVE_EB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_EB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_EB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_EB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_EB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_EB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EB_POS))

/* 0x2EC : disp_gma_curve_ec */
#define SPP_MISC_DISP_GMA_CURVE_EC_OFFSET                       (0x2EC)
#define SPP_MISC_REG_DP_GMA_CURVE_EC                            SPP_MISC_REG_DP_GMA_CURVE_EC
#define SPP_MISC_REG_DP_GMA_CURVE_EC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_EC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_EC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_EC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_EC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_EC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_ED                            SPP_MISC_REG_DP_GMA_CURVE_ED
#define SPP_MISC_REG_DP_GMA_CURVE_ED_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_ED_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_ED_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_ED_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_ED_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_ED_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_ED_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_ED_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_EE                            SPP_MISC_REG_DP_GMA_CURVE_EE
#define SPP_MISC_REG_DP_GMA_CURVE_EE_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_EE_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_EE_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_EE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EE_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_EE_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_EE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EE_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_EF                            SPP_MISC_REG_DP_GMA_CURVE_EF
#define SPP_MISC_REG_DP_GMA_CURVE_EF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_EF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_EF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_EF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_EF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_EF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_EF_POS))

/* 0x2F0 : disp_gma_curve_f0 */
#define SPP_MISC_DISP_GMA_CURVE_F0_OFFSET                       (0x2F0)
#define SPP_MISC_REG_DP_GMA_CURVE_F0                            SPP_MISC_REG_DP_GMA_CURVE_F0
#define SPP_MISC_REG_DP_GMA_CURVE_F0_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_F0_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F0_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F0_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F0_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F0_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F0_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F1                            SPP_MISC_REG_DP_GMA_CURVE_F1
#define SPP_MISC_REG_DP_GMA_CURVE_F1_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F1_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F1_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F1_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F1_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F1_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F1_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F2                            SPP_MISC_REG_DP_GMA_CURVE_F2
#define SPP_MISC_REG_DP_GMA_CURVE_F2_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_F2_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F2_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F2_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F2_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F2_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F2_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F3                            SPP_MISC_REG_DP_GMA_CURVE_F3
#define SPP_MISC_REG_DP_GMA_CURVE_F3_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_F3_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F3_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F3_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F3_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F3_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F3_POS))

/* 0x2F4 : disp_gma_curve_f4 */
#define SPP_MISC_DISP_GMA_CURVE_F4_OFFSET                       (0x2F4)
#define SPP_MISC_REG_DP_GMA_CURVE_F4                            SPP_MISC_REG_DP_GMA_CURVE_F4
#define SPP_MISC_REG_DP_GMA_CURVE_F4_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_F4_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F4_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F4_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F4_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F4_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F4_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F5                            SPP_MISC_REG_DP_GMA_CURVE_F5
#define SPP_MISC_REG_DP_GMA_CURVE_F5_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F5_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F5_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F5_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F5_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F5_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F5_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F6                            SPP_MISC_REG_DP_GMA_CURVE_F6
#define SPP_MISC_REG_DP_GMA_CURVE_F6_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_F6_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F6_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F6_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F6_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F6_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F6_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F7                            SPP_MISC_REG_DP_GMA_CURVE_F7
#define SPP_MISC_REG_DP_GMA_CURVE_F7_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_F7_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F7_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F7_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F7_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F7_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F7_POS))

/* 0x2F8 : disp_gma_curve_f8 */
#define SPP_MISC_DISP_GMA_CURVE_F8_OFFSET                       (0x2F8)
#define SPP_MISC_REG_DP_GMA_CURVE_F8                            SPP_MISC_REG_DP_GMA_CURVE_F8
#define SPP_MISC_REG_DP_GMA_CURVE_F8_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_F8_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F8_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F8_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F8_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F8_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F8_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_F9                            SPP_MISC_REG_DP_GMA_CURVE_F9
#define SPP_MISC_REG_DP_GMA_CURVE_F9_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F9_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_F9_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_F9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F9_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_F9_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_F9_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_F9_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_FA                            SPP_MISC_REG_DP_GMA_CURVE_FA
#define SPP_MISC_REG_DP_GMA_CURVE_FA_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_FA_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FA_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FA_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FA_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FA_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FA_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_FB                            SPP_MISC_REG_DP_GMA_CURVE_FB
#define SPP_MISC_REG_DP_GMA_CURVE_FB_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_FB_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FB_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FB_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FB_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FB_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FB_POS))

/* 0x2FC : disp_gma_curve_fc */
#define SPP_MISC_DISP_GMA_CURVE_FC_OFFSET                       (0x2FC)
#define SPP_MISC_REG_DP_GMA_CURVE_FC                            SPP_MISC_REG_DP_GMA_CURVE_FC
#define SPP_MISC_REG_DP_GMA_CURVE_FC_POS                        (0U)
#define SPP_MISC_REG_DP_GMA_CURVE_FC_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FC_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FC_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FC_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FC_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FC_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_FD                            SPP_MISC_REG_DP_GMA_CURVE_FD
#define SPP_MISC_REG_DP_GMA_CURVE_FD_POS                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FD_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FD_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FD_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FD_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FD_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FD_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_FE                            SPP_MISC_REG_DP_GMA_CURVE_FE
#define SPP_MISC_REG_DP_GMA_CURVE_FE_POS                        (16U)
#define SPP_MISC_REG_DP_GMA_CURVE_FE_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FE_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FE_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FE_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FE_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FE_POS))
#define SPP_MISC_REG_DP_GMA_CURVE_FF                            SPP_MISC_REG_DP_GMA_CURVE_FF
#define SPP_MISC_REG_DP_GMA_CURVE_FF_POS                        (24U)
#define SPP_MISC_REG_DP_GMA_CURVE_FF_LEN                        (8U)
#define SPP_MISC_REG_DP_GMA_CURVE_FF_MSK                        (((1U<<SPP_MISC_REG_DP_GMA_CURVE_FF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FF_POS)
#define SPP_MISC_REG_DP_GMA_CURVE_FF_UMSK                       (~(((1U<<SPP_MISC_REG_DP_GMA_CURVE_FF_LEN)-1)<<SPP_MISC_REG_DP_GMA_CURVE_FF_POS))


