bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
struct  isp_misc_reg {
    /* 0x0 : config */
    union {
        struct {
            uint32_t rg_dvpas_enable                :  1; /* [    0],        r/w,        0x0 */
            uint32_t rg_dvpas_hs_inv                :  1; /* [    1],        r/w,        0x0 */
            uint32_t rg_dvpas_vs_inv                :  1; /* [    2],        r/w,        0x0 */
            uint32_t rg_dvpas_da_order              :  1; /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15                  : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t rg_dvpas_fifo_th               : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_29                 :  3; /* [29:27],       rsvd,        0x0 */
            uint32_t cr_isp_de_as_hsync             :  1; /* [   30],        r/w,        0x0 */
            uint32_t reg_isp_pclk_force_on          :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } config;

    /* 0x4 : pix_data_ctrl */
    union {
        struct {
            uint32_t reg_pix_data_ctrl              : 12; /* [11: 0],        r/w,      0xfff */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_pix_data_sht_bit           :  4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_pix_data_sht_dir           :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_30                 : 10; /* [30:21],       rsvd,        0x0 */
            uint32_t reg_isp_dtsrc_src              :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } pix_data_ctrl;

    /* 0x8 : dvp2bus_src_sel_1 */
    union {
        struct {
            uint32_t rg_d2b_dvp_sel_a               :  6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6                     :  1; /* [    6],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_a                :  1; /* [    7],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_b               :  6; /* [13: 8],        r/w,        0x0 */
            uint32_t reserved_14                    :  1; /* [   14],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_b                :  1; /* [   15],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_c               :  6; /* [21:16],        r/w,        0x0 */
            uint32_t reserved_22                    :  1; /* [   22],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_c                :  1; /* [   23],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_d               :  6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30                    :  1; /* [   30],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_d                :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp2bus_src_sel_1;

    /* 0xC : dvp_frame_m_to_n */
    union {
        struct {
            uint32_t cr_frame_m_to_n_en             :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t cr_frame_interval              :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t cr_frame_cnt_n                 :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t cr_frame_cnt_m                 :  4; /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp_frame_m_to_n;

    /* 0x10 : isp_id_bayer */
    union {
        struct {
            uint32_t reg_bayer_idgen_rst            :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_bayer_idgen_edge           :  1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_15                  : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t reg_bayer_idgen_cnt_incr       : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } isp_id_bayer;

    /* 0x14 : dvp2bus_src_sel_2 */
    union {
        struct {
            uint32_t rg_d2b_dvp_sel_e               :  6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6                     :  1; /* [    6],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_e                :  1; /* [    7],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_f               :  6; /* [13: 8],        r/w,        0x0 */
            uint32_t reserved_14                    :  1; /* [   14],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_f                :  1; /* [   15],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_g               :  6; /* [21:16],        r/w,        0x0 */
            uint32_t reserved_22                    :  1; /* [   22],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_g                :  1; /* [   23],        r/w,        0x0 */
            uint32_t rg_d2b_dvp_sel_h               :  6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30                    :  1; /* [   30],       rsvd,        0x0 */
            uint32_t rg_d2x_id_sel_h                :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp2bus_src_sel_2;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[8];

    /* 0x20 : int_clr */
    union {
        struct {
            uint32_t rg_reserveb_int_clr            :  1; /* [    0],        w1p,        0x0 */
            uint32_t rg_reservea_int_clr            :  1; /* [    1],        w1p,        0x0 */
            uint32_t rg_reservew_int_clr            :  1; /* [    2],        w1p,        0x0 */
            uint32_t rg_reserveb2_int_clr           :  1; /* [    3],        w1p,        0x0 */
            uint32_t rg_osd_pb_int_clr              :  1; /* [    4],        w1p,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rg_seof1_int_clr               :  1; /* [    8],        w1p,        0x0 */
            uint32_t rg_seof2_int_clr               :  1; /* [    9],        w1p,        0x0 */
            uint32_t rg_seof3_int_clr               :  1; /* [   10],        w1p,        0x0 */
            uint32_t rg_reservea_hist_int_clr       :  1; /* [   11],        w1p,        0x0 */
            uint32_t rg_reserveb3_int_clr           :  1; /* [   12],        w1p,        0x0 */
            uint32_t rg_dp_seof0_int_clr            :  1; /* [   13],        w1p,        0x0 */
            uint32_t rg_seof4_int_clr               :  1; /* [   14],        w1p,        0x0 */
            uint32_t reserved_15_31                 : 17; /* [31:15],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } int_clr;

    /* 0x24 : int_ctrl */
    union {
        struct {
            uint32_t rg_reservea_int_mask           :  1; /* [    0],        r/w,        0x0 */
            uint32_t rg_reserveb_int_mask           :  1; /* [    1],        r/w,        0x0 */
            uint32_t rg_reservew_int_mask           :  1; /* [    2],        r/w,        0x0 */
            uint32_t rg_reserveb2_int_mask          :  1; /* [    3],        r/w,        0x0 */
            uint32_t rg_osd_pb_int_mask             :  1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rg_seof1_int_mask              :  1; /* [    8],        r/w,        0x0 */
            uint32_t rg_seof1_int_edge              :  1; /* [    9],        r/w,        0x0 */
            uint32_t rg_seof1_int_src               :  2; /* [11:10],        r/w,        0x2 */
            uint32_t rg_seof2_int_mask              :  1; /* [   12],        r/w,        0x0 */
            uint32_t rg_seof2_int_edge              :  1; /* [   13],        r/w,        0x0 */
            uint32_t rg_seof2_int_src               :  2; /* [15:14],        r/w,        0x2 */
            uint32_t rg_seof3_int_mask              :  1; /* [   16],        r/w,        0x0 */
            uint32_t rg_seof3_int_edge              :  1; /* [   17],        r/w,        0x0 */
            uint32_t rg_seof3_int_src               :  2; /* [19:18],        r/w,        0x2 */
            uint32_t rg_reservea_hist_int_mask      :  1; /* [   20],        r/w,        0x0 */
            uint32_t rg_reserveb3_int_mask          :  1; /* [   21],        r/w,        0x0 */
            uint32_t rg_dp_seof0_int_src            :  1; /* [   22],        r/w,        0x0 */
            uint32_t rg_dp_seof0_int_edge           :  1; /* [   23],        r/w,        0x0 */
            uint32_t rg_dp_seof0_int_mask           :  1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27                 :  3; /* [27:25],       rsvd,        0x0 */
            uint32_t rg_seof4_int_mask              :  1; /* [   28],        r/w,        0x0 */
            uint32_t rg_seof4_int_edge              :  1; /* [   29],        r/w,        0x0 */
            uint32_t rg_seof4_int_src               :  2; /* [31:30],        r/w,        0x2 */
        }BF;
        uint32_t WORD;
    } int_ctrl;

    /* 0x28 : isp_id_yuv */
    union {
        struct {
            uint32_t reg_yuv_idgen_rst              :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_yuv_idgen_edge             :  1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_15                  : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t reg_yuv_idgen_cnt_incr         : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } isp_id_yuv;

    /* 0x2C : dvp_reshape */
    union {
        struct {
            uint32_t reg_rshp_tgl_count             :  5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reg_rshp_hsync_inv             :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_rshp_vsync_inv             :  1; /* [    6],        r/w,        0x0 */
            uint32_t reg_rshp_clr                   :  1; /* [    7],        w1p,        0x0 */
            uint32_t reg_rshp_en                    :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } dvp_reshape;

