bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
    /* 0x30  reserved */
    uint8_t RESERVED0x30[16];

    /* 0x40 : scalerA_i_size */
    union {
        struct {
            uint32_t rg_scalerA_i_w                 : 11; /* [10: 0],        r/w,      0x780 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerA_i_h                 : 11; /* [26:16],        r/w,      0x438 */
            uint32_t rg_sclrA_sw_sh                 :  1; /* [   27],        w1p,        0x0 */
            uint32_t rg_scalerA_bypass              :  1; /* [   28],        r/w,        0x1 */
            uint32_t rg_scalerA_sel                 :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerA_i_size;

    /* 0x44 : scalerA_o_size */
    union {
        struct {
            uint32_t rg_scalerA_o_w                 : 11; /* [10: 0],        r/w,      0x500 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerA_o_h                 : 11; /* [26:16],        r/w,      0x2d0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerA_o_size;

    /* 0x48 : scalerB_i_size */
    union {
        struct {
            uint32_t rg_scalerB_i_w                 : 11; /* [10: 0],        r/w,      0x780 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerB_i_h                 : 11; /* [26:16],        r/w,      0x438 */
            uint32_t rg_sclrB_sw_sh                 :  1; /* [   27],        w1p,        0x0 */
            uint32_t rg_scalerB_bypass              :  1; /* [   28],        r/w,        0x1 */
            uint32_t rg_scalerB_sel                 :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerB_i_size;

    /* 0x4C : scalerB_o_size */
    union {
        struct {
            uint32_t rg_scalerB_o_w                 : 11; /* [10: 0],        r/w,      0x500 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerB_o_h                 : 11; /* [26:16],        r/w,      0x2d0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerB_o_size;

    /* 0x50 : scalerC_i_size */
    union {
        struct {
            uint32_t rg_scalerC_i_w                 : 11; /* [10: 0],        r/w,      0x780 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerC_i_h                 : 11; /* [26:16],        r/w,      0x438 */
            uint32_t rg_sclrC_sw_sh                 :  1; /* [   27],        w1p,        0x0 */
            uint32_t rg_scalerC_bypass              :  1; /* [   28],        r/w,        0x1 */
            uint32_t rg_scalerC_sel                 :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerC_i_size;

    /* 0x54 : scalerC_o_size */
    union {
        struct {
            uint32_t rg_scalerC_o_w                 : 11; /* [10: 0],        r/w,      0x500 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerC_o_h                 : 11; /* [26:16],        r/w,      0x2d0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerC_o_size;

    /* 0x58 : scalerD_i_size */
    union {
        struct {
            uint32_t rg_scalerD_i_w                 : 11; /* [10: 0],        r/w,      0x780 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerD_i_h                 : 11; /* [26:16],        r/w,      0x438 */
            uint32_t rg_sclrD_sw_sh                 :  1; /* [   27],        w1p,        0x0 */
            uint32_t rg_scalerD_bypass              :  1; /* [   28],        r/w,        0x1 */
            uint32_t rg_scalerD_sel                 :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerD_i_size;

    /* 0x5C : scalerD_o_size */
    union {
        struct {
            uint32_t rg_scalerD_o_w                 : 11; /* [10: 0],        r/w,      0x500 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t rg_scalerD_o_h                 : 11; /* [26:16],        r/w,      0x2d0 */
            uint32_t reserved_27_31                 :  5; /* [31:27],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } scalerD_o_size;

    /* 0x60 : disp_config */
    union {
        struct {
            uint32_t reserved_0_3                   :  4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t rg_disp_bt656_en               :  1; /* [    4],        r/w,        0x0 */
            uint32_t rg_disp_bt1120_en              :  1; /* [    5],        r/w,        0x0 */
            uint32_t rg_disp_dpi_en                 :  1; /* [    6],        r/w,        0x0 */
            uint32_t rg_disp_hdmi_en                :  1; /* [    7],        r/w,        0x0 */
            uint32_t rg_disp_mux_sel                :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t rg_osdDP_sel                   :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_30                 : 17; /* [30:14],       rsvd,        0x0 */
            uint32_t rg_disp_clko_inv               :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_config;

    /* 0x64 : disp_dpi_config */
    union {
        struct {
            uint32_t rg_disp_dpi_hs_w               :  8; /* [ 7: 0],        r/w,        0x8 */
            uint32_t rg_disp_dpi_hfp_w              :  8; /* [15: 8],        r/w,       0x10 */
            uint32_t rg_disp_dpi_vs_w               :  8; /* [23:16],        r/w,        0x2 */
            uint32_t rg_disp_dpi_vfp_w              :  8; /* [31:24],        r/w,        0x4 */
        }BF;
        uint32_t WORD;
    } disp_dpi_config;

    /* 0x68 : disp_yuv_rgb_config_0 */
    union {
        struct {
            uint32_t rg_disp_y2r_pre_0              :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9                     :  1; /* [    9],       rsvd,        0x0 */
            uint32_t rg_disp_y2r_pre_1              :  9; /* [18:10],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t rg_disp_y2r_pre_2              :  9; /* [28:20],        r/w,        0x0 */
            uint32_t reserved_29_30                 :  2; /* [30:29],       rsvd,        0x0 */
            uint32_t rg_disp_y2r_en                 :  1; /* [   31],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_0;

