bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
    /* 0x6C : disp_yuv_rgb_config_1 */
    union {
        struct {
            uint32_t rg_disp_y2r_pos_0              :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9                     :  1; /* [    9],       rsvd,        0x0 */
            uint32_t rg_disp_y2r_pos_1              :  9; /* [18:10],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t rg_disp_y2r_pos_2              :  9; /* [28:20],        r/w,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_1;

    /* 0x70 : disp_yuv_rgb_config_2 */
    union {
        struct {
            uint32_t rg_disp_y2r_mtx_00             : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_01             : 12; /* [23:12],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_02_l           :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_2;

    /* 0x74 : disp_yuv_rgb_config_3 */
    union {
        struct {
            uint32_t rg_disp_y2r_mtx_02_u           :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_10             : 12; /* [15: 4],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_11             : 12; /* [27:16],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_12_l           :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_3;

    /* 0x78 : disp_yuv_rgb_config_4 */
    union {
        struct {
            uint32_t rg_disp_y2r_mtx_12_u           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_20             : 12; /* [19: 8],        r/w,        0x0 */
            uint32_t rg_disp_y2r_mtx_21             : 12; /* [31:20],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_4;

    /* 0x7C : disp_yuv_rgb_config_5 */
    union {
        struct {
            uint32_t rg_disp_y2r_mtx_22             : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_yuv_rgb_config_5;

    /* 0x80 : isp_subsys_bus_ctrl */
    union {
        struct {
            uint32_t rg_isp_sub_pclk_force_on       : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t rg_isp_peri_pclk_force_on      : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } isp_subsys_bus_ctrl;

    /* 0x84  reserved */
    uint8_t RESERVED0x84[28];

    /* 0xA0 : osdA_i_ctrl */
    union {
        struct {
            uint32_t rg_osd_pb_sel                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_28                  : 28; /* [28: 1],       rsvd,        0x0 */
            uint32_t rg_osdA_sel                    :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } osdA_i_ctrl;

    /* 0xA4 : osdB_i_ctrl */
    union {
        struct {
            uint32_t reserved_0_28                  : 29; /* [28: 0],       rsvd,        0x0 */
            uint32_t rg_osdB_sel                    :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } osdB_i_ctrl;

    /* 0xA8 : osdC_i_ctrl */
    union {
        struct {
            uint32_t reserved_0_28                  : 29; /* [28: 0],       rsvd,        0x0 */
            uint32_t rg_osdC_sel                    :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } osdC_i_ctrl;

    /* 0xAC : osdD_i_ctrl */
    union {
        struct {
            uint32_t reserved_0_28                  : 29; /* [28: 0],       rsvd,        0x0 */
            uint32_t rg_osdD_sel                    :  3; /* [31:29],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } osdD_i_ctrl;

    /* 0xb0  reserved */
    uint8_t RESERVED0xb0[16];

    /* 0xC0 : isp_subsys_dbg_sel */
    union {
        struct {
            uint32_t reg_isp_sub_dbg_en             :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3                   :  3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_isp_sub_dbg_sel            :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } isp_subsys_dbg_sel;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[56];

    /* 0xFC : SPP_MISC_Dummy */
    union {
        struct {
            uint32_t dummy_reg                      : 32; /* [31: 0],        r/w, 0xffff0000 */
        }BF;
        uint32_t WORD;
    } SPP_MISC_Dummy;

    /* 0x100 : adjA_ctrl_0 */
    union {
        struct {
            uint32_t reg_adjA_adj_eb                :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_adjA_y_luma                :  9; /* [ 9: 1],        r/w,        0x0 */
            uint32_t reg_adjA_y_mul0                : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjA_y_mul1                : 11; /* [31:21],        r/w,      0x35e */
        }BF;
        uint32_t WORD;
    } adjA_ctrl_0;

    /* 0x104 : adjA_ctrl_1 */
    union {
        struct {
            uint32_t reg_adjA_y_min                 :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t reg_adjA_y_max                 :  8; /* [15: 8],        r/w,       0xeb */
            uint32_t reg_adjA_uv_min                :  8; /* [23:16],        r/w,       0x10 */
            uint32_t reg_adjA_uv_max                :  8; /* [31:24],        r/w,       0xf0 */
        }BF;
        uint32_t WORD;
    } adjA_ctrl_1;

    /* 0x108 : adjA_ctrl_2 */
    union {
        struct {
            uint32_t rg_adjA_sel                    :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_9                   :  6; /* [ 9: 4],       rsvd,        0x0 */
            uint32_t reg_adjA_uv_mul0               : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjA_uv_mul1               : 11; /* [31:21],        r/w,      0x387 */
        }BF;
        uint32_t WORD;
    } adjA_ctrl_2;

    /* 0x10c  reserved */
    uint8_t RESERVED0x10c[4];

