bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
    /* 0x110 : adjB_ctrl_0 */
    union {
        struct {
            uint32_t reg_adjB_adj_eb                :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_adjB_y_luma                :  9; /* [ 9: 1],        r/w,        0x0 */
            uint32_t reg_adjB_y_mul0                : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjB_y_mul1                : 11; /* [31:21],        r/w,      0x35e */
        }BF;
        uint32_t WORD;
    } adjB_ctrl_0;

    /* 0x114 : adjB_ctrl_1 */
    union {
        struct {
            uint32_t reg_adjB_y_min                 :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t reg_adjB_y_max                 :  8; /* [15: 8],        r/w,       0xeb */
            uint32_t reg_adjB_uv_min                :  8; /* [23:16],        r/w,       0x10 */
            uint32_t reg_adjB_uv_max                :  8; /* [31:24],        r/w,       0xf0 */
        }BF;
        uint32_t WORD;
    } adjB_ctrl_1;

    /* 0x118 : adjB_ctrl_2 */
    union {
        struct {
            uint32_t rg_adjB_sel                    :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_9                   :  6; /* [ 9: 4],       rsvd,        0x0 */
            uint32_t reg_adjB_uv_mul0               : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjB_uv_mul1               : 11; /* [31:21],        r/w,      0x387 */
        }BF;
        uint32_t WORD;
    } adjB_ctrl_2;

    /* 0x11c  reserved */
    uint8_t RESERVED0x11c[4];

    /* 0x120 : adjC_ctrl_0 */
    union {
        struct {
            uint32_t reg_adjC_adj_eb                :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_adjC_y_luma                :  9; /* [ 9: 1],        r/w,        0x0 */
            uint32_t reg_adjC_y_mul0                : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjC_y_mul1                : 11; /* [31:21],        r/w,      0x35e */
        }BF;
        uint32_t WORD;
    } adjC_ctrl_0;

    /* 0x124 : adjC_ctrl_1 */
    union {
        struct {
            uint32_t reg_adjC_y_min                 :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t reg_adjC_y_max                 :  8; /* [15: 8],        r/w,       0xeb */
            uint32_t reg_adjC_uv_min                :  8; /* [23:16],        r/w,       0x10 */
            uint32_t reg_adjC_uv_max                :  8; /* [31:24],        r/w,       0xf0 */
        }BF;
        uint32_t WORD;
    } adjC_ctrl_1;

    /* 0x128 : adjC_ctrl_2 */
    union {
        struct {
            uint32_t rg_adjC_sel                    :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_9                   :  6; /* [ 9: 4],       rsvd,        0x0 */
            uint32_t reg_adjC_uv_mul0               : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjC_uv_mul1               : 11; /* [31:21],        r/w,      0x387 */
        }BF;
        uint32_t WORD;
    } adjC_ctrl_2;

    /* 0x12c  reserved */
    uint8_t RESERVED0x12c[4];

    /* 0x130 : adjD_ctrl_0 */
    union {
        struct {
            uint32_t reg_adjD_adj_eb                :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_adjD_y_luma                :  9; /* [ 9: 1],        r/w,        0x0 */
            uint32_t reg_adjD_y_mul0                : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjD_y_mul1                : 11; /* [31:21],        r/w,      0x35e */
        }BF;
        uint32_t WORD;
    } adjD_ctrl_0;

    /* 0x134 : adjD_ctrl_1 */
    union {
        struct {
            uint32_t reg_adjD_y_min                 :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t reg_adjD_y_max                 :  8; /* [15: 8],        r/w,       0xeb */
            uint32_t reg_adjD_uv_min                :  8; /* [23:16],        r/w,       0x10 */
            uint32_t reg_adjD_uv_max                :  8; /* [31:24],        r/w,       0xf0 */
        }BF;
        uint32_t WORD;
    } adjD_ctrl_1;

    /* 0x138 : adjD_ctrl_2 */
    union {
        struct {
            uint32_t rg_adjD_sel                    :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_9                   :  6; /* [ 9: 4],       rsvd,        0x0 */
            uint32_t reg_adjD_uv_mul0               : 11; /* [20:10],        r/w,      0x380 */
            uint32_t reg_adjD_uv_mul1               : 11; /* [31:21],        r/w,      0x387 */
        }BF;
        uint32_t WORD;
    } adjD_ctrl_2;

    /* 0x13c  reserved */
    uint8_t RESERVED0x13c[36];

    /* 0x160 : y2rA_config_0 */
    union {
        struct {
            uint32_t rg_y2rA_pre_0                  :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],       rsvd,        0x0 */
            uint32_t rg_y2rA_pos_0                  :  9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_26                 :  2; /* [26:25],       rsvd,        0x0 */
            uint32_t rg_y2rA_en                     :  1; /* [   27],        r/w,        0x0 */
            uint32_t rg_y2rA_sel                    :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_0;

    /* 0x164 : y2rA_config_1 */
    union {
        struct {
            uint32_t rg_y2rA_pre_1                  :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],       rsvd,        0x0 */
            uint32_t rg_y2rA_pos_1                  :  9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_1;

    /* 0x168 : y2rA_config_2 */
    union {
        struct {
            uint32_t rg_y2rA_pre_2                  :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],       rsvd,        0x0 */
            uint32_t rg_y2rA_pos_2                  :  9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_2;

    /* 0x16C : y2rA_config_3 */
    union {
        struct {
            uint32_t rg_y2rA_mtx_00                 : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t rg_y2rA_mtx_01                 : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_3;

