bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
    /* 0x170 : y2rA_config_4 */
    union {
        struct {
            uint32_t rg_y2rA_mtx_02                 : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t rg_y2rA_mtx_10                 : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_4;

    /* 0x174 : y2rA_config_5 */
    union {
        struct {
            uint32_t rg_y2rA_mtx_11                 : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t rg_y2rA_mtx_12                 : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_5;

    /* 0x178 : y2rA_config_6 */
    union {
        struct {
            uint32_t rg_y2rA_mtx_20                 : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t rg_y2rA_mtx_21                 : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_6;

    /* 0x17C : y2rA_config_7 */
    union {
        struct {
            uint32_t rg_y2rA_mtx_22                 : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } y2rA_config_7;

    /* 0x180 : disp_rgb2yuv_config_0 */
    union {
        struct {
            uint32_t rg_disp_r2y_pre_0              :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9                     :  1; /* [    9],       rsvd,        0x0 */
            uint32_t rg_disp_r2y_pre_1              :  9; /* [18:10],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t rg_disp_r2y_pre_2              :  9; /* [28:20],        r/w,        0x0 */
            uint32_t reserved_29_30                 :  2; /* [30:29],       rsvd,        0x0 */
            uint32_t rg_disp_r2y_en                 :  1; /* [   31],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_0;

    /* 0x184 : disp_rgb2yuv_config_1 */
    union {
        struct {
            uint32_t rg_disp_r2y_pos_0              :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9                     :  1; /* [    9],       rsvd,        0x0 */
            uint32_t rg_disp_r2y_pos_1              :  9; /* [18:10],        r/w,       0x80 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t rg_disp_r2y_pos_2              :  9; /* [28:20],        r/w,       0x80 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_1;

    /* 0x188 : disp_rgb2yuv_config_2 */
    union {
        struct {
            uint32_t rg_disp_r2y_mtx_00             : 12; /* [11: 0],        r/w,       0x99 */
            uint32_t rg_disp_r2y_mtx_01             : 12; /* [23:12],        r/w,      0x12d */
            uint32_t rg_disp_r2y_mtx_02_l           :  8; /* [31:24],        r/w,       0x3a */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_2;

    /* 0x18C : disp_rgb2yuv_config_3 */
    union {
        struct {
            uint32_t rg_disp_r2y_mtx_02_u           :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t rg_disp_r2y_mtx_10             : 12; /* [15: 4],        r/w,      0xfa9 */
            uint32_t rg_disp_r2y_mtx_11             : 12; /* [27:16],        r/w,      0xf57 */
            uint32_t rg_disp_r2y_mtx_12_l           :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_3;

    /* 0x190 : disp_rgb2yuv_config_4 */
    union {
        struct {
            uint32_t rg_disp_r2y_mtx_12_u           :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t rg_disp_r2y_mtx_20             : 12; /* [19: 8],        r/w,      0x100 */
            uint32_t rg_disp_r2y_mtx_21             : 12; /* [31:20],        r/w,      0xf29 */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_4;

    /* 0x194 : disp_rgb2yuv_config_5 */
    union {
        struct {
            uint32_t rg_disp_r2y_mtx_22             : 12; /* [11: 0],        r/w,      0xfd7 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_rgb2yuv_config_5;

    /* 0x198  reserved */
    uint8_t RESERVED0x198[40];

    /* 0x1C0 : cropA_hsync */
    union {
        struct {
            uint32_t reg_cropA_hsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropA_hsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropA_hsync;

    /* 0x1C4 : cropA_vsync */
    union {
        struct {
            uint32_t reg_cropA_vsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropA_vsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropA_vsync;

    /* 0x1C8 : cropB_hsync */
    union {
        struct {
            uint32_t reg_cropB_hsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropB_hsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropB_hsync;

    /* 0x1CC : cropB_vsync */
    union {
        struct {
            uint32_t reg_cropB_vsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropB_vsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropB_vsync;

    /* 0x1D0 : cropC_hsync */
    union {
        struct {
            uint32_t reg_cropC_hsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropC_hsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropC_hsync;

    /* 0x1D4 : cropC_vsync */
    union {
        struct {
            uint32_t reg_cropC_vsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropC_vsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropC_vsync;

