bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/spp_misc_reg.h
    /* 0x1D8 : cropD_hsync */
    union {
        struct {
            uint32_t reg_cropD_hsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropD_hsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropD_hsync;

    /* 0x1DC : cropD_vsync */
    union {
        struct {
            uint32_t reg_cropD_vsync_start          : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_cropD_vsync_end            : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } cropD_vsync;

    /* 0x1E0 : crop_enable */
    union {
        struct {
            uint32_t reg_cropA_enable               :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_cropB_enable               :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_cropC_enable               :  1; /* [    2],        r/w,        0x0 */
            uint32_t reg_cropD_enable               :  1; /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } crop_enable;

    /* 0x1e4  reserved */
    uint8_t RESERVED0x1e4[24];

    /* 0x1FC : disp_gma_cfg */
    union {
        struct {
            uint32_t reg_dp_gma_ch0_en              :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_dp_gma_ch1_en              :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_dp_gma_ch2_en              :  1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31                  : 29; /* [31: 3],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } disp_gma_cfg;

    /* 0x200 : disp_gma_curve_00 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_00            :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_dp_gma_curve_01            :  8; /* [15: 8],        r/w,        0x1 */
            uint32_t reg_dp_gma_curve_02            :  8; /* [23:16],        r/w,        0x2 */
            uint32_t reg_dp_gma_curve_03            :  8; /* [31:24],        r/w,        0x3 */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_00;

    /* 0x204 : disp_gma_curve_04 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_04            :  8; /* [ 7: 0],        r/w,        0x4 */
            uint32_t reg_dp_gma_curve_05            :  8; /* [15: 8],        r/w,        0x5 */
            uint32_t reg_dp_gma_curve_06            :  8; /* [23:16],        r/w,        0x6 */
            uint32_t reg_dp_gma_curve_07            :  8; /* [31:24],        r/w,        0x7 */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_04;

    /* 0x208 : disp_gma_curve_08 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_08            :  8; /* [ 7: 0],        r/w,        0x8 */
            uint32_t reg_dp_gma_curve_09            :  8; /* [15: 8],        r/w,        0x9 */
            uint32_t reg_dp_gma_curve_0a            :  8; /* [23:16],        r/w,        0xa */
            uint32_t reg_dp_gma_curve_0b            :  8; /* [31:24],        r/w,        0xb */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_08;

    /* 0x20C : disp_gma_curve_0c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_0c            :  8; /* [ 7: 0],        r/w,        0xc */
            uint32_t reg_dp_gma_curve_0d            :  8; /* [15: 8],        r/w,        0xd */
            uint32_t reg_dp_gma_curve_0e            :  8; /* [23:16],        r/w,        0xe */
            uint32_t reg_dp_gma_curve_0f            :  8; /* [31:24],        r/w,        0xf */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_0c;

    /* 0x210 : disp_gma_curve_10 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_10            :  8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t reg_dp_gma_curve_11            :  8; /* [15: 8],        r/w,       0x11 */
            uint32_t reg_dp_gma_curve_12            :  8; /* [23:16],        r/w,       0x12 */
            uint32_t reg_dp_gma_curve_13            :  8; /* [31:24],        r/w,       0x13 */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_10;

    /* 0x214 : disp_gma_curve_14 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_14            :  8; /* [ 7: 0],        r/w,       0x14 */
            uint32_t reg_dp_gma_curve_15            :  8; /* [15: 8],        r/w,       0x15 */
            uint32_t reg_dp_gma_curve_16            :  8; /* [23:16],        r/w,       0x16 */
            uint32_t reg_dp_gma_curve_17            :  8; /* [31:24],        r/w,       0x17 */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_14;

    /* 0x218 : disp_gma_curve_18 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_18            :  8; /* [ 7: 0],        r/w,       0x18 */
            uint32_t reg_dp_gma_curve_19            :  8; /* [15: 8],        r/w,       0x19 */
            uint32_t reg_dp_gma_curve_1a            :  8; /* [23:16],        r/w,       0x1a */
            uint32_t reg_dp_gma_curve_1b            :  8; /* [31:24],        r/w,       0x1b */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_18;

    /* 0x21C : disp_gma_curve_1c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_1c            :  8; /* [ 7: 0],        r/w,       0x1c */
            uint32_t reg_dp_gma_curve_1d            :  8; /* [15: 8],        r/w,       0x1d */
            uint32_t reg_dp_gma_curve_1e            :  8; /* [23:16],        r/w,       0x1e */
            uint32_t reg_dp_gma_curve_1f            :  8; /* [31:24],        r/w,       0x1f */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_1c;

    /* 0x220 : disp_gma_curve_20 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_20            :  8; /* [ 7: 0],        r/w,       0x20 */
            uint32_t reg_dp_gma_curve_21            :  8; /* [15: 8],        r/w,       0x21 */
            uint32_t reg_dp_gma_curve_22            :  8; /* [23:16],        r/w,       0x22 */
            uint32_t reg_dp_gma_curve_23            :  8; /* [31:24],        r/w,       0x23 */
        }BF;
        uint32_t WORD;
    } disp_gma_curve_20;

